// Class ChromaSDKPlugin.ChromaSDKPluginAnimation1DObject
// Size: 0x78 (Inherited: 0x28)
struct UChromaSDKPluginAnimation1DObject : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	enum class EChromaSDKDevice1DEnum Device; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct TArray<struct FChromaSDKColorFrame1D> Frames; // 0x38(0x10)
	char UnknownData_48[0x30]; // 0x48(0x30)

	void Unload(); // Function ChromaSDKPlugin.ChromaSDKPluginAnimation1DObject.Unload // (Final|Native|Public|BlueprintCallable) // @ game+0xedc9e0
	bool IsLoaded(); // Function ChromaSDKPlugin.ChromaSDKPluginAnimation1DObject.IsLoaded // (Final|Native|Public|BlueprintCallable) // @ game+0xed64a0
};

// Class ChromaSDKPlugin.ChromaSDKPluginAnimation2DObject
// Size: 0x78 (Inherited: 0x28)
struct UChromaSDKPluginAnimation2DObject : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
	enum class EChromaSDKDevice2DEnum Device; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
	struct TArray<struct FChromaSDKColorFrame2D> Frames; // 0x38(0x10)
	char UnknownData_48[0x30]; // 0x48(0x30)

	void Unload(); // Function ChromaSDKPlugin.ChromaSDKPluginAnimation2DObject.Unload // (Final|Native|Public|BlueprintCallable) // @ game+0xedc9e0
	bool IsLoaded(); // Function ChromaSDKPlugin.ChromaSDKPluginAnimation2DObject.IsLoaded // (Final|Native|Public|BlueprintCallable) // @ game+0xed64a0
};

// Class ChromaSDKPlugin.ChromaSDKPluginBPLibrary
// Size: 0x28 (Inherited: 0x28)
struct UChromaSDKPluginBPLibrary : UBlueprintFunctionLibrary {

	void UnloadAnimationName(struct FString animationName); // Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.UnloadAnimationName // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xedca70
	void UnloadAnimation(int32_t animationId); // Function ChromaSDKPlugin.ChromaSDKPluginBPLibrary.UnloadAnimation // (Final|Native|Static|Public|BlueprintCallable) // @ game+0xedca00
