// AnimBlueprintGeneratedClass MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C
// Size: 0x38c6 (Inherited: 0xdd0)
struct UMadMan_Preview_AnimBlueprint_C : UMadPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xdd0(0x08)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30; // 0xdd8(0x78)
	struct FAnimNode_RigLogic AnimGraphNode_RigLogic; // 0xe50(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0xef0(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0xfb0(0xa0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x1050(0x30)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x1080(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x1138(0x28)
	struct FAnimNode_BlendListByObjectType AnimGraphNode_BlendByObjectType; // 0x1160(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29; // 0x1210(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28; // 0x1288(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x1300(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_12; // 0x13a0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_12; // 0x13d0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27; // 0x1480(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26; // 0x14f8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x1570(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_11; // 0x1610(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_11; // 0x1640(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25; // 0x16f0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24; // 0x1768(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x17e0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_10; // 0x1880(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_10; // 0x18b0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23; // 0x1960(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22; // 0x19d8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x1a50(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_9; // 0x1af0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_9; // 0x1b20(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21; // 0x1bd0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x1c48(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20; // 0x1ce8(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_8; // 0x1d60(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_8; // 0x1d90(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19; // 0x1e40(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x1eb8(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18; // 0x1f58(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_7; // 0x1fd0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_7; // 0x2000(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17; // 0x20b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16; // 0x2128(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x21a0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_6; // 0x2240(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_6; // 0x2270(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15; // 0x2320(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14; // 0x2398(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x2410(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x24b0(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_5; // 0x24e0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13; // 0x2590(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12; // 0x2608(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x2680(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x2720(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_4; // 0x2750(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11; // 0x2800(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10; // 0x2878(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x28f0(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x2990(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_3; // 0x29c0(0xb0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9; // 0x2a70(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8; // 0x2ae8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x2b60(0xa0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x2c00(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x2c30(0xb0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x2ce0(0xb8)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7; // 0x2d98(0x78)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x2e10(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x2e40(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x2ef0(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x2f50(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x3010(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6; // 0x30b0(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5; // 0x3128(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x31a0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x3240(0x78)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x32b8(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x3330(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x33d0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x3488(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x34b0(0x78)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x3528(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x35c8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x35f0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x36a8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x36d0(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x3748(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x37a8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x37d0(0xc0)
	char UnknownData_3890_0 : 7; // 0x3890(0x01)
	bool IsMale : 1; // 0x3890(0x01)
	char UnknownData_3891[0x7]; // 0x3891(0x07)
	struct UDNAContext* DNA_Context; // 0x3898(0x08)
	char UnknownData_38A0_0 : 7; // 0x38a0(0x01)
	bool ImInInventory : 1; // 0x38a0(0x01)
	char UnknownData_38A1[0x7]; // 0x38a1(0x07)
	struct UWeaponType* CurrentWeaponType; // 0x38a8(0x08)
	struct AMadWeapon* CurrentWeaponClass; // 0x38b0(0x08)
	struct UBlendSpaceBase* CurrentGripAnimation; // 0x38b8(0x08)
	float BlendTime; // 0x38c0(0x04)
	char UnknownData_38C4_0 : 7; // 0x38c4(0x01)
	bool ImInCharSelectionScreen : 1; // 0x38c4(0x01)
	char UnknownData_38C5_0 : 7; // 0x38c5(0x01)
	bool ImInEmotesScreen : 1; // 0x38c5(0x01)

	void AnimGraph(struct FPoseLink AnimGraph); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void WhereAmI(); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.WhereAmI // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void Gender(); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.Gender // (Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintInitializeAnimation(); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintBeginPlay(); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void DNAContextChanged(); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.DNAContextChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void ExecuteUbergraph_MadMan_Preview_AnimBlueprint(int32_t EntryPoint); // Function MadMan_Preview_AnimBlueprint.MadMan_Preview_AnimBlueprint_C.ExecuteUbergraph_MadMan_Preview_AnimBlueprint // (Final|UbergraphFunction) // @ game+0x1a35c70
};

