// AnimBlueprintGeneratedClass MadMan_AnimBlueprint.MadMan_AnimBlueprint_C
// Size: 0x8da4 (Inherited: 0xdd0)
struct UMadMan_AnimBlueprint_C : UMadPlayerAnimInstance {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0xdd0(0x08)
	struct FAnimNode_Slot AnimGraphNode_Slot_32; // 0xdd8(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_29; // 0xe38(0xb8)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8; // 0xef0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7; // 0xf18(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6; // 0xf40(0x28)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5; // 0xf68(0xe0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_23; // 0x1048(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4; // 0x10e8(0xe0)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_5; // 0x11c8(0x30)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation_6; // 0x11f8(0x100)
	struct FAnimNode_TransitionsGate AnimGraphNode_TransitionsGate; // 0x12f8(0x128)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation_5; // 0x1420(0x100)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation_4; // 0x1520(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_4; // 0x1620(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine_2; // 0x1650(0xb0)
	struct FAnimNode_Slot AnimGraphNode_Slot_31; // 0x1700(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_30; // 0x1760(0x60)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2; // 0x17c0(0x198)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_84; // 0x1958(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_22; // 0x1980(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4; // 0x1a20(0x78)
	struct FAnimNode_Slot AnimGraphNode_Slot_29; // 0x1a98(0x60)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3; // 0x1af8(0xe0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_28; // 0x1bd8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_21; // 0x1c90(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_28; // 0x1d30(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_27; // 0x1d90(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_27; // 0x1e48(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_26; // 0x1ea8(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_26; // 0x1f08(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_22; // 0x1fc0(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_20; // 0x2080(0xa0)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2; // 0x2120(0xe0)
	struct FAnimNode_Slot AnimGraphNode_Slot_25; // 0x2200(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_19; // 0x2260(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_24; // 0x2300(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_25; // 0x2360(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_21; // 0x2418(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_24; // 0x24d8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_83; // 0x2590(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_82; // 0x25b8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_20; // 0x25e0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_19; // 0x26a0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_18; // 0x2760(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_81; // 0x2820(0x28)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation_3; // 0x2848(0x100)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17; // 0x2948(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_18; // 0x2a08(0xa0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16; // 0x2aa8(0xc0)
	struct FAnimNode_Root AnimGraphNode_Root; // 0x2b68(0x30)
	struct FAnimNode_Slot AnimGraphNode_Slot_23; // 0x2b98(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15; // 0x2bf8(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_23; // 0x2cb8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_80; // 0x2d70(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_79; // 0x2d98(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_78; // 0x2dc0(0x28)
	char UnknownData_2DE8[0x8]; // 0x2de8(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_4; // 0x2df0(0x190)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone_2; // 0x2f80(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7; // 0x3078(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7; // 0x3098(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6; // 0x30b8(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6; // 0x30d8(0x20)
	char UnknownData_30F8[0x8]; // 0x30f8(0x08)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_3; // 0x3100(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14; // 0x3290(0xc0)
	struct FAnimNode_CopyBone AnimGraphNode_CopyBone; // 0x3350(0xf8)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5; // 0x3448(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5; // 0x3468(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4; // 0x3488(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4; // 0x34a8(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_77; // 0x34c8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13; // 0x34f0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_22; // 0x35b0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_76; // 0x3668(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12; // 0x3690(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_75; // 0x3750(0x28)
	struct FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace; // 0x3778(0x198)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4; // 0x3910(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_22; // 0x39d8(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11; // 0x3a38(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_21; // 0x3af8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_74; // 0x3bb0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_73; // 0x3bd8(0x28)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_3; // 0x3c00(0x120)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController_2; // 0x3d20(0x120)
	struct FAnimNode_BoneDrivenController AnimGraphNode_BoneDrivenController; // 0x3e40(0x120)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5; // 0x3f60(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4; // 0x4070(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3; // 0x4180(0x110)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_17; // 0x4290(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_20; // 0x4330(0xb8)
	struct FAnimNode_Slot AnimGraphNode_Slot_21; // 0x43e8(0x60)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_3; // 0x4448(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19; // 0x44e8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_72; // 0x45a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_71; // 0x45c8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_20; // 0x45f0(0x60)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt_2; // 0x4650(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18; // 0x46f0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_70; // 0x47a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_69; // 0x47d0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_19; // 0x47f8(0x60)
	struct FAnimNode_BlendListByInt AnimGraphNode_BlendListByInt; // 0x4858(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17; // 0x48f8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_68; // 0x49b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_67; // 0x49d8(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3; // 0x4a00(0x78)
	struct FAnimNode_RigLogic AnimGraphNode_RigLogic; // 0x4a78(0xa0)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2; // 0x4b18(0xc8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10; // 0x4be0(0xc0)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik_2; // 0x4ca0(0x190)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9; // 0x4e30(0xc0)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3; // 0x4ef0(0x20)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3; // 0x4f10(0x20)
	struct FAnimNode_Fabrik AnimGraphNode_Fabrik; // 0x4f30(0x190)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_66; // 0x50c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_65; // 0x50e8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16; // 0x5110(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_64; // 0x51c8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_18; // 0x51f0(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_17; // 0x5250(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15; // 0x52b0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_63; // 0x5368(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_62; // 0x5390(0x28)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2; // 0x53b8(0x78)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3; // 0x5430(0xc8)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2; // 0x54f8(0x110)
	struct FAnimNode_ModifyBone AnimGraphNode_ModifyBone; // 0x5608(0x110)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2; // 0x5718(0x20)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_16; // 0x5738(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_15; // 0x57d8(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_16; // 0x5878(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_15; // 0x58d8(0x60)
	struct FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive; // 0x5938(0xc8)
	struct FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer; // 0x5a00(0xe0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8; // 0x5ae0(0xc0)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7; // 0x5ba0(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14; // 0x5c60(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13; // 0x5d18(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_61; // 0x5dd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_60; // 0x5df8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_59; // 0x5e20(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_58; // 0x5e48(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_14; // 0x5e70(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_14; // 0x5f10(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6; // 0x5f70(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_57; // 0x6030(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_13; // 0x6058(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_56; // 0x60f8(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5; // 0x6120(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_12; // 0x61e0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_55; // 0x6280(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_11; // 0x62a8(0xa0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12; // 0x6348(0xb8)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4; // 0x6400(0xc0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_10; // 0x64c0(0xa0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_54; // 0x6560(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_53; // 0x6588(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5; // 0x65b0(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4; // 0x65d8(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3; // 0x6600(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2; // 0x6628(0x28)
	struct FAnimNode_TransitionResult AnimGraphNode_TransitionResult; // 0x6650(0x28)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation_2; // 0x6678(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_3; // 0x6778(0x30)
	struct FAnimNode_SingleAnimation AnimGraphNode_SingleAnimation; // 0x67a8(0x100)
	struct FAnimNode_StateResult AnimGraphNode_StateResult_2; // 0x68a8(0x30)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_52; // 0x68d8(0x28)
	struct FAnimNode_StateResult AnimGraphNode_StateResult; // 0x6900(0x30)
	struct FAnimNode_StateMachine AnimGraphNode_StateMachine; // 0x6930(0xb0)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2; // 0x69e0(0xc8)
	struct FAnimNode_Slot AnimGraphNode_Slot_13; // 0x6aa8(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_9; // 0x6b08(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_12; // 0x6ba8(0x60)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11; // 0x6c08(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_51; // 0x6cc0(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_11; // 0x6ce8(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_8; // 0x6d48(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_10; // 0x6de8(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3; // 0x6e48(0xc0)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10; // 0x6f08(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9; // 0x6fc0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_50; // 0x7078(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_49; // 0x70a0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_48; // 0x70c8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot_9; // 0x70f0(0x60)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7; // 0x7150(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_8; // 0x71f0(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_47; // 0x7250(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_46; // 0x7278(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8; // 0x72a0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_45; // 0x7358(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_44; // 0x7380(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7; // 0x73a8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_43; // 0x7460(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_42; // 0x7488(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6; // 0x74b0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5; // 0x7550(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_7; // 0x75f0(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_6; // 0x7650(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_41; // 0x76b0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_40; // 0x76d8(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6; // 0x7700(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_39; // 0x77b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_38; // 0x77e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_37; // 0x7808(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_36; // 0x7830(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_35; // 0x7858(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_34; // 0x7880(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_33; // 0x78a8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_32; // 0x78d0(0x28)
	struct FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend; // 0x78f8(0xc8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4; // 0x79c0(0xa0)
	struct FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer; // 0x7a60(0x78)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31; // 0x7ad8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30; // 0x7b00(0x28)
	struct FAnimNode_LayeredBoneBlendConstrained AnimGraphNode_LayeredBoneBlendConstrained_2; // 0x7b28(0x108)
	struct FAnimNode_Slot AnimGraphNode_Slot_5; // 0x7c30(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29; // 0x7c90(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28; // 0x7cb8(0x28)
	struct FAnimNode_ApplyAdditiveConstrained AnimGraphNode_ApplyAdditiveConstrained; // 0x7ce0(0xe8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5; // 0x7dc8(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27; // 0x7e80(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26; // 0x7ea8(0x28)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3; // 0x7ed0(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_4; // 0x7f70(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25; // 0x7fd0(0x28)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4; // 0x7ff8(0xb8)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2; // 0x80b0(0xa0)
	struct FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool; // 0x8150(0xa0)
	struct FAnimNode_Slot AnimGraphNode_Slot_3; // 0x81f0(0x60)
	struct FAnimNode_Slot AnimGraphNode_Slot_2; // 0x8250(0x60)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2; // 0x82b0(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24; // 0x8370(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23; // 0x8398(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22; // 0x83c0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21; // 0x83e8(0x28)
	struct FAnimNode_LayeredBoneBlendConstrained AnimGraphNode_LayeredBoneBlendConstrained; // 0x8410(0x108)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3; // 0x8518(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20; // 0x85d0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19; // 0x85f8(0x28)
	struct FAnimNode_Slot AnimGraphNode_Slot; // 0x8620(0x60)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18; // 0x8680(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17; // 0x86a8(0x28)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2; // 0x86d0(0x20)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16; // 0x86f0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15; // 0x8718(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14; // 0x8740(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13; // 0x8768(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12; // 0x8790(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11; // 0x87b8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10; // 0x87e0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9; // 0x8808(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8; // 0x8830(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7; // 0x8858(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6; // 0x8880(0x28)
	struct FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend; // 0x88a8(0xc0)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5; // 0x8968(0x28)
	struct FAnimNode_FootPlacement AnimGraphNode_FootPlacement; // 0x8990(0x168)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace; // 0x8af8(0x20)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace; // 0x8b18(0x20)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2; // 0x8b38(0xb8)
	struct FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose; // 0x8bf0(0xb8)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4; // 0x8ca8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3; // 0x8cd0(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2; // 0x8cf8(0x28)
	struct FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose; // 0x8d20(0x28)
	char UnknownData_8D48_0 : 7; // 0x8d48(0x01)
	bool IsSliding : 1; // 0x8d48(0x01)
	char UnknownData_8D49[0x7]; // 0x8d49(0x07)
	struct UDNAContext* DNA_Context; // 0x8d50(0x08)
	struct FVector IKPelvisTargetLocation; // 0x8d58(0x0c)
	struct FRotator IKPelvisTargetRotation; // 0x8d64(0x0c)
	struct FVector IKHandRTargetLocation; // 0x8d70(0x0c)
	struct FRotator IKHandRTargetRotation; // 0x8d7c(0x0c)
	struct FVector IKHandLTargetLocation; // 0x8d88(0x0c)
	struct FRotator IKHandLTargetRotation; // 0x8d94(0x0c)
	float DebugAlpha_1; // 0x8da0(0x04)

	void AnimGraph(struct FPoseLink AnimGraph); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.AnimGraph // (HasOutParms|BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintUpdateAnimation(float DeltaTimeX); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.BlueprintUpdateAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintInitializeAnimation(); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.BlueprintInitializeAnimation // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void BlueprintBeginPlay(); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.BlueprintBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void DNAContexChanged(); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.DNAContexChanged // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void ExecuteUbergraph_MadMan_AnimBlueprint(int32_t EntryPoint); // Function MadMan_AnimBlueprint.MadMan_AnimBlueprint_C.ExecuteUbergraph_MadMan_AnimBlueprint // (Final|UbergraphFunction) // @ game+0x1a35c70
};

