// Class Madness.AccoladeRecordBaseWidget
// Size: 0x238 (Inherited: 0x230)
struct UAccoladeRecordBaseWidget : UUserWidget {
	char UnknownData_230[0x8]; // 0x230(0x08)

	void SetAccolade(struct UMadEnochAccolade* InAccolade); // Function Madness.AccoladeRecordBaseWidget.SetAccolade // (Final|Native|Public|BlueprintCallable) // @ game+0x150fe50
	void OnSetAccolade(); // Function Madness.AccoladeRecordBaseWidget.OnSetAccolade // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	struct UMadEnochAccolade* GetAccolade(); // Function Madness.AccoladeRecordBaseWidget.GetAccolade // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x150ee90
};

// Class Madness.MadAnimNotify_AttackEarlyExit
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_AttackEarlyExit : UFWAnimNotify {
};

// Class Madness.MadAnimNotify_StartDistanceAttack
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_StartDistanceAttack : UFWAnimNotify {
};

// Class Madness.MadAnimNotify_StopDistanceAttack
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_StopDistanceAttack : UFWAnimNotify {
};

// Class Madness.MadAnimNotifyState_DisableIK
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotifyState_DisableIK : UFWAnimNotifyState {
};

// Class Madness.MadAnimNotifyState_Targeting
// Size: 0x48 (Inherited: 0x40)
struct UMadAnimNotifyState_Targeting : UFWAnimNotifyState {
	char NarrowAiming : 1; // 0x40(0x01)
	char UnknownData_40_1 : 7; // 0x40(0x01)
	char UnknownData_41[0x7]; // 0x41(0x07)
};

// Class Madness.MadAnimNotify_StartTargeting
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_StartTargeting : UFWAnimNotify {
};

// Class Madness.MadAnimNotify_StopTargeting
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_StopTargeting : UFWAnimNotify {
};

// Class Madness.MadAnimNotify_KillOutsideRecoverArea
// Size: 0x40 (Inherited: 0x40)
struct UMadAnimNotify_KillOutsideRecoverArea : UFWAnimNotify {
};

// Class Madness.MadAnimNotify_ApplyGameplayEffectToActor
// Size: 0x48 (Inherited: 0x40)
struct UMadAnimNotify_ApplyGameplayEffectToActor : UFWAnimNotify {
	struct UMadGameplayEffect* GameplayEffect; // 0x40(0x08)
};

// Class Madness.MadAnimNotifyState_ApplyLooseGameplayTag
// Size: 0x60 (Inherited: 0x40)
struct UMadAnimNotifyState_ApplyLooseGameplayTag : UFWAnimNotifyState {
	struct FGameplayTagContainer TagsToAdd; // 0x40(0x20)
};

// Class Madness.MadAnimNotifyState_SpawnTargetingMarker
// Size: 0x80 (Inherited: 0x40)
struct UMadAnimNotifyState_SpawnTargetingMarker : UFWAnimNotifyState {
	struct FMadAITargetMarker MarkerParticle; // 0x40(0x28)
	char bApplyToAllTargets : 1; // 0x68(0x01)
	char bApplyToSelf : 1; // 0x68(0x01)
	char bUseMovePrediction : 1; // 0x68(0x01)
	char UnknownData_68_3 : 5; // 0x68(0x01)
	char UnknownData_69[0x17]; // 0x69(0x17)
};

// Class Madness.MadAnimNotifyState_SpawnTargetMarkerAndExplosion
// Size: 0xa0 (Inherited: 0x40)
struct UMadAnimNotifyState_SpawnTargetMarkerAndExplosion : UFWAnimNotifyState {
	struct FMadAITargetMarker MarkerParticle; // 0x40(0x28)
	struct UExplosionTemplate* ExplosionTemplate; // 0x68(0x08)
	struct AMadDamageArea* DamageOverTimeArea; // 0x70(0x08)
	char bSelfActor : 1; // 0x78(0x01)
	char bAllEnemies : 1; // 0x78(0x01)
	char bUseMovementPrediction : 1; // 0x78(0x01)
	char UnknownData_78_3 : 5; // 0x78(0x01)
	char UnknownData_79[0x27]; // 0x79(0x27)
};

// Class Madness.MadAnimNotifyState_ApplyShaderEffect
// Size: 0x68 (Inherited: 0x40)
struct UMadAnimNotifyState_ApplyShaderEffect : UFWAnimNotifyState {
	struct UMadCharacterShaderEffect* CharacterShaderEffect; // 0x40(0x08)
	struct UMadWeaponShaderEffect* WeaponShaderEffect; // 0x48(0x08)
	struct FGameplayTag ShaderEffectGameplayTag; // 0x50(0x08)
	struct TArray<struct UMadShaderEffect*> AppliedShaderEffects; // 0x58(0x10)
};

// Class Madness.AnalyticsArrowComponent
// Size: 0x4f0 (Inherited: 0x4e0)
struct UAnalyticsArrowComponent : UArrowComponent {
	struct TArray<float> Stats; // 0x4e0(0x10)
};

// Class Madness.AnimInstanceWithLateral
// Size: 0x3b0 (Inherited: 0x380)
struct UAnimInstanceWithLateral : UFWAnimInstance_Base {
	char UnknownData_380[0x8]; // 0x380(0x08)
	struct UDNAContext* DNAContext; // 0x388(0x08)
	char UnknownData_390[0x20]; // 0x390(0x20)
};

// Class Madness.AnimSyncHelper
// Size: 0x308 (Inherited: 0x2f0)
struct AAnimSyncHelper : AActor {
	struct TArray<struct UMadNPCReactionComponent*> SyncNPCReactionComponents; // 0x2f0(0x10)
	char UnknownData_300[0x8]; // 0x300(0x08)
};

// Class Madness.BallLightning
// Size: 0x408 (Inherited: 0x2f0)
struct ABallLightning : AActor {
	float FlyHeight; // 0x2f0(0x04)
	char UnknownData_2F4[0x4]; // 0x2f4(0x04)
	struct UMadDamageType* Electro; // 0x2f8(0x08)
	struct AMadPlayerCharacter* PlayerClass; // 0x300(0x08)
	struct UParticleSystem* DamageParticleSystem; // 0x308(0x08)
	struct UCurveTable* EnemySkillsValues; // 0x310(0x08)
	struct UParticleSystemComponent* LightningBallStrike; // 0x318(0x08)
	struct UAudioComponent* ElectroLoop; // 0x320(0x08)
	struct UAudioComponent* ElectroShockEffect; // 0x328(0x08)
	struct USceneComponent* BallMain; // 0x330(0x08)
	struct UCapsuleComponent* BallDamageTrigger; // 0x338(0x08)
	struct USceneComponent* Scene; // 0x340(0x08)
	struct USphereComponent* SphereRange; // 0x348(0x08)
	struct UParticleSystemComponent* Beam0; // 0x350(0x08)
	struct UParticleSystemComponent* Beam1; // 0x358(0x08)
	struct UParticleSystemComponent* Beam2; // 0x360(0x08)
	struct UParticleSystemComponent* Beam3; // 0x368(0x08)
	char UnknownData_370[0x10]; // 0x370(0x10)
	struct UParticleSystemComponent* ElectroBall; // 0x380(0x08)
	struct USceneComponent* Link; // 0x388(0x08)
	struct UParticleSystemComponent* BeamLink; // 0x390(0x08)
	struct UBoxComponent* BeamDamageTrigger; // 0x398(0x08)
	struct UMadAIGameplayAbility* Ability; // 0x3a0(0x08)
	char UnknownData_3A8[0x40]; // 0x3a8(0x40)
	struct FVector CurrentDestination; // 0x3e8(0x0c)
	char UnknownData_3F4[0x14]; // 0x3f4(0x14)

	void SetupElectroBall(struct UMadAIGameplayAbility* AiAbility, bool bIsPositive); // Function Madness.BallLightning.SetupElectroBall // (Final|Native|Public|BlueprintCallable) // @ game+0x1510000
	void RunEQS(); // Function Madness.BallLightning.RunEQS // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void OnRep_DestinationSet(); // Function Madness.BallLightning.OnRep_DestinationSet // (Final|Native|Private) // @ game+0x150fe30
	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Madness.BallLightning.OnOverlapEnd // (Final|Native|Private) // @ game+0x150fa30
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.BallLightning.OnOverlapBegin // (Final|Native|Private|HasOutParms) // @ game+0x150f2e0
	void OnInterrupted(); // Function Madness.BallLightning.OnInterrupted // (Final|Native|Private) // @ game+0x150edf0
	void OnEQSFinished(struct UEnvQueryInstanceBlueprintWrapper* QueryInstance, enum class EEnvQueryStatus QueryStatus); // Function Madness.BallLightning.OnEQSFinished // (Final|Native|Protected|BlueprintCallable) // @ game+0x150f220
	void OnDamageTick(); // Function Madness.BallLightning.OnDamageTick // (Final|Native|Private) // @ game+0x150f200
	void OnCastReleased(); // Function Madness.BallLightning.OnCastReleased // (Final|Native|Private) // @ game+0x150f060
	void OnCasterDeath(struct ABaseCharacter* character, struct FTakeHitInfo TakeHitInfo); // Function Madness.BallLightning.OnCasterDeath // (Final|Native|Private) // @ game+0x150f080
	void ElectroBallTimerEnded(); // Function Madness.BallLightning.ElectroBallTimerEnded // (Final|Native|Private) // @ game+0x150edf0
};

// Class Madness.BaseUIModel
// Size: 0x50 (Inherited: 0x28)
struct UBaseUIModel : UObject {
	char UnknownData_28[0x28]; // 0x28(0x28)
};

// Class Madness.BlinkWave
// Size: 0x2f0 (Inherited: 0x2f0)
struct ABlinkWave : AActor {
};

// Class Madness.ChainDealer
// Size: 0x350 (Inherited: 0x2f0)
struct AChainDealer : AActor {
	struct AMadBaseCharacter* HostCharacter; // 0x2f0(0x08)
	struct FActiveGameplayEffectHandle Handle; // 0x2f8(0x08)
	struct TArray<struct AMadBaseCharacter*> SickPlayers; // 0x300(0x10)
	float BaseDamage; // 0x310(0x04)
	char UnknownData_314[0x4]; // 0x314(0x04)
	struct UParticleSystem* Emitter; // 0x318(0x08)
	struct UParticleSystemComponent* Beam; // 0x320(0x08)
	struct UDamageType* DamageTypeClass; // 0x328(0x08)
	struct UGameplayEffect* ChainLightingSickClass; // 0x330(0x08)
	struct TArray<struct FTargetChain> TargetChainArray; // 0x338(0x10)
	char UnknownData_348_0 : 7; // 0x348(0x01)
	bool bCanDealDamage : 1; // 0x348(0x01)
	char UnknownData_349[0x7]; // 0x349(0x07)

	void UpdateLightningBeam(struct AMadBaseCharacter* character, bool bToggle); // Function Madness.ChainDealer.UpdateLightningBeam // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x1510150
	void UnLinkPlayerWithHost(struct AActor* OtherActor); // Function Madness.ChainDealer.UnLinkPlayerWithHost // (Final|Native|Public|BlueprintCallable) // @ game+0x15100d0
	void SetHost(struct AActor* Host); // Function Madness.ChainDealer.SetHost // (Final|Native|Public|BlueprintCallable) // @ game+0x150ff80
	void LinkPlayerWithHost(struct AActor* Actor); // Function Madness.ChainDealer.LinkPlayerWithHost // (Final|Native|Public|BlueprintCallable) // @ game+0x150efe0
	void DestroyEffectsOnOtherPlayers(struct FTargetChain Target); // Function Madness.ChainDealer.DestroyEffectsOnOtherPlayers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x150ed40
	void DestroyEffectsOnHost(); // Function Madness.ChainDealer.DestroyEffectsOnHost // (Final|Native|Public|BlueprintCallable) // @ game+0x150ed20
	void ApplyDamageToOtherPlayer(); // Function Madness.ChainDealer.ApplyDamageToOtherPlayer // (Final|Native|Public|BlueprintCallable) // @ game+0x150ea40
	void ApplyDamageToHost(); // Function Madness.ChainDealer.ApplyDamageToHost // (Final|Native|Public|BlueprintCallable) // @ game+0x150ea20
};

// Class Madness.ChainsCatchCenterDamageArea
// Size: 0x388 (Inherited: 0x2f0)
struct AChainsCatchCenterDamageArea : AActor {
	struct USceneComponent* SceneRoot; // 0x2f0(0x08)
	struct USphereComponent* Sphere; // 0x2f8(0x08)
	struct UAudioComponent* AudioLoop; // 0x300(0x08)
	struct UDecalComponent* Decal; // 0x308(0x08)
	struct UAudioComponent* HeatwaveStereoCue; // 0x310(0x08)
	struct TArray<struct AActor*> AffectedActors; // 0x318(0x10)
	float Damage; // 0x328(0x04)
	float DamgeLoopTime; // 0x32c(0x04)
	struct FTimerHandle TimerHandle; // 0x330(0x08)
	struct UCurveTable* EnemySkillsValues; // 0x338(0x08)
	struct FGameplayAttribute LevelAttribute; // 0x340(0x38)
	struct UDamageType* DamageTypeClass; // 0x378(0x08)
	char UnknownData_380[0x8]; // 0x380(0x08)

	void OnOverlapEnd(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Madness.ChainsCatchCenterDamageArea.OnOverlapEnd // (Final|Native|Public) // @ game+0x150fb70
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.ChainsCatchCenterDamageArea.OnOverlapBegin // (Final|Native|Public|HasOutParms) // @ game+0x150f550
	void CallDeactivateArea(); // Function Madness.ChainsCatchCenterDamageArea.CallDeactivateArea // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void CallApplyFire(struct AActor* Player, struct AActor* Victim, bool bBoss); // Function Madness.ChainsCatchCenterDamageArea.CallApplyFire // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void ApplyDamageOverTime(); // Function Madness.ChainsCatchCenterDamageArea.ApplyDamageOverTime // (Final|Native|Public|BlueprintCallable) // @ game+0x150ea00
};

// Class Madness.ChainsCrossAreaSingleLine
// Size: 0x390 (Inherited: 0x2f0)
struct AChainsCrossAreaSingleLine : AActor {
	struct USceneComponent* SceneRoot; // 0x2f0(0x08)
	struct UBillboardComponent* Billboard; // 0x2f8(0x08)
	struct UParticleSystemComponent* FXLavaPuddle01; // 0x300(0x08)
	struct UParticleSystemComponent* FXLavaPuddle02; // 0x308(0x08)
	struct UParticleSystemComponent* PVolcanoBossStarAttackLane01; // 0x310(0x08)
	struct UAudioComponent* AudioCrossAttack; // 0x318(0x08)
	struct UStaticMeshComponent* DamageCollision; // 0x320(0x08)
	char UnknownData_328[0x8]; // 0x328(0x08)
	struct FTimerHandle PeriodicDamageHandle; // 0x330(0x08)
	struct AActor* ClassFilter; // 0x338(0x08)
	struct UDamageType* DamageTypeOverTime; // 0x340(0x08)
	struct UDamageType* DamageTypeOnEnter; // 0x348(0x08)
	struct UCurveTable* EnemySkillsValues; // 0x350(0x08)
	struct FGameplayAttribute Attribute; // 0x358(0x38)

	void OnOwnerKilled(struct ABaseCharacter* character, struct FTakeHitInfo TakeHitInfo); // Function Madness.ChainsCrossAreaSingleLine.OnOwnerKilled // (Final|Native|Protected) // @ game+0x150fcb0
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.ChainsCrossAreaSingleLine.OnOverlapBegin // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x150f7c0
	void EvaluateRow(struct FName RowName); // Function Madness.ChainsCrossAreaSingleLine.EvaluateRow // (Final|Native|Public|BlueprintCallable) // @ game+0x150ee10
	void DeactivateFireArea(); // Function Madness.ChainsCrossAreaSingleLine.DeactivateFireArea // (Net|NetReliableNative|Event|NetMulticast|Public|BlueprintCallable) // @ game+0x150ed00
	void CallApplyFire(struct AActor* Player, struct AActor* Victim, bool bBoss); // Function Madness.ChainsCrossAreaSingleLine.CallApplyFire // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void ApplyPeriodicDamage(struct UPrimitiveComponent* MeshArea); // Function Madness.ChainsCrossAreaSingleLine.ApplyPeriodicDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x150ebc0
	void ApplyLavaPeriodicDamage01(); // Function Madness.ChainsCrossAreaSingleLine.ApplyLavaPeriodicDamage01 // (Final|Native|Public|BlueprintCallable) // @ game+0x150eae0
	void ApplyEnterDamage(struct AActor* Object); // Function Madness.ChainsCrossAreaSingleLine.ApplyEnterDamage // (Final|Native|Public|BlueprintCallable) // @ game+0x150ea60
};

// Class Madness.ChainsSmallSphereQuakeProjectile
// Size: 0x328 (Inherited: 0x2f0)
struct AChainsSmallSphereQuakeProjectile : AActor {
	struct USceneComponent* Scene_Root; // 0x2f0(0x08)
	struct USceneComponent* ProjectileMeshRoot; // 0x2f8(0x08)
	struct USphereComponent* DamageArea; // 0x300(0x08)
	struct UAudioComponent* Audio_QuakeSound; // 0x308(0x08)
	struct TArray<struct AMadBaseCharacter*> DamagedEnemies; // 0x310(0x10)
	float Damage; // 0x320(0x04)
	char UnknownData_324[0x4]; // 0x324(0x04)

	void GetDamage(); // Function Madness.ChainsSmallSphereQuakeProjectile.GetDamage // (Final|Native|Public|BlueprintCallable) // @ game+0xe8aaf0
	void DamageCollisionOverlap(struct USphereComponent* SphereComponent, struct AActor* ClassFilter); // Function Madness.ChainsSmallSphereQuakeProjectile.DamageCollisionOverlap // (Final|Native|Public|BlueprintCallable) // @ game+0x150ec40
};

// Class Madness.CombatNumbersSettings
// Size: 0x88 (Inherited: 0x30)
struct UCombatNumbersSettings : UDataAsset {
	struct TMap<enum class EMadCombatNumberType, struct FCombatNumberAnimData> CombatNumberAnimData; // 0x30(0x50)
	struct UCurveFloat* OffsetVsDistanceFactor; // 0x80(0x08)
};

// Class Madness.CustomPhysicsComponent
// Size: 0x570 (Inherited: 0x4f0)
struct UCustomPhysicsComponent : USphereComponent {
	float MinimalValue; // 0x4f0(0x04)
	float SmallRadiusRatio; // 0x4f4(0x04)
	char UnknownData_4F8[0x78]; // 0x4f8(0x78)

	void DisableOverlapLookUp(); // Function Madness.CustomPhysicsComponent.DisableOverlapLookUp // (Final|Native|Public|BlueprintCallable) // @ game+0x150edd0
};

// Class Madness.DischargeMine
// Size: 0x3b8 (Inherited: 0x2f0)
struct ADischargeMine : AActor {
	struct USceneComponent* Root; // 0x2f0(0x08)
	struct UArrowComponent* Arrow; // 0x2f8(0x08)
	struct UBoxComponent* DamageTrigger; // 0x300(0x08)
	struct USceneComponent* Marker; // 0x308(0x08)
	struct UDecalComponent* Decal; // 0x310(0x08)
	struct UStaticMeshComponent* StaticMesh; // 0x318(0x08)
	struct USceneComponent* Discharge; // 0x320(0x08)
	struct UParticleSystemComponent* DischargeMineElectric; // 0x328(0x08)
	struct UAudioComponent* GuardianDischargeMineTrailCue; // 0x330(0x08)
	struct USceneComponent* Debris01; // 0x338(0x08)
	struct UStaticMeshComponent* SMReinforcementWires01; // 0x340(0x08)
	struct USceneComponent* Debris02; // 0x348(0x08)
	struct UStaticMeshComponent* SMGarbages02; // 0x350(0x08)
	struct UStaticMeshComponent* SMGarbages01; // 0x358(0x08)
	struct UParticleSystemComponent* DischargeMarker; // 0x360(0x08)
	struct UParticleSystemComponent* MineShowUp; // 0x368(0x08)
	struct UParticleSystem* EmitterTemplate; // 0x370(0x08)
	struct UDamageType* DamageTypeClass; // 0x378(0x08)
	struct FName AttachPointName; // 0x380(0x08)
	struct UMadAIGameplayAbility* Ability; // 0x388(0x08)
	struct UGameplayEffect* DamageEffectClass; // 0x390(0x08)
	struct FGameplayTag DamageTag; // 0x398(0x08)
	float DURATION; // 0x3a0(0x04)
	float DotInterval; // 0x3a4(0x04)
	float DotDamage; // 0x3a8(0x04)
	char UnknownData_3AC_0 : 7; // 0x3ac(0x01)
	bool bIsMineDeployed : 1; // 0x3ac(0x01)
	char UnknownData_3AD_0 : 7; // 0x3ad(0x01)
	bool bShowElements : 1; // 0x3ad(0x01)
	char UnknownData_3AE[0x2]; // 0x3ae(0x02)
	struct UMaterialInstanceDynamic* MatInstance; // 0x3b0(0x08)

	void Initialize(float InDuration, float InDotDamage, float InDotInterval); // Function Madness.DischargeMine.Initialize // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x150eed0
	void CallSetupDischargeMine(); // Function Madness.DischargeMine.CallSetupDischargeMine // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void ApplyMineDamage(struct UPrimitiveComponent* TriggerComponent, struct AActor* ClassFilter); // Function Madness.DischargeMine.ApplyMineDamage // (Final|Native|Protected|BlueprintCallable) // @ game+0x150eb00
};

// Class Madness.DischargeTrail
// Size: 0x338 (Inherited: 0x2f0)
struct ADischargeTrail : AActor {
	struct UParticleSystemComponent* ParticlesTrailComponent; // 0x2f0(0x08)
	struct UAudioComponent* AudioComponent; // 0x2f8(0x08)
	float UpdateTime; // 0x300(0x04)
	float EndTrailLifeSpan; // 0x304(0x04)
	float AudioFadeOutDuration; // 0x308(0x04)
	char UnknownData_30C[0x2c]; // 0x30c(0x2c)

	void CallSetupTrail(float InTravelTime); // Function Madness.DischargeTrail.CallSetupTrail // (Net|NetReliableNative|Event|NetMulticast|Public) // @ game+0x15148c0
};

// Class Madness.ElectroShockWave
// Size: 0x3a0 (Inherited: 0x2f0)
struct AElectroShockWave : AActor {
	struct UParticleSystemComponent* ShockParticlesComponent; // 0x2f0(0x08)
	struct UAudioComponent* ShockAudioComponent; // 0x2f8(0x08)
	struct USphereComponent* HitCollisionComponent; // 0x300(0x08)
	struct FScalableFloat HitDamageScale; // 0x308(0x20)
	struct FScalableFloat DamageRangeOffsetScale; // 0x328(0x20)
	struct UDamageType* DamageType; // 0x348(0x08)
	struct UParticleSystem* ElectrocutionDamageEffect; // 0x350(0x08)
	float ShockWaveSpeed; // 0x358(0x04)
	float MinShockRadius; // 0x35c(0x04)
	float MaxShockRadius; // 0x360(0x04)
	float RadiusIncreaseTime; // 0x364(0x04)
	float ShockWaveDuration; // 0x368(0x04)
	char UnknownData_36C[0x34]; // 0x36c(0x34)

	void StartShockWave(); // Function Madness.ElectroShockWave.StartShockWave // (Final|Native|Protected|BlueprintCallable) // @ game+0x1516e10
	void SpawnShockEffect(struct AMadBaseCharacter* HitPawn); // Function Madness.ElectroShockWave.SpawnShockEffect // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1516d80
	void PlayEffects(); // Function Madness.ElectroShockWave.PlayEffects // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1516bc0
	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.ElectroShockWave.OnOverlapBegin // (Final|Native|Private|HasOutParms) // @ game+0x15166c0
};

// Class Madness.MadChallengeModData
// Size: 0x28 (Inherited: 0x28)
struct UMadChallengeModData : UObject {
};

// Class Madness.EncounterEnemyEffectModData
// Size: 0x38 (Inherited: 0x28)
struct UEncounterEnemyEffectModData : UMadChallengeModData {
	struct TArray<struct UMadGameplayEffect*> Effects; // 0x28(0x10)
};

// Class Madness.EncounterSetupModData
// Size: 0x38 (Inherited: 0x28)
struct UEncounterSetupModData : UMadChallengeModData {
	struct FString ChallengeModId; // 0x28(0x10)
};

// Class Madness.EnvQueryTest_PathfindingMinDistFromPoint
// Size: 0x420 (Inherited: 0x2f0)
struct UEnvQueryTest_PathfindingMinDistFromPoint : UEnvQueryTest_Pathfinding {
	struct FAIDataProviderBoolValue CompareWithIdealPath; // 0x2f0(0x38)
	struct UEnvQueryContext* IdealPathStartContext; // 0x328(0x08)
	struct UEnvQueryContext* IdealPathEndContext; // 0x330(0x08)
	struct FAIDataProviderBoolValue ComparePathDistanceWithContext; // 0x338(0x38)
	struct FAIDataProviderBoolValue AllowCloseToQueryOwner; // 0x370(0x38)
	struct FAIDataProviderFloatValue AllowDistanceToQuery; // 0x3a8(0x38)
	struct UEnvQueryContext* DistanceCompareContext; // 0x3e0(0x08)
	struct FAIDataProviderFloatValue MinDistancePathFromContext; // 0x3e8(0x38)
};

// Class Madness.ForestBoss_AttractorVolume
// Size: 0x308 (Inherited: 0x2f0)
struct AForestBoss_AttractorVolume : AActor {
	struct FName AttractorId; // 0x2f0(0x08)
	struct UBoxComponent* BoxCollision; // 0x2f8(0x08)
	char UnknownData_300[0x8]; // 0x300(0x08)

	void OnOverlapBegin(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.ForestBoss_AttractorVolume.OnOverlapBegin // (Final|Native|Private|HasOutParms) // @ game+0x1516930
	void OnEndOverlap(struct UPrimitiveComponent* OverlappedComponent, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex); // Function Madness.ForestBoss_AttractorVolume.OnEndOverlap // (Final|Native|Private) // @ game+0x1516060
};

// Class Madness.ForestBoss_DestroyableCover
// Size: 0x310 (Inherited: 0x2f0)
struct AForestBoss_DestroyableCover : AActor {
	struct TArray<struct AActor*> PlayersInCoverShadow; // 0x2f0(0x10)
	struct TArray<struct AActor*> CoverActorsList; // 0x300(0x10)

	void SetCoversEnabled(bool Enabled); // Function Madness.ForestBoss_DestroyableCover.SetCoversEnabled // (Final|Native|Public|BlueprintCallable) // @ game+0x1516cf0
	void DestroyCover(bool instantBreak, bool isGrowl); // Function Madness.ForestBoss_DestroyableCover.DestroyCover // (Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void DamagePlayers(); // Function Madness.ForestBoss_DestroyableCover.DamagePlayers // (Final|Native|Public|BlueprintCallable) // @ game+0x1514a00
	void DamagePlayer(struct AActor* Player); // Function Madness.ForestBoss_DestroyableCover.DamagePlayer // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
};

// Class Madness.ForestBoss_MonsterAttractor
// Size: 0x308 (Inherited: 0x2f0)
struct AForestBoss_MonsterAttractor : AActor {
	struct TArray<struct AForestBoss_AttractorVolume*> Sections; // 0x2f0(0x10)
	struct FName AttractorName; // 0x300(0x08)

	struct FName CalculatePlaceToAttack(); // Function Madness.ForestBoss_MonsterAttractor.CalculatePlaceToAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514880
};

// Class Madness.MadProjectile
// Size: 0x5c0 (Inherited: 0x5a0)
struct AMadProjectile : AProjectile {
	char UnknownData_5A0[0x8]; // 0x5a0(0x08)
	char UnknownData_5A8_0 : 7; // 0x5a8(0x01)
	bool bShouldRotateMesh : 1; // 0x5a8(0x01)
	char UnknownData_5A9_0 : 7; // 0x5a9(0x01)
	bool bCanBeReflected : 1; // 0x5a9(0x01)
	char UnknownData_5AA[0x6]; // 0x5aa(0x06)
	struct FVector RotationsPerSecond; // 0x5b0(0x0c)
	char UnknownData_5BC[0x4]; // 0x5bc(0x04)

	void SetExplodeMaxTime(float InDuration, bool bForceEnableTimer); // Function Madness.MadProjectile.SetExplodeMaxTime // (Final|Native|Public|BlueprintCallable) // @ game+0x16c0a20
	void K2_ExplodeOnRequest(); // Function Madness.MadProjectile.K2_ExplodeOnRequest // (Final|Native|Public|BlueprintCallable) // @ game+0x16bfcb0
	bool CanBeReflected(); // Function Madness.MadProjectile.CanBeReflected // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16bf290
};

// Class Madness.HeavyProjectile
// Size: 0x5c0 (Inherited: 0x5c0)
struct AHeavyProjectile : AMadProjectile {
};

// Class Madness.LateralInterface
// Size: 0x28 (Inherited: 0x28)
struct ULateralInterface : UInterface {

	void RegisterLateralDNAContextChangedDelegate(struct FDelegate InDelegate); // Function Madness.LateralInterface.RegisterLateralDNAContextChangedDelegate // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1516be0
	struct UDNAContext* GetLateralDNAContext(); // Function Madness.LateralInterface.GetLateralDNAContext // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514c00
};

// Class Madness.MadAbilityGlobals
// Size: 0x258 (Inherited: 0x30)
struct UMadAbilityGlobals : UDataAsset {
	struct FMadAbilityGlobals_Mod Mod; // 0x30(0x10)
	struct TMap<struct FName, struct FMadModAssets> ModAssetsData; // 0x40(0x50)
	struct UDataTable* SkillDescriptionDT; // 0x90(0x08)
	struct UDataTable* MasteriesDescriptionDT; // 0x98(0x08)
	struct UDataTable* HeroTreeUpgradesDescriptionDT; // 0xa0(0x08)
	struct UDataTable* AttributeDescriptionDT; // 0xa8(0x08)
	struct UDataTable* ClassDescriptionDT; // 0xb0(0x08)
	int32_t MaxCharacterLevel; // 0xb8(0x04)
	char UnknownData_BC[0x4]; // 0xbc(0x04)
	struct TMap<struct FName, struct FMadAbilityDefinition> SkillDescriptionsData; // 0xc0(0x50)
	struct TMap<struct FName, struct FMadAbilityDefinition> MasteryDescriptionData; // 0x110(0x50)
	struct TMap<struct FName, struct FMadAttributeDefinition> AttributeDescriptionData; // 0x160(0x50)
	struct TMap<struct FName, struct FMadHeroTreeUpgradeDefinition> HeroTreeUpgradeDescriptionData; // 0x1b0(0x50)
	struct TMap<enum class EMadnessSkillPath, struct FMadPlayerClassDefinitionData> ClassDescriptionData; // 0x200(0x50)
	struct UPhysicalMaterial* ShieldPhysicalMaterial; // 0x250(0x08)

	struct TMap<struct FName, struct FMadModAssets> GetMods(); // Function Madness.MadAbilityGlobals.GetMods // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514ce0
	struct FMadModAssets GetModAssets(struct FName ModName); // Function Madness.MadAbilityGlobals.GetModAssets // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514c30
	struct TMap<struct FName, struct FMadModAssets> GetAvailableMods(struct FMadItemModRollParams Params); // Function Madness.MadAbilityGlobals.GetAvailableMods // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514a50
};

// Class Madness.MadAbilitySet
// Size: 0x40 (Inherited: 0x30)
struct UMadAbilitySet : UDataAsset {
	struct TArray<SoftClassProperty> Abilities; // 0x30(0x10)
};

// Class Madness.MadCategorizedAbilitySet
// Size: 0xc8 (Inherited: 0x30)
struct UMadCategorizedAbilitySet : UDataAsset {
	struct FAbilitySetWithRandomCount Auras; // 0x30(0x30)
	struct FAbilitySetWithRandomCount Support; // 0x60(0x30)
	struct FAbilitySetWithRandomCount Offensive; // 0x90(0x30)
	char UnknownData_C0[0x8]; // 0xc0(0x08)
};

// Class Madness.MadAbilitySystemComponent
// Size: 0x1640 (Inherited: 0x1478)
struct UMadAbilitySystemComponent : UAbilitySystemComponent {
	char UnknownData_1478[0x1c8]; // 0x1478(0x1c8)

	struct UGameplayAbility* FindActiveAbilityThatUseCastBar(); // Function Madness.MadAbilitySystemComponent.FindActiveAbilityThatUseCastBar // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1514a20
	void CancelAbilitiesWithTags(struct FGameplayTagContainer RequiredTags); // Function Madness.MadAbilitySystemComponent.CancelAbilitiesWithTags // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1514940
	void AbortAllAbilities(); // Function Madness.MadAbilitySystemComponent.AbortAllAbilities // (Final|Native|Public|BlueprintCallable) // @ game+0x1514860
};

// Class Madness.MadAbilitySystemGlobals
// Size: 0x260 (Inherited: 0x260)
struct UMadAbilitySystemGlobals : UAbilitySystemGlobals {
};

// Class Madness.MadAbilityTargetInterface
// Size: 0x28 (Inherited: 0x28)
struct UMadAbilityTargetInterface : UInterface {
};

// Class Madness.MadAbilityTask_DollyZoom
// Size: 0xc0 (Inherited: 0x80)
struct UMadAbilityTask_DollyZoom : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)
	char UnknownData_90[0x30]; // 0x90(0x30)

	struct UMadAbilityTask_DollyZoom* MadDollyZoom(struct UObject* WorldContextObject, struct AActor* Target, float ZoomDuration, float AfterZoomDuration, float FOVChange); // Function Madness.MadAbilityTask_DollyZoom.MadDollyZoom // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1514d80
};

// Class Madness.MadAbilityTask_EnvQuery
// Size: 0xa0 (Inherited: 0x80)
struct UMadAbilityTask_EnvQuery : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)
	struct UEnvQuery* EnvQuery; // 0x90(0x08)
	struct UObject* Querier; // 0x98(0x08)

	void OnSignalCallback(); // Function Madness.MadAbilityTask_EnvQuery.OnSignalCallback // (Final|Native|Protected) // @ game+0x1516ba0
	struct UMadAbilityTask_EnvQuery* MadEnvQuery(struct UGameplayAbility* OwningAbility, struct UEnvQuery* InEnvQuery, struct UObject* InQuerier); // Function Madness.MadAbilityTask_EnvQuery.MadEnvQuery // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1514f00
};

// Class Madness.MadAbilityTask_ForceSprint
// Size: 0xb8 (Inherited: 0x80)
struct UMadAbilityTask_ForceSprint : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)
	struct FMulticastInlineDelegate OnImpact; // 0x90(0x10)
	char UnknownData_A0[0x18]; // 0xa0(0x18)

	void OnMovementImpact(struct FHitResult HitResult); // Function Madness.MadAbilityTask_ForceSprint.OnMovementImpact // (Final|Native|Protected) // @ game+0x1516290
	struct UMadAbilityTask_ForceSprint* MadForceSprint(struct UObject* WorldContextObject, float DURATION, float TurnRateMultiplier); // Function Madness.MadAbilityTask_ForceSprint.MadForceSprint // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1514ff0
};

// Class Madness.MadAbilityTask_CurrentMontageChangeSection
// Size: 0xb8 (Inherited: 0x80)
struct UMadAbilityTask_CurrentMontageChangeSection : UAbilityTask {
	struct FMulticastInlineDelegate Success; // 0x80(0x10)
	struct FMulticastInlineDelegate Fail; // 0x90(0x10)
	char UnknownData_A0[0x18]; // 0xa0(0x18)

	struct UMadAbilityTask_CurrentMontageChangeSection* MadnessCurrentMontageChangeSection(struct UObject* WorldContextObject, struct UAnimMontage* Montage, struct FName NextSection, bool bJump); // Function Madness.MadAbilityTask_CurrentMontageChangeSection.MadnessCurrentMontageChangeSection // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1515f30
};

// Class Madness.MadAbilityTask_PlayMontageAndWaitNotifyName
// Size: 0x200 (Inherited: 0x80)
struct UMadAbilityTask_PlayMontageAndWaitNotifyName : UAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x80(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x90(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnNotifyEnd; // 0xc0(0x10)
	char UnknownData_D0[0x18]; // 0xd0(0x18)
	struct AMadBaseCharacter* OwnerPawn; // 0xe8(0x08)
	char UnknownData_F0[0xb0]; // 0xf0(0xb0)
	struct AMadBaseCharacter* Instigator; // 0x1a0(0x08)
	struct AActor* DamageCauser; // 0x1a8(0x08)
	char UnknownData_1B0[0x48]; // 0x1b0(0x48)
	struct AMadBaseCharacter* Victim; // 0x1f8(0x08)

	void StopMovementAfterMontage(); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.StopMovementAfterMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1516e50
	void StopMontageAndEndTask(); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.StopMontageAndEndTask // (Final|Native|Public|BlueprintCallable) // @ game+0x1516e30
	void OnNotifyEndReceived(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.OnNotifyEndReceived // (Final|Native|Protected) // @ game+0x15165c0
	void OnNotifyBeginReceived(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.OnNotifyBeginReceived // (Final|Native|Protected) // @ game+0x15164c0
	void OnMontageInterrupted(); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x1516270
	void OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.OnMontageBlendingOut // (Final|Native|Protected) // @ game+0x15161a0
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* MadPresetThenPlayeMontageAndWait(struct UObject* WorldContextObject, struct FName TaskInstanceName, struct UAnimMontage* MontageToPlay, struct FCameraFromMontage CameraFromMontage, struct FTransform PresetTransform, float Rate, bool bRandomSection, struct FName StartSection, bool bStopWhenAbilityEnds); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.MadPresetThenPlayeMontageAndWait // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1515bf0
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* MadPlayTwoCharactersMontageAndWait(struct UObject* WorldContextObject, struct FName TaskInstanceName, struct UTwoCharactersAnimationData* AnimationData, struct FCameraFromMontage CameraFromMontage, struct AMadBaseCharacter* Victim, float Rate, bool bStopWhenAbilityEnds); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.MadPlayTwoCharactersMontageAndWait // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15159b0
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* MadPlayReactionMontageAndWait(struct UObject* WorldContextObject, struct FName TaskInstanceName, struct UAnimMontage* MontageFront, struct UAnimMontage* MontageLeft, struct UAnimMontage* MontageRight, struct UAnimMontage* MontageBack, struct AController* Instigator, float Rate, bool bRandomSection, bool bStopWhenAbilityEnds, bool bInFaceRotation); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.MadPlayReactionMontageAndWait // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15156a0
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* MadPlayReactionAnimDataAndWait(struct UObject* WorldContextObject, struct FName TaskInstanceName, struct FMadReactionAnimData ReactionAnimData, struct AController* Instigator, struct AActor* DamageCauser, float Rate, bool bRandomSection, bool bStopWhenAbilityEnds, bool bInFaceRotation); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.MadPlayReactionAnimDataAndWait // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1515360
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* MadPlayMontageAndWait(struct UObject* WorldContextObject, struct FName TaskInstanceName, struct UAnimMontage* MontageToPlay, struct FCameraFromMontage CameraFromMontage, float Rate, bool bRandomSection, struct FName StartSection, bool bStopWhenAbilityEnds); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.MadPlayMontageAndWait // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x15150e0
	struct UAnimMontage* GetChosenReactionMontage(); // Function Madness.MadAbilityTask_PlayMontageAndWaitNotifyName.GetChosenReactionMontage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1514bd0
};

// Class Madness.MadDataAsset_Reaction
// Size: 0x40 (Inherited: 0x30)
struct UMadDataAsset_Reaction : UDataAsset {
	struct TArray<struct FMadAI_Reaction> Variants; // 0x30(0x10)
};

// Class Madness.MadAbilityTask_PlayReaction
// Size: 0xe8 (Inherited: 0x80)
struct UMadAbilityTask_PlayReaction : UAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x80(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x90(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xa0(0x10)
	struct UAnimMontage* ReactionMontage; // 0xb0(0x08)
	char UnknownData_B8[0x18]; // 0xb8(0x18)
	struct AMadBaseCharacter* DamageCauser; // 0xd0(0x08)
	struct UMadDataAsset_Reaction* AnimDataAsset; // 0xd8(0x08)
	char UnknownData_E0[0x8]; // 0xe0(0x08)

	void OnMontageInterrupted(); // Function Madness.MadAbilityTask_PlayReaction.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x151ea00
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAbilityTask_PlayReaction.OnMontageEnded // (Final|Native|Protected) // @ game+0x151e930
	struct UMadAbilityTask_PlayReaction* MadPlayReaction(struct UObject* WorldContextObject, struct UObject* DamageCauser, struct UMadDataAsset_Reaction* AnimDataAsset); // Function Madness.MadAbilityTask_PlayReaction.MadPlayReaction // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151dab0
};

// Class Madness.MadAbilityTask_Push
// Size: 0xd0 (Inherited: 0x80)
struct UMadAbilityTask_Push : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)
	char UnknownData_90[0x40]; // 0x90(0x40)

	struct UMadAbilityTask_Push* MadPush(struct UObject* WorldContextObject, struct FVector PushDirection, float PushDistance); // Function Madness.MadAbilityTask_Push.MadPush // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x151dba0
};

// Class Madness.MadAbilityTask_WaitControllerRotation
// Size: 0xf0 (Inherited: 0x80)
struct UMadAbilityTask_WaitControllerRotation : UAbilityTask {
	struct FMulticastInlineDelegate OnControllerRotationFinished; // 0x80(0x10)
	char UnknownData_90[0x60]; // 0x90(0x60)

	struct UMadAbilityTask_WaitControllerRotation* MadnessWaitControllerRotation(struct UObject* WorldContextObject, struct FRotator InDesiredRotation, float InDuration, bool bInOnlyYaw); // Function Madness.MadAbilityTask_WaitControllerRotation.MadnessWaitControllerRotation // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x151dfe0
};

// Class Madness.MadAbilityTask_WaitInput
// Size: 0xa8 (Inherited: 0x80)
struct UMadAbilityTask_WaitInput : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)
	char UnknownData_90[0x18]; // 0x90(0x18)

	void OnInputCallback(); // Function Madness.MadAbilityTask_WaitInput.OnInputCallback // (Final|Native|Public) // @ game+0x151e910
	struct UMadAbilityTask_WaitInput* MadWaitInput(struct UObject* WorldContextObject, bool bPress, float DURATION, bool bNotifyUI); // Function Madness.MadAbilityTask_WaitInput.MadWaitInput // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151dcc0
};

// Class Madness.MadAbilityTask_WaitMoveInput
// Size: 0x98 (Inherited: 0x80)
struct UMadAbilityTask_WaitMoveInput : UAbilityTask {
	struct FMulticastInlineDelegate OnMoveInput; // 0x80(0x10)
	char UnknownData_90[0x8]; // 0x90(0x08)

	void OnSignalCallback(); // Function Madness.MadAbilityTask_WaitMoveInput.OnSignalCallback // (Final|Native|Protected) // @ game+0x151ea40
	struct UMadAbilityTask_WaitMoveInput* MadWaitMoveInput(struct UGameplayAbility* OwningAbility, bool bIncludeFireInput, bool bIncludeAimInput, bool bOnlySpecialInput); // Function Madness.MadAbilityTask_WaitMoveInput.MadWaitMoveInput // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151de10
};

// Class Madness.MadAbilityTask_WaitNextTick
// Size: 0x90 (Inherited: 0x80)
struct UMadAbilityTask_WaitNextTick : UAbilityTask {
	struct FMulticastInlineDelegate OnFinished; // 0x80(0x10)

	struct UMadAbilityTask_WaitNextTick* MadWaitNextTick(struct UObject* WorldContextObject); // Function Madness.MadAbilityTask_WaitNextTick.MadWaitNextTick // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151df60
	void FinishTask(); // Function Madness.MadAbilityTask_WaitNextTick.FinishTask // (Final|Native|Protected) // @ game+0x151d9a0
};

// Class Madness.MadAbilityTask_WaitTappingStop
// Size: 0xa8 (Inherited: 0x80)
struct UMadAbilityTask_WaitTappingStop : UAbilityTask {
	struct FMulticastInlineDelegate OnTappingStopped; // 0x80(0x10)
	char UnknownData_90[0x18]; // 0x90(0x18)

	void OnPressCallback(); // Function Madness.MadAbilityTask_WaitTappingStop.OnPressCallback // (Final|Native|Protected) // @ game+0x151ea20
	struct UMadAbilityTask_WaitTappingStop* MadnessWaitTappingStop(struct UObject* WorldContextObject, struct FName TaskInstanceName, float MaxTapDuration, float DurationBetweenTaps); // Function Madness.MadAbilityTask_WaitTappingStop.MadnessWaitTappingStop // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x151e130
};

// Class Madness.MadAccoladesUIModel
// Size: 0x120 (Inherited: 0x50)
struct UMadAccoladesUIModel : UBaseUIModel {
	char UnknownData_50[0x30]; // 0x50(0x30)
	struct TArray<struct FMadAccoladeCategoryUIData> Categories; // 0x80(0x10)
	struct TArray<struct FMadAccoladeLevelUIData> Levels; // 0x90(0x10)
	struct FMadAccoladeSummaryUIData Summary; // 0xa0(0x08)
	char UnknownData_A8[0x78]; // 0xa8(0x78)

	void SetupAccoladesUIData(); // Function Madness.MadAccoladesUIModel.SetupAccoladesUIData // (Final|Native|Private) // @ game+0x151ebd0
	void SetSeenAccolade(struct FString InGuidString, int32_t InTierIdx); // Function Madness.MadAccoladesUIModel.SetSeenAccolade // (Final|Native|Public) // @ game+0x151eaf0
	void OnAccoladeTierCompleted(struct UMadEnochAccolade* Accolade, struct FTierCompleteData TierCompleteData); // Function Madness.MadAccoladesUIModel.OnAccoladeTierCompleted // (Final|Native|Private|HasOutParms) // @ game+0x151e580
	void OnAccoladeProgressUpdate(struct UMadEnochAccolade* Accolade, struct UMadEnochAccoladeUnlockConditionBase* Condition); // Function Madness.MadAccoladesUIModel.OnAccoladeProgressUpdate // (Final|Native|Private) // @ game+0x151e4c0
	void OnAccoladeCompleted(struct UMadEnochAccolade* Accolade); // Function Madness.MadAccoladesUIModel.OnAccoladeCompleted // (Final|Native|Private) // @ game+0x151e440
	int32_t GetCurrentLevelIndex(); // Function Madness.MadAccoladesUIModel.GetCurrentLevelIndex // (Final|Native|Public|Const) // @ game+0x151da20
	int32_t GetCurrentLevel(); // Function Madness.MadAccoladesUIModel.GetCurrentLevel // (Final|Native|Public|Const) // @ game+0x151d9f0
	int32_t GetCurrentAccountPoints(); // Function Madness.MadAccoladesUIModel.GetCurrentAccountPoints // (Final|Native|Public|Const) // @ game+0x151d9c0
	void ClaimLevelReward(int32_t InLevel); // Function Madness.MadAccoladesUIModel.ClaimLevelReward // (Final|Native|Public) // @ game+0x151d900
	void ClaimAccoladeReward(struct FString InGuidString, int32_t InTierIdx); // Function Madness.MadAccoladesUIModel.ClaimAccoladeReward // (Final|Native|Public) // @ game+0x151d820
};

// Class Madness.MadActionPromptUIModel
// Size: 0xf8 (Inherited: 0x50)
struct UMadActionPromptUIModel : UBaseUIModel {
	char UnknownData_50[0x8]; // 0x50(0x08)
	struct TArray<struct FCoherentIntKeyBinding> ActionPromptKeyboardKeys; // 0x58(0x10)
	struct TArray<struct FCoherentIntKeyBinding> ActionPromptGamepadKeys; // 0x68(0x10)
	struct TArray<struct FCoherentStringKeyBinding> ActionPromptMouseKeys; // 0x78(0x10)
	int32_t CurrentActionKeyID; // 0x88(0x04)
	float CurrentProgress; // 0x8c(0x04)
	char UnknownData_90_0 : 7; // 0x90(0x01)
	bool bIsActionPromptDisplayed : 1; // 0x90(0x01)
	char UnknownData_91[0x7]; // 0x91(0x07)
	struct FActionPromptParams CurrentActionPromptParams; // 0x98(0x40)
	char UnknownData_D8[0x18]; // 0xd8(0x18)
	struct FWeakObjectPtr<struct UActionPromptWidgetComponent> CachedActionPromptComponent; // 0xf0(0x08)
};

// Class Madness.MadActorWithPreview
// Size: 0x3a8 (Inherited: 0x2f0)
struct AMadActorWithPreview : AActor {
	char UnknownData_2F0_0 : 7; // 0x2f0(0x01)
	bool bIsPreview : 1; // 0x2f0(0x01)
	char UnknownData_2F1[0x3]; // 0x2f1(0x03)
	float CollisionRadius; // 0x2f4(0x04)
	float CollisionHalfHeight; // 0x2f8(0x04)
	struct FVector TripWireConnectOffset; // 0x2fc(0x0c)
	struct FGameplayAttribute LimitAttribute; // 0x308(0x38)
	struct FGameplayAttribute MaxLimitAttribute; // 0x340(0x38)
	struct TArray<struct FWeakObjectPtr<struct AMadTripWire>> ConnectedTripWires; // 0x378(0x10)
	struct TArray<struct UMeshComponent*> CachedMeshComponents; // 0x388(0x10)
	struct FName ColorChangeParam; // 0x398(0x08)
	char UnknownData_3A0_0 : 7; // 0x3a0(0x01)
	bool bIsPlacementAllowed : 1; // 0x3a0(0x01)
	char UnknownData_3A1[0x7]; // 0x3a1(0x07)
};

// Class Madness.MadBaseAI
// Size: 0xbd8 (Inherited: 0xb98)
struct AMadBaseAI : AFWAIController {
	char UnknownData_B98[0x10]; // 0xb98(0x10)
	struct UEnvQuery* AdvanceCover; // 0xba8(0x08)
	struct UEnvQuery* FallbackCover; // 0xbb0(0x08)
	struct UEnvQuery* AwayCover; // 0xbb8(0x08)
	char UnknownData_BC0_0 : 7; // 0xbc0(0x01)
	bool bLeaveCoverOnDamage : 1; // 0xbc0(0x01)
	char UnknownData_BC1[0xf]; // 0xbc1(0x0f)
	float WakeUpNeighborRadius; // 0xbd0(0x04)
	char UnknownData_BD4[0x4]; // 0xbd4(0x04)

	void SetDefaultFocus(struct FVector Point); // Function Madness.MadBaseAI.SetDefaultFocus // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x151ea60
	void OnAttackEarlyExitEvent(); // Function Madness.MadBaseAI.OnAttackEarlyExitEvent // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	int32_t GetNumberOfActivePlayers(); // Function Madness.MadBaseAI.GetNumberOfActivePlayers // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x151da80
	bool GetForceTurnInPlace(); // Function Madness.MadBaseAI.GetForceTurnInPlace // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x151da50
	void ForceTurnInPlace(); // Function Madness.MadBaseAI.ForceTurnInPlace // (Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0xcd80f0
	void ClearDefaultFocus(); // Function Madness.MadBaseAI.ClearDefaultFocus // (Final|Native|Public|BlueprintCallable) // @ game+0x151d980
};

// Class Madness.MadAI
// Size: 0xbd8 (Inherited: 0xbd8)
struct AMadAI : AMadBaseAI {
};

// Class Madness.MadCrowdAI
// Size: 0xbd8 (Inherited: 0xbd8)
struct AMadCrowdAI : AMadBaseAI {
};

// Class Madness.FWMontageProvider_SmartObject
// Size: 0x30 (Inherited: 0x28)
struct UFWMontageProvider_SmartObject : UFWMontageProvider {
	struct FName DataTag; // 0x28(0x08)
};

// Class Madness.FWMontageProvider_SOStart
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOStart : UFWMontageProvider_SmartObject {
};

// Class Madness.FWMontageProvider_SOLoop
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOLoop : UFWMontageProvider_SmartObject {
};

// Class Madness.FWMontageProvider_SOSyncLoop
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOSyncLoop : UFWMontageProvider_SmartObject {
};

// Class Madness.FWMontageProvider_SOPostSync
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOPostSync : UFWMontageProvider_SmartObject {
};

// Class Madness.FWMontageProvider_SOEnd
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOEnd : UFWMontageProvider_SmartObject {
};

// Class Madness.FWMontageProvider_SOForceOut
// Size: 0x30 (Inherited: 0x30)
struct UFWMontageProvider_SOForceOut : UFWMontageProvider_SmartObject {
};

// Class Madness.MadAI_AbilitySafeZone
// Size: 0x330 (Inherited: 0x328)
struct AMadAI_AbilitySafeZone : AVolume {
	struct FGameplayTag TagToAdd; // 0x328(0x08)
};

// Class Madness.MadAI_AlteredDemonMortarProjectile
// Size: 0x5d8 (Inherited: 0x5c0)
struct AMadAI_AlteredDemonMortarProjectile : AMadProjectile {
	struct UParticleSystem* MortarProjectileMarker; // 0x5c0(0x08)
	float DefaultArcValue; // 0x5c8(0x04)
	float InCoverArcValue; // 0x5cc(0x04)
	struct UParticleSystemComponent* TargetMarkerParticleComponent; // 0x5d0(0x08)

	void MulticastSpawnTargetMarkerAtLocation(struct UWorld* World, struct UParticleSystem* EmitterTemplate, struct FTransform SpawnTransform, bool bAutoDestroy, enum class EPSCPoolMethod PoolingMethod); // Function Madness.MadAI_AlteredDemonMortarProjectile.MulticastSpawnTargetMarkerAtLocation // (Final|Net|NetReliableNative|Event|NetMulticast|Private|HasDefaults) // @ game+0x151e260
};

// Class Madness.MadAI_Infantry
// Size: 0xbe0 (Inherited: 0xbd8)
struct AMadAI_Infantry : AMadAI {
	char UnknownData_BD8[0x8]; // 0xbd8(0x08)

	void OnPlayerChangedTargettingMode(bool bIsTargetting); // Function Madness.MadAI_Infantry.OnPlayerChangedTargettingMode // (Final|Native|Public) // @ game+0x1522bd0
};

// Class Madness.MadAI_Bailey
// Size: 0xbe8 (Inherited: 0xbe0)
struct AMadAI_Bailey : AMadAI_Infantry {
	char UnknownData_BE0[0x8]; // 0xbe0(0x08)
};

// Class Madness.MadAI_Bailey_StoneWaveProjectile
// Size: 0x600 (Inherited: 0x5c0)
struct AMadAI_Bailey_StoneWaveProjectile : AMadProjectile {
	float ZOffset; // 0x5c0(0x04)
	char UnknownData_5C4[0x4]; // 0x5c4(0x04)
	struct UBoxComponent* BoxCollisionComponent; // 0x5c8(0x08)
	char UnknownData_5D0[0x30]; // 0x5d0(0x30)

	void OnBeginOverlapCallback(struct UPrimitiveComponent* OverlappedComp, struct AActor* OtherActor, struct UPrimitiveComponent* OtherComp, int32_t OtherBodyIndex, bool bFromSweep, struct FHitResult SweepResult); // Function Madness.MadAI_Bailey_StoneWaveProjectile.OnBeginOverlapCallback // (Final|Native|Protected|HasOutParms) // @ game+0x151e6a0
};

// Class Madness.MadAI_BasicBerserker
// Size: 0xbe8 (Inherited: 0xbe0)
struct AMadAI_BasicBerserker : AMadAI_Infantry {
	float TargetingRequiredTime; // 0xbe0(0x04)
	char UnknownData_BE4[0x4]; // 0xbe4(0x04)
};

// Class Madness.MadAI_Berserker
// Size: 0xbe8 (Inherited: 0xbe0)
struct AMadAI_Berserker : AMadAI_Infantry {
	char UnknownData_BE0[0x8]; // 0xbe0(0x08)
};

// Class Madness.MadAI_BerserkerProjectile
// Size: 0x5c0 (Inherited: 0x5c0)
struct AMadAI_BerserkerProjectile : AMadProjectile {

	void GetClosestHostileActorInRange(float Radius, struct FVector Origin, struct TArray<struct AActor*> ActorsToExclude, struct AActor* OutHostileActor); // Function Madness.MadAI_BerserkerProjectile.GetClosestHostileActorInRange // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1521df0
};

// Class Madness.MadAI_Crawler
// Size: 0xc20 (Inherited: 0xbd8)
struct AMadAI_Crawler : AMadAI {
	struct FMulticastInlineDelegate OnSightCheckWithEnemyResultSignature; // 0xbd8(0x10)
	float BlockDetectionDistanceThreshold; // 0xbe8(0x04)
	float BlockDetectionInterval; // 0xbec(0x04)
	int32_t BlockDetectionNumSamples; // 0xbf0(0x04)
	char UnknownData_BF4_0 : 7; // 0xbf4(0x01)
	bool bIsInEndMovementAnimState : 1; // 0xbf4(0x01)
	char UnknownData_BF5[0x3]; // 0xbf5(0x03)
	float LastWeaponHitTime; // 0xbf8(0x04)
	struct FVector LastWeaponHitOriginLocation; // 0xbfc(0x0c)
	char UnknownData_C08_0 : 7; // 0xc08(0x01)
	bool bLastMoveWasStrafe : 1; // 0xc08(0x01)
	char UnknownData_C09[0x7]; // 0xc09(0x07)
	struct TArray<struct FCrawlerFailInfo> RecentFails; // 0xc10(0x10)

	void OnWeaponHit(struct AActor* InstigatorActor, struct FHitResult HitInfo, struct UDamageType* DamageType, float Damage); // Function Madness.MadAI_Crawler.OnWeaponHit // (Final|Native|Protected|HasOutParms) // @ game+0x1522d00
	bool HasActorFailedInTime(struct AActor* Actor, float Time); // Function Madness.MadAI_Crawler.HasActorFailedInTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522190
	float GetLastWeaponHitTime(); // Function Madness.MadAI_Crawler.GetLastWeaponHitTime // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522110
	struct FVector GetLastWeaponHitOriginLocation(); // Function Madness.MadAI_Crawler.GetLastWeaponHitOriginLocation // (Final|Native|Protected|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x15220b0
	bool GetLastMoveWasStrafe(); // Function Madness.MadAI_Crawler.GetLastMoveWasStrafe // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522070
	void AddFail(struct AActor* Actor, float Time); // Function Madness.MadAI_Crawler.AddFail // (Final|Native|Public|BlueprintCallable) // @ game+0x1521be0
};

// Class Madness.MadAI_CrowdBerserker
// Size: 0xbe0 (Inherited: 0xbd8)
struct AMadAI_CrowdBerserker : AMadCrowdAI {
	char UnknownData_BD8[0x8]; // 0xbd8(0x08)
};

// Class Madness.MadAI_CrowdPerforo
// Size: 0xbf0 (Inherited: 0xbd8)
struct AMadAI_CrowdPerforo : AMadCrowdAI {
	char UnknownData_BD8[0x18]; // 0xbd8(0x18)

	void OnKilled(struct ABaseCharacter* ControllerOwner, struct FTakeHitInfo TakeHitInfo); // Function Madness.MadAI_CrowdPerforo.OnKilled // (Native|Protected) // @ game+0x1522880
	void OnChargeAttackAvailableEvent(bool IsActive); // Function Madness.MadAI_CrowdPerforo.OnChargeAttackAvailableEvent // (BlueprintAuthorityOnly|Native|Event|Protected|BlueprintEvent) // @ game+0x1522790
	void OnChargeAttackActiveEvent(bool IsActive); // Function Madness.MadAI_CrowdPerforo.OnChargeAttackActiveEvent // (BlueprintAuthorityOnly|Native|Event|Protected|BlueprintEvent) // @ game+0x1522700
};

// Class Madness.MadAI_DesertBerserker
// Size: 0xbe8 (Inherited: 0xbe8)
struct AMadAI_DesertBerserker : AMadAI_BasicBerserker {
};

// Class Madness.MadAI_DesertSciathan
// Size: 0xc48 (Inherited: 0xbd8)
struct AMadAI_DesertSciathan : AMadAI {
	char UnknownData_BD8_0 : 7; // 0xbd8(0x01)
	bool bIsGliding : 1; // 0xbd8(0x01)
	char UnknownData_BD9_0 : 7; // 0xbd9(0x01)
	bool bEverHadTarget : 1; // 0xbd9(0x01)
	char UnknownData_BDA[0x2]; // 0xbda(0x02)
	float TrackDamageWindowLength; // 0xbdc(0x04)
	float TrackDistanceWindowLength; // 0xbe0(0x04)
	char UnknownData_BE4[0x64]; // 0xbe4(0x64)

	bool WasEnemyInRangeForTheDuration(float DURATION, float MaxDistance, float MinDistance); // Function Madness.MadAI_DesertSciathan.WasEnemyInRangeForTheDuration // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15234e0
	void SetIsOnGround(bool bOnGround); // Function Madness.MadAI_DesertSciathan.SetIsOnGround // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1523290
	bool GetIsOnGround(); // Function Madness.MadAI_DesertSciathan.GetIsOnGround // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522050
	float GetDamageDoneLately(float DURATION); // Function Madness.MadAI_DesertSciathan.GetDamageDoneLately // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1521fa0
	struct F360AttackBandInfo Get360AttackInfo(); // Function Madness.MadAI_DesertSciathan.Get360AttackInfo // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1521dc0
	bool CanHitTargetWithGroundSlam(struct UMadAIGameplayAbility* OwningAbility, float MaxDistance, float MinHeight); // Function Madness.MadAI_DesertSciathan.CanHitTargetWithGroundSlam // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1521cb0
};

// Class Madness.MadAI_Shotgunner_Base
// Size: 0xbe8 (Inherited: 0xbe0)
struct AMadAI_Shotgunner_Base : AMadAI_Infantry {
	char UnknownData_BE0_0 : 7; // 0xbe0(0x01)
	bool bSpecialTreatmentForCoversInLOS : 1; // 0xbe0(0x01)
	char UnknownData_BE1[0x7]; // 0xbe1(0x07)
};

// Class Madness.MadAI_DrDetonator
// Size: 0xbe8 (Inherited: 0xbe8)
struct AMadAI_DrDetonator : AMadAI_Shotgunner_Base {
};

// Class Madness.MadAI_ForestSciathan
// Size: 0xbe8 (Inherited: 0xbd8)
struct AMadAI_ForestSciathan : AMadAI {
	float MinAttackDistance; // 0xbd8(0x04)
	float MaxAttackDistance; // 0xbdc(0x04)
	char UnknownData_BE0[0x8]; // 0xbe0(0x08)
};

// Class Madness.MadAI_Guardian
// Size: 0xc08 (Inherited: 0xbd8)
struct AMadAI_Guardian : AMadAI {
	struct FGuardianChangeStanceDefensive ChangeStanceDefensiveProperties; // 0xbd8(0x10)
	struct FGuardianChangeStanceAvoidance ChangeStanceAvoidanceProperties; // 0xbe8(0x0c)
	float NextAggressiveTargetSelectionTime; // 0xbf4(0x04)
	float AggressiveTargetSelectionInterval; // 0xbf8(0x04)
	char UnknownData_BFC_0 : 7; // 0xbfc(0x01)
	bool bIsChanneling : 1; // 0xbfc(0x01)
	char UnknownData_BFD[0x3]; // 0xbfd(0x03)
	struct UMadDamageTrackerComponent* Tracker; // 0xc00(0x08)

	void SetIsChanneling(bool bNewIsChanneling); // Function Madness.MadAI_Guardian.SetIsChanneling // (Final|Native|Public|BlueprintCallable) // @ game+0x1523200
};

// Class Madness.MadAI_HeavyBase
// Size: 0xbf0 (Inherited: 0xbe0)
struct AMadAI_HeavyBase : AMadAI_Infantry {
	char UnknownData_BE0[0x10]; // 0xbe0(0x10)
};

// Class Madness.MadAI_Insect
// Size: 0xbf0 (Inherited: 0xbd8)
struct AMadAI_Insect : AMadAI {
	char UnknownData_BD8_0 : 7; // 0xbd8(0x01)
	bool bHideIfNoEnemiesFound : 1; // 0xbd8(0x01)
	char UnknownData_BD9_0 : 7; // 0xbd9(0x01)
	bool bAutoAttack : 1; // 0xbd9(0x01)
	char UnknownData_BDA[0x6]; // 0xbda(0x06)
	struct AMadInsectCharacter* SwarmPawn; // 0xbe0(0x08)
	struct ABaseCharacter* AttackTarget; // 0xbe8(0x08)
};

// Class Madness.MadAI_Lurker
// Size: 0xbf0 (Inherited: 0xbd8)
struct AMadAI_Lurker : AMadAI {
	char UnknownData_BD8[0x8]; // 0xbd8(0x08)
	struct UMadGameplayEffect* LurkerIsAngry; // 0xbe0(0x08)
	char UnknownData_BE8[0x8]; // 0xbe8(0x08)
};

// Class Madness.MadAI_LurkerAlpha
// Size: 0xcc0 (Inherited: 0xbf0)
struct AMadAI_LurkerAlpha : AMadAI_Lurker {
	struct UMadGameplayEffect* StunEffectOnHeavyDamage; // 0xbf0(0x08)
	struct FScalableFloat MeleeDamageScalableFloat; // 0xbf8(0x20)
	struct FGameplayAttribute LevelAttribute; // 0xc18(0x38)
	struct FGameplayTagContainer EffectsToRemoveOnMeleeAttack; // 0xc50(0x20)
	float TimeToResetStompAttack; // 0xc70(0x04)
	enum class ETraceTypeQuery MeleeAttackTraceChannel; // 0xc74(0x01)
	char UnknownData_C75[0x3]; // 0xc75(0x03)
	float TimeToResetTargetInSeconds; // 0xc78(0x04)
	float DefaultMeleeAttackRadius; // 0xc7c(0x04)
	float JawMeleeAttackRadius; // 0xc80(0x04)
	char UnknownData_C84[0x4]; // 0xc84(0x04)
	struct AMadCharAI_Lurker* ControlledLurker; // 0xc88(0x08)
	struct AActor* LastTarget; // 0xc90(0x08)
	char UnknownData_C98[0x28]; // 0xc98(0x28)

	void StopTimerForStompAttack(); // Function Madness.MadAI_LurkerAlpha.StopTimerForStompAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x15234c0
	void StartTimerForStompAttack(); // Function Madness.MadAI_LurkerAlpha.StartTimerForStompAttack // (Final|Native|Public|BlueprintCallable) // @ game+0x15234a0
	void SetStompAttackStage(int32_t Value); // Function Madness.MadAI_LurkerAlpha.SetStompAttackStage // (Final|Native|Public|BlueprintCallable) // @ game+0x1523420
	void SetLastTarget(struct AActor* Target); // Function Madness.MadAI_LurkerAlpha.SetLastTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1523320
	void OnEndResetTargetTimer(); // Function Madness.MadAI_LurkerAlpha.OnEndResetTargetTimer // (Final|Native|Private) // @ game+0x1522840
	void OnEndCooldownTimerForStopmAttack(); // Function Madness.MadAI_LurkerAlpha.OnEndCooldownTimerForStopmAttack // (Final|Native|Private) // @ game+0x1522820
	int32_t GetStompAttackStage(); // Function Madness.MadAI_LurkerAlpha.GetStompAttackStage // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522170
	struct AActor* GetLastTarget(); // Function Madness.MadAI_LurkerAlpha.GetLastTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522090
};

// Class Madness.MadAI_NPCAlly
// Size: 0xc60 (Inherited: 0xbd8)
struct AMadAI_NPCAlly : AMadAI {
	struct Acharacter* CurrentTargetCharacter; // 0xbd8(0x08)
	struct AMadBaseAICharacter* CurrentPossessedCharacter; // 0xbe0(0x08)
	struct TArray<struct Acharacter*> TargetsToIgnore; // 0xbe8(0x10)
	char UnknownData_BF8[0x38]; // 0xbf8(0x38)
	char UnknownData_C30_0 : 7; // 0xc30(0x01)
	bool bEnableLookAtAnimation : 1; // 0xc30(0x01)
	char UnknownData_C31[0x3]; // 0xc31(0x03)
	float ReactionCheckChance; // 0xc34(0x04)
	float NotifyLookAtChance; // 0xc38(0x04)
	char UnknownData_C3C_0 : 7; // 0xc3c(0x01)
	bool bInterpolateLookAtAnimation : 1; // 0xc3c(0x01)
	char UnknownData_C3D[0x3]; // 0xc3d(0x03)
	float LookAtInterpolationSpeed; // 0xc40(0x04)
	int32_t LookAtAnimationUpdateRate; // 0xc44(0x04)
	float LookAtAnimationDuration; // 0xc48(0x04)
	float LookAtCooldownDuration; // 0xc4c(0x04)
	float ReactionCheckUpdateRate; // 0xc50(0x04)
	float ReactionCheckDistance; // 0xc54(0x04)
	char UnknownData_C58[0x8]; // 0xc58(0x08)

	void OnTargetCharacterBeingDestroyed(struct AActor* Actor); // Function Madness.MadAI_NPCAlly.OnTargetCharacterBeingDestroyed // (Final|Native|Protected) // @ game+0x1522c80
};

// Class Madness.MadAI_PathMarkerController
// Size: 0x410 (Inherited: 0x408)
struct AMadAI_PathMarkerController : AAIController {
	float OffsetFromCorners; // 0x408(0x04)
	char UnknownData_40C[0x4]; // 0x40c(0x04)
};

// Class Madness.MadAI_Perforo
// Size: 0xbe0 (Inherited: 0xbd8)
struct AMadAI_Perforo : AMadAI {
	float TimeSinceLastHitToCutPath; // 0xbd8(0x04)
	char UnknownData_BDC[0x4]; // 0xbdc(0x04)
};

// Class Madness.MadAI_Perforo_Alpha
// Size: 0xc08 (Inherited: 0xbd8)
struct AMadAI_Perforo_Alpha : AMadAI {
	char UnknownData_BD8_0 : 7; // 0xbd8(0x01)
	bool bHasGland : 1; // 0xbd8(0x01)
	char UnknownData_BD9[0x3]; // 0xbd9(0x03)
	float TrackDamageWindowLength; // 0xbdc(0x04)
	struct TArray<struct FMadPADamageWindow> DamageWindows; // 0xbe0(0x10)
	struct ABaseCharacter* SelectedDangerousTargetForAnomalySlash; // 0xbf0(0x08)
	char UnknownData_BF8[0x10]; // 0xbf8(0x10)

	bool PerforoAlphaHasGland(struct AController* Controller); // Function Madness.MadAI_Perforo_Alpha.PerforoAlphaHasGland // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1523100
	int32_t NumberOfMinionsAttackingTarget(struct UFWAIArchetype* MinionArchetype, struct AActor* Target); // Function Madness.MadAI_Perforo_Alpha.NumberOfMinionsAttackingTarget // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522320
	int32_t NumberOfMinions(struct UFWAIArchetype* MinionArchetype); // Function Madness.MadAI_Perforo_Alpha.NumberOfMinions // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522280
};

// Class Madness.MadAI_Sciathan
// Size: 0xbf8 (Inherited: 0xbd8)
struct AMadAI_Sciathan : AMadAI {
	char UnknownData_BD8_0 : 7; // 0xbd8(0x01)
	bool bHasPerformedFlyBy : 1; // 0xbd8(0x01)
	char UnknownData_BD9[0x7]; // 0xbd9(0x07)
	struct ALevelSequenceActor* ReservedLevelSequenceActor; // 0xbe0(0x08)
	float LastWeaponHitTime; // 0xbe8(0x04)
	struct FVector LastWeaponHitOriginLocation; // 0xbec(0x0c)

	void SetReservedLevelSequenceActor(struct ALevelSequenceActor* LevelSequenceActor); // Function Madness.MadAI_Sciathan.SetReservedLevelSequenceActor // (Final|Native|Public|BlueprintCallable) // @ game+0x15233a0
	void OnWeaponHit(struct AActor* InstigatorActor, struct FHitResult HitInfo, struct UDamageType* DamageType, float Damage); // Function Madness.MadAI_Sciathan.OnWeaponHit // (Final|Native|Protected|HasOutParms) // @ game+0x1522f00
	struct ALevelSequenceActor* GetReservedLevelSequenceActor(); // Function Madness.MadAI_Sciathan.GetReservedLevelSequenceActor // (Final|Native|Public|BlueprintCallable) // @ game+0x1522150
	float GetLastWeaponHitTime(); // Function Madness.MadAI_Sciathan.GetLastWeaponHitTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522130
	struct FVector GetLastWeaponHitOriginLocation(); // Function Madness.MadAI_Sciathan.GetLastWeaponHitOriginLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x15220e0
	bool GetHasPerformedFlyBy(); // Function Madness.MadAI_Sciathan.GetHasPerformedFlyBy // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1522030
	void CleanUpReservedState(); // Function Madness.MadAI_Sciathan.CleanUpReservedState // (Final|Native|Public|BlueprintCallable) // @ game+0x1521da0
};

// Class Madness.MadAI_Shotgunner_Desert
// Size: 0xc50 (Inherited: 0xbe8)
struct AMadAI_Shotgunner_Desert : AMadAI_Shotgunner_Base {
	char UnknownData_BE8[0x8]; // 0xbe8(0x08)
	struct FScalableFloat ShieldUsageTimeoutScale; // 0xbf0(0x20)
	char UnknownData_C10[0x40]; // 0xc10(0x40)

	void OnShowShield(); // Function Madness.MadAI_Shotgunner_Desert.OnShowShield // (Final|Native|Protected) // @ game+0x1522c60
	void OnHideShield(); // Function Madness.MadAI_Shotgunner_Desert.OnHideShield // (Final|Native|Protected) // @ game+0x1522860
	void OnBreakShield(); // Function Madness.MadAI_Shotgunner_Desert.OnBreakShield // (Final|Native|Protected) // @ game+0x15226e0
	void OnAnimNotifyEvent(struct UFWAnimNotify* AnimNotify, struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAI_Shotgunner_Desert.OnAnimNotifyEvent // (Final|Native|Protected) // @ game+0x1522400
};

// Class Madness.MadNavmeshProjectile
// Size: 0x5f0 (Inherited: 0x5c0)
struct AMadNavmeshProjectile : AMadProjectile {
	float ZOffset; // 0x5c0(0x04)
	char UnknownData_5C4[0x2c]; // 0x5c4(0x2c)

	struct AMadNavmeshProjectile* SpawnNavmeshProjectile(struct UObject* WorldContextObject, struct AMadNavmeshProjectile* ProjectileClass, struct FVector Origin, struct FVector Direction, struct APawn* InstigatorPawn, struct AActor* OwnerActor, float InitialSpeedOverride, float MaxTestDistance); // Function Madness.MadNavmeshProjectile.SpawnNavmeshProjectile // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1683f20
};

// Class Madness.MadAI_SmallLurkerProjectile
// Size: 0x610 (Inherited: 0x5f0)
struct AMadAI_SmallLurkerProjectile : AMadNavmeshProjectile {
	float MinDistanceToTarget; // 0x5f0(0x04)
	char UnknownData_5F4[0x4]; // 0x5f4(0x04)
	struct AActor* TargetActor; // 0x5f8(0x08)
	char UnknownData_600[0x10]; // 0x600(0x10)

	void SetHomingTarget(struct AActor* CustomTarget); // Function Madness.MadAI_SmallLurkerProjectile.SetHomingTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1523180
	void OnAnyDamageCallback(struct AActor* DamagedActor, float Damage, struct UDamageType* DamageType, struct AController* InstigatedBy, struct AActor* DamageCauser); // Function Madness.MadAI_SmallLurkerProjectile.OnAnyDamageCallback // (Final|Native|Private) // @ game+0x1522550
	void MulticastTurnOffHoming(); // Function Madness.MadAI_SmallLurkerProjectile.MulticastTurnOffHoming // (Final|Net|NetReliableNative|Event|NetMulticast|Private) // @ game+0x1522260
};

// Class Madness.MadAI_Sniper
// Size: 0xbf8 (Inherited: 0xbe0)
struct AMadAI_Sniper : AMadAI_Infantry {
	char UnknownData_BE0[0x18]; // 0xbe0(0x18)
};

// Class Madness.MadAI_SplineBerserker
// Size: 0xbe8 (Inherited: 0xbe0)
struct AMadAI_SplineBerserker : AMadAI_Infantry {
	char UnknownData_BE0[0x8]; // 0xbe0(0x08)
};

// Class Madness.MadAI_SplinePerforo
// Size: 0xbd8 (Inherited: 0xbd8)
struct AMadAI_SplinePerforo : AMadAI {
};

// Class Madness.MadAI_Telegraphist
// Size: 0xbf8 (Inherited: 0xbf8)
struct AMadAI_Telegraphist : AMadAI_Sniper {
};

// Class Madness.MadAI_Telegraphist_Desert
// Size: 0xbf8 (Inherited: 0xbf8)
struct AMadAI_Telegraphist_Desert : AMadAI_Telegraphist {
};

// Class Madness.MadAI_Tick
// Size: 0xbf0 (Inherited: 0xbd8)
struct AMadAI_Tick : AMadAI {
	char UnknownData_BD8_0 : 7; // 0xbd8(0x01)
	bool bHideIfNoEnemiesFound : 1; // 0xbd8(0x01)
	char UnknownData_BD9_0 : 7; // 0xbd9(0x01)
	bool bAutoAttack : 1; // 0xbd9(0x01)
	char UnknownData_BDA[0x6]; // 0xbda(0x06)
	struct AMadTickCharacter* TickPawn; // 0xbe0(0x08)
	struct ABaseCharacter* AttackTarget; // 0xbe8(0x08)
};

// Class Madness.MadAI_VolcanoBoss
// Size: 0xba0 (Inherited: 0xb98)
struct AMadAI_VolcanoBoss : AFWAIController {
	char UnknownData_B98[0x8]; // 0xb98(0x08)
};

// Class Madness.MadAI_VolcanoSpider
// Size: 0xc18 (Inherited: 0xbd8)
struct AMadAI_VolcanoSpider : AMadAI {
	float MinSprintTime; // 0xbd8(0x04)
	float MaxSprintTime; // 0xbdc(0x04)
	float WalkTimeFraction; // 0xbe0(0x04)
	float DistanceToTarget; // 0xbe4(0x04)
	float AngleToTarget; // 0xbe8(0x04)
	char UnknownData_BEC[0x4]; // 0xbec(0x04)
	struct FGameplayTagContainer AbilityTags; // 0xbf0(0x20)
	char UnknownData_C10[0x8]; // 0xc10(0x08)

	void SetTryToExplode(bool bTry); // Function Madness.MadAI_VolcanoSpider.SetTryToExplode // (Final|Native|Public|BlueprintCallable) // @ game+0x1527400
	void Explode(); // Function Madness.MadAI_VolcanoSpider.Explode // (Final|Native|Public|BlueprintCallable) // @ game+0x1526730
};

// Class Madness.MadAI_WarzoneSciathan
// Size: 0xc48 (Inherited: 0xc48)
struct AMadAI_WarzoneSciathan : AMadAI_DesertSciathan {
};

// Class Madness.MadAI_Yagak
// Size: 0xc20 (Inherited: 0xbd8)
struct AMadAI_Yagak : AMadAI {
	char UnknownData_BD8[0x10]; // 0xbd8(0x10)
	struct UMadDamageTrackerComponent* Tracker; // 0xbe8(0x08)
	float MinTargetSnapTime; // 0xbf0(0x04)
	float MaxTargetSnapTime; // 0xbf4(0x04)
	float PlayerRange; // 0xbf8(0x04)
	int32_t DashHitCount; // 0xbfc(0x04)
	struct FGameplayTagContainer BlinkAbilityTag; // 0xc00(0x20)
};

// Class Madness.MadGameplayAbility
// Size: 0x4b8 (Inherited: 0x410)
struct UMadGameplayAbility : UGameplayAbility {
	char UnknownData_410_0 : 7; // 0x410(0x01)
	bool bIsNotSkillAbility : 1; // 0x410(0x01)
	char UnknownData_411_0 : 7; // 0x411(0x01)
	bool bEndAbilityAfterPawnsDeath : 1; // 0x411(0x01)
	char UnknownData_412_0 : 7; // 0x412(0x01)
	bool bCanActivateAfterPawnsDeath : 1; // 0x412(0x01)
	char UnknownData_413_0 : 7; // 0x413(0x01)
	bool bAutoApplyCost : 1; // 0x413(0x01)
	char UnknownData_414_0 : 7; // 0x414(0x01)
	bool bAutoApplyDuration : 1; // 0x414(0x01)
	char UnknownData_415_0 : 7; // 0x415(0x01)
	bool bDisableDurationEffectOnEndAbility : 1; // 0x415(0x01)
	char UnknownData_416_0 : 7; // 0x416(0x01)
	bool bAutoApplyCooldown : 1; // 0x416(0x01)
	char UnknownData_417_0 : 7; // 0x417(0x01)
	bool bAutoApplyKeywords : 1; // 0x417(0x01)
	char UnknownData_418_0 : 7; // 0x418(0x01)
	bool bAttemptToPutPlayerBackInCover : 1; // 0x418(0x01)
	char UnknownData_419_0 : 7; // 0x419(0x01)
	bool bSuppressLocomotionAnimationChangeIfTemporarilyRemovedFromCover : 1; // 0x419(0x01)
	char UnknownData_41A_0 : 7; // 0x41a(0x01)
	bool bBlockMovement : 1; // 0x41a(0x01)
	char UnknownData_41B_0 : 7; // 0x41b(0x01)
	bool bDisableGroundIK : 1; // 0x41b(0x01)
	char UnknownData_41C_0 : 7; // 0x41c(0x01)
	bool bAnimationDataAppliedAutomatically : 1; // 0x41c(0x01)
	char UnknownData_41D[0x3]; // 0x41d(0x03)
	struct AMadActorWithPreview* SpawnedConstructClass; // 0x420(0x08)
	char UnknownData_428_0 : 7; // 0x428(0x01)
	bool bBlockInteractions : 1; // 0x428(0x01)
	char UnknownData_429_0 : 7; // 0x429(0x01)
	bool bIsThrowingAbility : 1; // 0x429(0x01)
	char UnknownData_42A_0 : 7; // 0x42a(0x01)
	bool bCanBeActivatedDuringTransition : 1; // 0x42a(0x01)
	char UnknownData_42B_0 : 7; // 0x42b(0x01)
	bool bUsingCastBar : 1; // 0x42b(0x01)
	char UnknownData_42C_0 : 7; // 0x42c(0x01)
	bool bImmuneToInterruptAll : 1; // 0x42c(0x01)
	char UnknownData_42D_0 : 7; // 0x42d(0x01)
	bool bNoImmuneMessage : 1; // 0x42d(0x01)
	char UnknownData_42E[0x2]; // 0x42e(0x02)
	struct TArray<struct UMadPlayerAnimData*> AnimationData; // 0x430(0x10)
	char UnknownData_440_0 : 7; // 0x440(0x01)
	bool bPassAllNotifies : 1; // 0x440(0x01)
	char UnknownData_441[0x3]; // 0x441(0x03)
	float AbilityTimeout; // 0x444(0x04)
	char UnknownData_448_0 : 7; // 0x448(0x01)
	bool bAutoActivateWhenGranted : 1; // 0x448(0x01)
	char UnknownData_449_0 : 7; // 0x449(0x01)
	bool bDelayedAutoActivation : 1; // 0x449(0x01)
	char UnknownData_44A_0 : 7; // 0x44a(0x01)
	bool bCanActivateInNonCombatArea : 1; // 0x44a(0x01)
	char UnknownData_44B_0 : 7; // 0x44b(0x01)
	bool bLockPlayerVisibility : 1; // 0x44b(0x01)
	char UnknownData_44C_0 : 7; // 0x44c(0x01)
	bool bAlteredAbility : 1; // 0x44c(0x01)
	char UnknownData_44D_0 : 7; // 0x44d(0x01)
	bool bPlayActivateChatter : 1; // 0x44d(0x01)
	char UnknownData_44E[0x2]; // 0x44e(0x02)
	struct FNameWrapper SpeechLineToPlay; // 0x450(0x10)
	char UnknownData_460[0x10]; // 0x460(0x10)
	struct UGameplayEffect* DurationGameplayEffectClass; // 0x470(0x08)
	char UnknownData_478[0x4]; // 0x478(0x04)
	int32_t AbilityRandomSeed; // 0x47c(0x04)
	struct FRandomStream AbilityRandomStream; // 0x480(0x08)
	char UnknownData_488[0x10]; // 0x488(0x10)
	struct UCameraState_Global* CameraStateClass; // 0x498(0x08)
	char UnknownData_4A0_0 : 7; // 0x4a0(0x01)
	bool bAutoActivateCameraState : 1; // 0x4a0(0x01)
	char UnknownData_4A1[0x1]; // 0x4a1(0x01)
	char UnknownData_4A2_0 : 7; // 0x4a2(0x01)
	bool bDebugScriptExecution : 1; // 0x4a2(0x01)
	char UnknownData_4A3[0x5]; // 0x4a3(0x05)
	struct TArray<struct FString> DebugScriptExecution; // 0x4a8(0x10)

	void TargetArraySendGameplayEvent(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct FGameplayTag EventTag, struct FGameplayEventData payload, int32_t AffectedActors); // Function Madness.MadGameplayAbility.TargetArraySendGameplayEvent // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161d620
	void TargetArrayRemoveGameplayEffect(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct UGameplayEffect* GameplayEffect, struct FGameplayTagContainer GrantedTags, int32_t AffectedActors, int32_t StacksToRemove, struct AActor* Causer); // Function Madness.MadGameplayAbility.TargetArrayRemoveGameplayEffect // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161d370
	void TargetArrayGetBestByHealth(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, bool bLowestHealth, struct AMadBaseCharacter* BestChar); // Function Madness.MadGameplayAbility.TargetArrayGetBestByHealth // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161d1b0
	void TargetArrayGetBestByDistance(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, bool bNearest, struct AMadBaseCharacter* BestChar, float Distance); // Function Madness.MadGameplayAbility.TargetArrayGetBestByDistance // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161cfb0
	struct TArray<struct AActor*> TargetArrayFilter(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions); // Function Madness.MadGameplayAbility.TargetArrayFilter // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161ce40
	void TargetArrayExecuteImpactCue(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct AActor* Attacker, float TraceDistance, struct FGameplayTag GameplayCueTag, int32_t AffectedActors); // Function Madness.MadGameplayAbility.TargetArrayExecuteImpactCue // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161cc20
	void TargetArrayApplyHeal(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct AActor* Causer, float Value, bool bIsPercentValue, bool bShowCue, int32_t AffectedActors, float HealedTotal); // Function Madness.MadGameplayAbility.TargetArrayApplyHeal // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161c960
	void TargetArrayApplyGameplayEffects(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct TArray<struct FGameplayEffectSpecHandle> GameplayEffectSpecs); // Function Madness.MadGameplayAbility.TargetArrayApplyGameplayEffects // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161c760
	void TargetArrayApplyGameplayEffect(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, struct UGameplayEffect* GameplayEffect, struct AActor* Causer, int32_t AffectedActors); // Function Madness.MadGameplayAbility.TargetArrayApplyGameplayEffect // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161c590
	void TargetArrayApplyDamage(struct TArray<struct AActor*> Targets, struct TArray<struct FMadTargetCondition> Conditions, float Damage, struct AController* Instigator, struct AActor* DamageCauser, struct UMadDamageType* DamageTypeClass); // Function Madness.MadGameplayAbility.TargetArrayApplyDamage // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x161c380
	void StopCameraAbilityState(); // Function Madness.MadGameplayAbility.StopCameraAbilityState // (Final|Native|Public|BlueprintCallable) // @ game+0x161c360
	void StartCameraAbilityState(struct FCameraControlParameters ControlParameters); // Function Madness.MadGameplayAbility.StartCameraAbilityState // (Final|Native|Public|BlueprintCallable) // @ game+0x161c270
	void ResetSkillCharges(); // Function Madness.MadGameplayAbility.ResetSkillCharges // (Final|Native|Public|BlueprintCallable) // @ game+0x161bb20
	void RemoveAnimDataOverride(); // Function Madness.MadGameplayAbility.RemoveAnimDataOverride // (Final|Native|Protected|BlueprintCallable) // @ game+0x161b980
	void QuickChange(bool bShow, int32_t InNumber); // Function Madness.MadGameplayAbility.QuickChange // (Final|Native|Public|BlueprintCallable) // @ game+0x161b8c0
	void OnPawnKilled(struct ABaseCharacter* character, struct FTakeHitInfo TakeHitInfo); // Function Madness.MadGameplayAbility.OnPawnKilled // (Final|Native|Private) // @ game+0x161b400
	void MetricsCommitAbilityUsage(); // Function Madness.MadGameplayAbility.MetricsCommitAbilityUsage // (Final|Native|Protected|BlueprintCallable) // @ game+0x161b280
	void K2_StopAbilityDuration(); // Function Madness.MadGameplayAbility.K2_StopAbilityDuration // (Final|Native|Protected|BlueprintCallable) // @ game+0x161b260
	void K2_SendAbilityMessage(struct FText MsgText, int32_t InDuration); // Function Madness.MadGameplayAbility.K2_SendAbilityMessage // (Final|Native|Protected|BlueprintCallable) // @ game+0x161b130
	void K2_ResetCooldownsForActiveSkills(); // Function Madness.MadGameplayAbility.K2_ResetCooldownsForActiveSkills // (Final|Native|Public|BlueprintCallable) // @ game+0x161b110
	bool K2_CommitAbilityDurationWithTag(struct FGameplayTag DataTag, float Magnitude, bool bReset); // Function Madness.MadGameplayAbility.K2_CommitAbilityDurationWithTag // (Final|Native|Protected|BlueprintCallable) // @ game+0x161b000
	bool K2_CommitAbilityDuration(struct FName DataName, float Magnitude, bool bReset); // Function Madness.MadGameplayAbility.K2_CommitAbilityDuration // (Native|Protected|BlueprintCallable) // @ game+0x161aef0
	bool K2_CommitAbilityCooldownWithTagMagnitude(struct FGameplayTag DataTag, float Magnitude, bool BroadcastCommitEvent, bool ForceCooldown); // Function Madness.MadGameplayAbility.K2_CommitAbilityCooldownWithTagMagnitude // (Final|Native|Public|BlueprintCallable) // @ game+0x161ad80
	bool K2_CommitAbilityCooldownWithMagnitude(bool BroadcastCommitEvent, bool ForceCooldown, struct FName DataName, float Magnitude); // Function Madness.MadGameplayAbility.K2_CommitAbilityCooldownWithMagnitude // (Native|Public|BlueprintCallable) // @ game+0x161ac00
	bool K2_CanBeInterrupted(); // Function Madness.MadGameplayAbility.K2_CanBeInterrupted // (Native|Event|Public|BlueprintEvent|Const) // @ game+0x161abd0
	void K2_ActivateAbilityNonInstanced(struct FGameplayAbilitySpecHandle Handle, struct FGameplayAbilityActorInfo ActorInfo, struct FGameplayAbilityActivationInfo ActivationInfo); // Function Madness.MadGameplayAbility.K2_ActivateAbilityNonInstanced // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void K2_ActivateAbilityFromDamageEvent(float Damage, struct UMadDamageType* DamageTypeClass, struct AMadPlayerController* InstigatorAsMadPC, struct AFWAIController* InstigatorAsAIController, struct AActor* DamageCauser); // Function Madness.MadGameplayAbility.K2_ActivateAbilityFromDamageEvent // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	bool IsSpawnTargetDataValid(struct FGameplayAbilityTargetDataHandle TargetData); // Function Madness.MadGameplayAbility.IsSpawnTargetDataValid // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x161aa90
	bool IsSectionLooped(struct UAnimMontage* InMontage, struct FName InName); // Function Madness.MadGameplayAbility.IsSectionLooped // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x161a940
	void GetThrowOriginAndSpeed(struct FGameplayAbilityTargetDataHandle TargetData, struct FVector OutOrigin, struct FVector OutDirection, float OutSpeed, enum class EThrowType OutThrowType); // Function Madness.MadGameplayAbility.GetThrowOriginAndSpeed // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x161a6e0
	struct FTransform GetThrowOffsetFromMontage(struct UAnimMontage* InMontage, struct FName ThrowSectionName, struct FName ThrowSocketName, struct FString ThrowNotifyName, struct FName SlotName); // Function Madness.MadGameplayAbility.GetThrowOffsetFromMontage // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x161a510
	struct FTransform GetThrowOffset(struct FName ThrowSectionName, struct FName ThrowSocketName, struct FString ThrowNotifyName, struct FName SlotName); // Function Madness.MadGameplayAbility.GetThrowOffset // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x161a370
	bool GetTargetLocation(struct FGameplayAbilityTargetDataHandle TargetData, struct FVector OutTargetLocation); // Function Madness.MadGameplayAbility.GetTargetLocation // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x161a200
	bool GetTarget(struct FGameplayAbilityTargetDataHandle TargetData, struct AActor* OutTarget); // Function Madness.MadGameplayAbility.GetTarget // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x161a090
	float GetRemainingDuration(); // Function Madness.MadGameplayAbility.GetRemainingDuration // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x161a030
	void GetParamsFromEventData(struct FGameplayEventData EventData, struct AMadPlayerController* InstigatorAsMadPC, struct AFWAIController* InstigatorAsAIController, float Damage, struct UMadDamageType* DamageTypeClass, struct AActor* DamageCauser); // Function Madness.MadGameplayAbility.GetParamsFromEventData // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619bb0
	int32_t GetNumberOfEnemiesInRangeFromOwner(float InRange); // Function Madness.MadGameplayAbility.GetNumberOfEnemiesInRangeFromOwner // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619ae0
	int32_t GetNumberOfEnemies(struct TArray<struct AActor*> InDamagedActors); // Function Madness.MadGameplayAbility.GetNumberOfEnemies // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619a20
	float GetGrantedByEffectLevel(); // Function Madness.MadGameplayAbility.GetGrantedByEffectLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619820
	void GetGameplayEffectsDurations(float CooldownEffect, float DurationEffect); // Function Madness.MadGameplayAbility.GetGameplayEffectsDurations // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619740
	int32_t GetCurrentSectionIndex(struct UAnimInstance* AnimInstance, struct UAnimMontage* InMontage); // Function Madness.MadGameplayAbility.GetCurrentSectionIndex // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619660
	struct TArray<struct FName> GetCompositeSectionNames(struct UAnimMontage* InMontage); // Function Madness.MadGameplayAbility.GetCompositeSectionNames // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619580
	bool GetAllTargets(struct FGameplayAbilityTargetDataHandle TargetData, struct TArray<struct AActor*> OutTargets); // Function Madness.MadGameplayAbility.GetAllTargets // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16191c0
	struct UFWAIArchetype* GetAIArchetype(struct AActor* InAIActor); // Function Madness.MadGameplayAbility.GetAIArchetype // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1619130
	bool FindMastery(struct AMadPlayerCharacter* InPlayer, struct FGameplayTag MasteryTag); // Function Madness.MadGameplayAbility.FindMastery // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1618fb0
	void FaceTarget(struct AMadBaseCharacter* InTarget, struct AMadPlayerCharacter* InPlayer, float InDuration, bool InOnlyYaw); // Function Madness.MadGameplayAbility.FaceTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1618e40
	void ExecuteImpactCueFromHitResult(struct FHitResult InHitResult, struct FGameplayTag GameplayCueTag); // Function Madness.MadGameplayAbility.ExecuteImpactCueFromHitResult // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1618c60
	void ExecuteImpactCueFromHitInfo(struct AActor* HitActor, struct FTakeHitInfo HitInfo, struct FGameplayTag GameplayCueTag); // Function Madness.MadGameplayAbility.ExecuteImpactCueFromHitInfo // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1618aa0
	void ExecuteImpactCue(struct AActor* InAttacker, struct AActor* InTarget, float TraceDistance, struct FGameplayTag GameplayCueTag); // Function Madness.MadGameplayAbility.ExecuteImpactCue // (Final|Native|Protected|BlueprintCallable) // @ game+0x1618950
	void EnableLayeredBlendSetup(struct FLayeredBlendSetup BlendSetup); // Function Madness.MadGameplayAbility.EnableLayeredBlendSetup // (Final|BlueprintAuthorityOnly|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1618880
	void DisableLayeredBlendSetup(); // Function Madness.MadGameplayAbility.DisableLayeredBlendSetup // (Final|BlueprintAuthorityOnly|Native|Protected|BlueprintCallable) // @ game+0x1618820
	bool ConsumeEffects(struct AActor* InTarget, struct FGameplayTagContainer Tags); // Function Madness.MadGameplayAbility.ConsumeEffects // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1618550
	void CommitKeywords(struct FGameplayTagContainer InIgnoreKeywords); // Function Madness.MadGameplayAbility.CommitKeywords // (Final|Native|Public|BlueprintCallable) // @ game+0x1618480
	void ApplyAnimDataOverride(); // Function Madness.MadGameplayAbility.ApplyAnimDataOverride // (Final|Native|Protected|BlueprintCallable) // @ game+0x1618440
};

// Class Madness.MadAIGameplayAbility
// Size: 0x518 (Inherited: 0x4b8)
struct UMadAIGameplayAbility : UMadGameplayAbility {
	char UnknownData_4B8[0x8]; // 0x4b8(0x08)
	struct FGameplayTagContainer ProhibitedTargetTags; // 0x4c0(0x20)
	struct FGameplayTagContainer DeactivationOwnedTags; // 0x4e0(0x20)
	struct UMadAbilitySet* AbilitySetForPlayer; // 0x500(0x08)
	char UnknownData_508_0 : 7; // 0x508(0x01)
	bool bStopsAIBehaviorLogic : 1; // 0x508(0x01)
	char UnknownData_509_0 : 7; // 0x509(0x01)
	bool bRestartAIBehaviorLogicOnEnd : 1; // 0x509(0x01)
	char UnknownData_50A_0 : 7; // 0x50a(0x01)
	bool bStopsAIMovement : 1; // 0x50a(0x01)
	char UnknownData_50B_0 : 7; // 0x50b(0x01)
	bool bForceCollision : 1; // 0x50b(0x01)
	char UnknownData_50C[0xc]; // 0x50c(0x0c)

	void SetAIFocalPoint(struct AActor* FocusTarget, struct FVector FocalPoint); // Function Madness.MadAIGameplayAbility.SetAIFocalPoint // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x154f4f0
	void K2_RestoreDefaultCollision(); // Function Madness.MadAIGameplayAbility.K2_RestoreDefaultCollision // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x154efa0
	bool K2_NavMeshRaycast(struct FVector RayStart, struct FVector RayEnd, struct FVector HitLocation, struct UObject* Querier, struct UNavigationQueryFilter* FilterClass); // Function Madness.MadAIGameplayAbility.K2_NavMeshRaycast // (Final|BlueprintAuthorityOnly|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x154edc0
	enum class EMadAIAbilityResult K2_GetAIAbilityResult(); // Function Madness.MadAIGameplayAbility.K2_GetAIAbilityResult // (BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x154ed90
	void K2_ForceCollsion(); // Function Madness.MadAIGameplayAbility.K2_ForceCollsion // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x154ed70
	void K2_FailAbility(); // Function Madness.MadAIGameplayAbility.K2_FailAbility // (Native|Public|BlueprintCallable) // @ game+0x154ed50
	bool K2_CanHitTargetUsingSMMeleeAttack(struct UMadAIGameplayAbility* OwningAbility, struct AActor* Target, struct UMadDataAsset_SMMeleeAttacks* AnimDataAsset); // Function Madness.MadAIGameplayAbility.K2_CanHitTargetUsingSMMeleeAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x154ec60
	bool K2_CanHitTargetUsingMeleeAttack(struct AActor* Source, struct AActor* Target, struct UMadDataAsset_DirectionalMeleeAttack* AnimDataAsset, float CollisionRadiusMultiplier, bool CheckCollisionAboveCovers); // Function Madness.MadAIGameplayAbility.K2_CanHitTargetUsingMeleeAttack // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154ead0
	bool K2_CanHitTargetUsingComboMeleeAttack(struct AActor* Source, struct AActor* Target, struct UMadDataAsset_DirectionalMeleeAttack* AnimDataAsset, float CollisionRadiusMultiplier); // Function Madness.MadAIGameplayAbility.K2_CanHitTargetUsingComboMeleeAttack // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e980
	bool K2_AreHostileActorsInRange(struct APawn* Source, struct FVector Origin, float Radius, int32_t RequiredNumberOfHostiles); // Function Madness.MadAIGameplayAbility.K2_AreHostileActorsInRange // (Final|BlueprintAuthorityOnly|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e810
	struct AMadCharAI* GetPawnFromActorInfo(struct FGameplayAbilityActorInfo ActorInfo); // Function Madness.MadAIGameplayAbility.GetPawnFromActorInfo // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e640
	struct AMadBaseAI* GetAIControllerFromActor(struct AActor* Actor); // Function Madness.MadAIGameplayAbility.GetAIControllerFromActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e280
	struct AMadBaseAI* GetAIControllerFromActivatingPawn(); // Function Madness.MadAIGameplayAbility.GetAIControllerFromActivatingPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e250
	struct AActor* GetAIAbilityTarget(); // Function Madness.MadAIGameplayAbility.GetAIAbilityTarget // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e220
	struct AMadCharAI* GetActivatingPawn(); // Function Madness.MadAIGameplayAbility.GetActivatingPawn // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e390
	struct UAbilitySystemComponent* GetAbilitySystemComponentFromActor(struct AActor* Actor); // Function Madness.MadAIGameplayAbility.GetAbilitySystemComponentFromActor // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e310
	bool DoesTargetHaveTags(struct AActor* Target, struct FGameplayTagContainer Tags); // Function Madness.MadAIGameplayAbility.DoesTargetHaveTags // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x154df20
	bool DoesTargetHaveProhibitedTagsForAI(struct AActor* TargetActor); // Function Madness.MadAIGameplayAbility.DoesTargetHaveProhibitedTagsForAI // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintCallable|BlueprintEvent) // @ game+0x154de80
	void ClearAIFocalPoint(); // Function Madness.MadAIGameplayAbility.ClearAIFocalPoint // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x154de60
	bool CanHitTarget(struct ABaseCharacter* Source, struct AActor* Target, bool bUseIdealYawRotationToTarget); // Function Madness.MadAIGameplayAbility.CanHitTarget // (BlueprintAuthorityOnly|Native|Event|Public|BlueprintCallable|BlueprintEvent|BlueprintPure|Const) // @ game+0x154dd50
};

// Class Madness.MadAIAbility_ThrowGrenade
// Size: 0x518 (Inherited: 0x518)
struct UMadAIAbility_ThrowGrenade : UMadAIGameplayAbility {

	bool IsThrowLocationValid(struct FVector Location); // Function Madness.MadAIAbility_ThrowGrenade.IsThrowLocationValid // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x15330b0
	struct FVector GetBestThrowLocation(float Radius, enum class EFWDiscreteDistance MinDistance, bool bSkipSingleTargetWithoutCover, float MaxAngleOutOfCover, float MaxAngleInCover, bool bNeedFinalLocation); // Function Madness.MadAIAbility_ThrowGrenade.GetBestThrowLocation // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x15327a0
};

// Class Madness.MadAIAbility_Airstrike
// Size: 0x5b0 (Inherited: 0x518)
struct UMadAIAbility_Airstrike : UMadAIAbility_ThrowGrenade {
	struct FScalableFloat MinActivationDistance; // 0x518(0x20)
	struct FScalableFloat MaxActivationDistance; // 0x538(0x20)
	struct FScalableFloat MaxTargetGroupingDistance; // 0x558(0x20)
	struct UMadDataAsset_ThrowProjectileVariants* ThrowVariants; // 0x578(0x08)
	struct UMadGameplayEffect* FailedAttemptCooldownClass; // 0x580(0x08)
	char UnknownData_588[0x10]; // 0x588(0x10)
	struct AMadBaseAICharacter* OwnerCharacter; // 0x598(0x08)
	struct AMadBaseAI* OwnerController; // 0x5a0(0x08)
	struct UMadThrowProjectile* ThrowTask; // 0x5a8(0x08)

	void ThrowingFinished(struct FName NotifyName); // Function Madness.MadAIAbility_Airstrike.ThrowingFinished // (Final|Native|Protected) // @ game+0x15277e0
	void TestFinished(bool bCanThrow); // Function Madness.MadAIAbility_Airstrike.TestFinished // (Final|Native|Protected) // @ game+0x1527750
};

// Class Madness.MadAIAbility_Altered_Blink
// Size: 0x598 (Inherited: 0x518)
struct UMadAIAbility_Altered_Blink : UMadAIGameplayAbility {
	float MaxBlinkRange; // 0x518(0x04)
	char UnknownData_51C[0x4]; // 0x51c(0x04)
	struct UEnvQuery* EscapeQuery; // 0x520(0x08)
	struct UEnvQuery* AttackQuery; // 0x528(0x08)
	struct UAnimMontage* CastingMontage; // 0x530(0x08)
	float AbilityCastingTime; // 0x538(0x04)
	char UnknownData_53C[0x4]; // 0x53c(0x04)
	struct UGameplayEffect* BlinkEffectClass; // 0x540(0x08)
	struct UGameplayEffect* PostAbilityEffectClass; // 0x548(0x08)
	struct AActor* BlinkWaveClass; // 0x550(0x08)
	struct AActor* PostBlinkExplosionClass; // 0x558(0x08)
	float TooMuchDanger; // 0x560(0x04)
	char UnknownData_564[0x4]; // 0x564(0x04)
	struct AMadCharAI* AbilityOwner; // 0x568(0x08)
	struct AActor* Target; // 0x570(0x08)
	char UnknownData_578[0x20]; // 0x578(0x20)

	void OnSpawnWave(struct AActor* WaveActor, struct AMadCharAI* InCaster, struct FVector CasterLocation, struct FVector InBlinkLocation, bool bTeleportTo); // Function Madness.MadAIAbility_Altered_Blink.OnSpawnWave // (Event|Protected|HasOutParms|HasDefaults|BlueprintEvent) // @ game+0x1a35c70
	void OnSpawnExplosion(struct AActor* ExplosionActor); // Function Madness.MadAIAbility_Altered_Blink.OnSpawnExplosion // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void OnMontageNotifyBegin(struct FName NotifyName); // Function Madness.MadAIAbility_Altered_Blink.OnMontageNotifyBegin // (Final|Native|Private) // @ game+0x1526ef0
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Altered_Blink.OnMontageComplete // (Final|Native|Private) // @ game+0x1526d80
	void OnMontageChangeSuccessSpawn(); // Function Madness.MadAIAbility_Altered_Blink.OnMontageChangeSuccessSpawn // (Final|Native|Private) // @ game+0x1526d60
	void OnMontageChangeFail(); // Function Madness.MadAIAbility_Altered_Blink.OnMontageChangeFail // (Final|Native|Private) // @ game+0x1526d40
	void OnMontageCancelled(struct FName NotifyName); // Function Madness.MadAIAbility_Altered_Blink.OnMontageCancelled // (Final|Native|Private) // @ game+0x1526cc0
};

// Class Madness.MadAIAbility_Altered_GroundHit
// Size: 0x520 (Inherited: 0x518)
struct UMadAIAbility_Altered_GroundHit : UMadAIGameplayAbility {
	struct AMadDamageArea* DamageAreaTemplate; // 0x518(0x08)

	void SpawnDamageArea(struct AActor* Owner, struct FVector SpawnOrigin); // Function Madness.MadAIAbility_Altered_GroundHit.SpawnDamageArea // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1527590
	void OnDamageAreaSpawned(struct AActor* SpawnedArea); // Function Madness.MadAIAbility_Altered_GroundHit.OnDamageAreaSpawned // (Final|Native|Protected) // @ game+0x1526bc0
	void OnDamageAreaSpawnCompleted(); // Function Madness.MadAIAbility_Altered_GroundHit.OnDamageAreaSpawnCompleted // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	bool AreHostileActorsInRange(struct AFWAIController* OwnerAIController, struct FVector Origin, int32_t MinNumberOfHostiles, float Radius); // Function Madness.MadAIAbility_Altered_GroundHit.AreHostileActorsInRange // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526220
};

// Class Madness.MadAIAbility_Altered_InstantBurn
// Size: 0x530 (Inherited: 0x518)
struct UMadAIAbility_Altered_InstantBurn : UMadAIGameplayAbility {
	struct UMadGameplayEffect* BlockReactionsGameplayEffect; // 0x518(0x08)
	char UnknownData_520[0x10]; // 0x520(0x10)

	void SelectNewAbilityTargetWithinRange(struct AFWAIController* OwnerAIController, float Range, struct AActor* OutNewTarget); // Function Madness.MadAIAbility_Altered_InstantBurn.SelectNewAbilityTargetWithinRange // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15270b0
	bool IsAbilityTargetAvailableWithinRange(struct AFWAIController* OwnerAIController, float Range, bool bNextTarget); // Function Madness.MadAIAbility_Altered_InstantBurn.IsAbilityTargetAvailableWithinRange // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15269b0
	void AddTargetActorToTheAttackedList(struct AActor* AttackedActor); // Function Madness.MadAIAbility_Altered_InstantBurn.AddTargetActorToTheAttackedList // (Final|Native|Public|BlueprintCallable) // @ game+0x15261a0
};

// Class Madness.MadAiAbility_Guardian_Barrage
// Size: 0x6a0 (Inherited: 0x518)
struct UMadAiAbility_Guardian_Barrage : UMadAIGameplayAbility {
	struct FMulticastInlineDelegate OnComplete; // 0x518(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x528(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x538(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x548(0x10)
	struct FMulticastInlineDelegate OnBarrageInterrupted; // 0x558(0x10)
	struct UAnimMontage* CastingMontage; // 0x568(0x08)
	float DistanceToEnemyMin; // 0x570(0x04)
	float DistanceToEnemyMax; // 0x574(0x04)
	struct AScrapBarrage_Projectile* ProjectileClass; // 0x578(0x08)
	struct AScrapBarrage_Marker* MarkerClass; // 0x580(0x08)
	struct UGameplayEffect* PostAbilityEffectClass; // 0x588(0x08)
	struct UGameplayEffect* BarrageChannelEffectClass; // 0x590(0x08)
	float AbilityCastingTime; // 0x598(0x04)
	char UnknownData_59C[0x4]; // 0x59c(0x04)
	struct UParticleSystem* ParticleSystem; // 0x5a0(0x08)
	struct UAnimMontage* ShardMontage; // 0x5a8(0x08)
	struct FScalableFloat ProjectileDamageValueScalable; // 0x5b0(0x20)
	float BarrageSpawnOffset; // 0x5d0(0x04)
	float BarrageSpawnHeightOffset; // 0x5d4(0x04)
	float BarrageSpawnAngleRange; // 0x5d8(0x04)
	float ProjectileSpawnRandomOffset; // 0x5dc(0x04)
	int32_t MultiThrowMin; // 0x5e0(0x04)
	int32_t MultiThrowMax; // 0x5e4(0x04)
	struct AActor* Target; // 0x5e8(0x08)
	struct AMadCharAI* Caster; // 0x5f0(0x08)
	struct TArray<struct AActor*> AllPlayers; // 0x5f8(0x10)
	struct TArray<struct AScrapBarrage_Marker*> MarkersArray; // 0x608(0x10)
	struct AActor* CurrentTarget; // 0x618(0x08)
	struct TArray<struct FVector> MarkerLocationsArray; // 0x620(0x10)
	char UnknownData_630_0 : 7; // 0x630(0x01)
	bool bSetCooldown : 1; // 0x630(0x01)
	char UnknownData_631[0x3]; // 0x631(0x03)
	int32_t ThrowCountCurrent; // 0x634(0x04)
	int32_t MultiThrowCount; // 0x638(0x04)
	struct FVector ClosestToTargetMarkerLocation; // 0x63c(0x0c)
	float ProjectileSpawnInterval; // 0x648(0x04)
	char UnknownData_64C_0 : 7; // 0x64c(0x01)
	bool bThrowOnce : 1; // 0x64c(0x01)
	char UnknownData_64D_0 : 7; // 0x64d(0x01)
	bool bFixedThrowNumber : 1; // 0x64d(0x01)
	char UnknownData_64E[0x2]; // 0x64e(0x02)
	struct UMadAbilityTask_CurrentMontageChangeSection* ChangeMontageSectionTask; // 0x650(0x08)
	char UnknownData_658[0x48]; // 0x658(0x48)

	void Throw(); // Function Madness.MadAiAbility_Guardian_Barrage.Throw // (Final|Native|Private) // @ game+0x152ef40
	bool ShowCastBar(float CastTime, bool bIsChanneling); // Function Madness.MadAiAbility_Guardian_Barrage.ShowCastBar // (Final|Native|Protected|BlueprintCallable) // @ game+0x152ec10
	void SetMaxBarrageHits(); // Function Madness.MadAiAbility_Guardian_Barrage.SetMaxBarrageHits // (Final|Native|Protected|BlueprintCallable) // @ game+0x152ebf0
	void OnTargetMarkerFullySpawned(struct AActor* MarkerActor); // Function Madness.MadAiAbility_Guardian_Barrage.OnTargetMarkerFullySpawned // (Final|Native|Private) // @ game+0x152eac0
	void OnProjectileFullySpawned(struct AActor* ProjectileActor); // Function Madness.MadAiAbility_Guardian_Barrage.OnProjectileFullySpawned // (Final|Native|Private) // @ game+0x152ea40
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Barrage.OnNotifyBeginHandler // (Final|Native|Protected) // @ game+0x152e940
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Barrage.OnInterruptedHandler // (Final|Native|Protected) // @ game+0x152e740
	void OnInterruptChangeSectionSuccessful(); // Function Madness.MadAiAbility_Guardian_Barrage.OnInterruptChangeSectionSuccessful // (Final|Native|Private) // @ game+0x152e600
	void OnInterruptChangeSectionFailed(); // Function Madness.MadAiAbility_Guardian_Barrage.OnInterruptChangeSectionFailed // (Final|Native|Private) // @ game+0x152e5a0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Barrage.OnCompleteHandler // (Final|Native|Protected) // @ game+0x152e500
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Barrage.OnCancelledHandler // (Final|Native|Protected) // @ game+0x152e300
	struct FVector GetBarrageSpawnLocation(); // Function Madness.MadAiAbility_Guardian_Barrage.GetBarrageSpawnLocation // (Final|Native|Protected|HasDefaults|BlueprintCallable) // @ game+0x152e0e0
	void CreateBarrageMarkers(); // Function Madness.MadAiAbility_Guardian_Barrage.CreateBarrageMarkers // (Final|Native|Protected|BlueprintCallable) // @ game+0x152e080
	void CallSetBarrageOrigin(); // Function Madness.MadAiAbility_Guardian_Barrage.CallSetBarrageOrigin // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
};

// Class Madness.MadAIAbility_Altered_Mortar
// Size: 0x6a0 (Inherited: 0x6a0)
struct UMadAIAbility_Altered_Mortar : UMadAiAbility_Guardian_Barrage {

	void SelectRandomNumberOfPoints(struct AAIController* OwnerController, struct TArray<struct FVector> ArrayToResize); // Function Madness.MadAIAbility_Altered_Mortar.SelectRandomNumberOfPoints // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x15271d0
};

// Class Madness.MadAIAbility_Altered_NukeShield
// Size: 0x520 (Inherited: 0x518)
struct UMadAIAbility_Altered_NukeShield : UMadAIGameplayAbility {
	char UnknownData_518[0x8]; // 0x518(0x08)

	bool HasRequiredHealthLevel(struct AFWAIController* OwnerAIController, float HealthLevel); // Function Madness.MadAIAbility_Altered_NukeShield.HasRequiredHealthLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15268e0
	bool GetAttackPerTierPerformed(enum class ENukeShieldTier Tier); // Function Madness.MadAIAbility_Altered_NukeShield.GetAttackPerTierPerformed // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526790
};

// Class Madness.MadAIAbility_Altered_TrippleDash
// Size: 0x578 (Inherited: 0x518)
struct UMadAIAbility_Altered_TrippleDash : UMadAIGameplayAbility {
	struct AMadDamageArea* DamageAreaTemplate; // 0x518(0x08)
	float ZTestDistance; // 0x520(0x04)
	float DistanceMultiplier; // 0x524(0x04)
	float MinDistanceBewteenTargetAndSelfActor; // 0x528(0x04)
	float InRadius; // 0x52c(0x04)
	struct APawn* OwningPawn; // 0x530(0x08)
	struct AActor* TargetActor; // 0x538(0x08)
	struct AFWAIController* Controller; // 0x540(0x08)
	int32_t NonDBNOTargetsNumber; // 0x548(0x04)
	char UnknownData_54C[0x4]; // 0x54c(0x04)
	struct TArray<struct AActor*> TargetsToAttack; // 0x550(0x10)
	struct FVector JumpEndPoint; // 0x560(0x0c)
	struct FVector JumpStartPoint; // 0x56c(0x0c)

	void SpawnDamageArea(struct FVector AreaOrigin); // Function Madness.MadAIAbility_Altered_TrippleDash.SpawnDamageArea // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1527660
	void SetJumpStartPoint(struct FVector InPoint); // Function Madness.MadAIAbility_Altered_TrippleDash.SetJumpStartPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1527360
	void SetJumpEndPoint(struct FVector InPoint); // Function Madness.MadAIAbility_Altered_TrippleDash.SetJumpEndPoint // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x15272c0
	void RotateAbilityOwnerTowardTarget(); // Function Madness.MadAIAbility_Altered_TrippleDash.RotateAbilityOwnerTowardTarget // (Final|Native|Protected|BlueprintCallable) // @ game+0x1527090
	void PostJumpCleanup(); // Function Madness.MadAIAbility_Altered_TrippleDash.PostJumpCleanup // (Final|Native|Public|BlueprintCallable) // @ game+0x1527070
	void OnEndEnabled(); // Function Madness.MadAIAbility_Altered_TrippleDash.OnEndEnabled // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void OnDamageAreaSpawned(struct AActor* SpawnedArea); // Function Madness.MadAIAbility_Altered_TrippleDash.OnDamageAreaSpawned // (Final|Native|Private) // @ game+0x1526c40
	void OnDamageAreaSpawnCompleted(); // Function Madness.MadAIAbility_Altered_TrippleDash.OnDamageAreaSpawnCompleted // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	int32_t GetOverallTargetsNumber(); // Function Madness.MadAIAbility_Altered_TrippleDash.GetOverallTargetsNumber // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x15268c0
	struct FVector GetJumpStartPoint(); // Function Madness.MadAIAbility_Altered_TrippleDash.GetJumpStartPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526890
	struct FVector GetJumpEndPoint(); // Function Madness.MadAIAbility_Altered_TrippleDash.GetJumpEndPoint // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526860
	bool CanActivateTripleDash(struct APawn* SelfActor, struct AActor* Target, float MinDistance, float MaxDistance, struct FVector OutVector); // Function Madness.MadAIAbility_Altered_TrippleDash.CanActivateTripleDash // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526560
	bool CalculateNextJumpEndPoint(); // Function Madness.MadAIAbility_Altered_TrippleDash.CalculateNextJumpEndPoint // (Final|Native|Public|BlueprintCallable) // @ game+0x1526390
};

// Class Madness.MadAIAbility_Bailey_EarthTremble
// Size: 0x578 (Inherited: 0x518)
struct UMadAIAbility_Bailey_EarthTremble : UMadAIGameplayAbility {
	struct TArray<struct FVector> ExplosionOffsets; // 0x518(0x10)
	float PredictionTime; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct AMadCharAI_Bailey* OwningPawn; // 0x530(0x08)
	struct AAIController* AIController; // 0x538(0x08)
	char UnknownData_540[0x38]; // 0x540(0x38)

	void OnSpawnLocationsFound(); // Function Madness.MadAIAbility_Bailey_EarthTremble.OnSpawnLocationsFound // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void FindSpikesLocations(); // Function Madness.MadAIAbility_Bailey_EarthTremble.FindSpikesLocations // (Final|Native|Public|BlueprintCallable) // @ game+0x1526770
};

// Class Madness.MadAIAbility_Bailey_GroundShock
// Size: 0x560 (Inherited: 0x518)
struct UMadAIAbility_Bailey_GroundShock : UMadAIGameplayAbility {
	struct UExplosionTemplate* SpikeExplosionTemplate; // 0x518(0x08)
	struct UEnvQuery* SpawnpointSelectionEQS; // 0x520(0x08)
	struct TArray<struct FVector> SpawnLocations; // 0x528(0x10)
	char UnknownData_538[0x28]; // 0x538(0x28)

	void SpawnSpikes(); // Function Madness.MadAIAbility_Bailey_GroundShock.SpawnSpikes // (Final|Native|Public|BlueprintCallable) // @ game+0x15276f0
	void FindSpikeLocations(); // Function Madness.MadAIAbility_Bailey_GroundShock.FindSpikeLocations // (Final|Native|Public|BlueprintCallable) // @ game+0x1526750
};

// Class Madness.MadAIAbility_Bailey_StoneWave
// Size: 0x570 (Inherited: 0x518)
struct UMadAIAbility_Bailey_StoneWave : UMadAIGameplayAbility {
	struct AMadProjectile* StoneWaveProjectile; // 0x518(0x08)
	struct FMulticastInlineDelegate SpawnSucceededDelegate; // 0x520(0x10)
	struct FMulticastInlineDelegate SpawnFailedDelegate; // 0x530(0x10)
	struct AMadCharAI* OwnerPawn; // 0x540(0x08)
	char UnknownData_548[0x8]; // 0x548(0x08)
	struct TArray<struct FWaveAndTargetData> SpawnedWaves; // 0x550(0x10)
	char UnknownData_560[0x10]; // 0x560(0x10)

	void SpawnStoneWaveActorsAllTargets(); // Function Madness.MadAIAbility_Bailey_StoneWave.SpawnStoneWaveActorsAllTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x1527710
	void SpawnAllTargetMarkers(struct FMadAITargetMarker TargetMarker, bool bUpdatePosition); // Function Madness.MadAIAbility_Bailey_StoneWave.SpawnAllTargetMarkers // (Final|Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1527490
	void OnWaveSpawned(struct AActor* InSpawned); // Function Madness.MadAIAbility_Bailey_StoneWave.OnWaveSpawned // (Final|Native|Private) // @ game+0x1526ff0
	void DestroyAllTargetMarkers(); // Function Madness.MadAIAbility_Bailey_StoneWave.DestroyAllTargetMarkers // (Final|Native|Public|BlueprintCallable) // @ game+0x1526710
};

// Class Madness.MadAIAbility_CallForBackup
// Size: 0x5a8 (Inherited: 0x518)
struct UMadAIAbility_CallForBackup : UMadAIGameplayAbility {
	struct TArray<struct FName> WaveNames; // 0x518(0x10)
	struct FScalableFloat MinFriendlyCountToReinforceScale; // 0x528(0x20)
	struct FMontageAssetSelector Montage; // 0x548(0x20)
	struct FName NotifyName; // 0x568(0x08)
	struct UFWAISemaphoreGroupClass* SemaphoreGroupClass; // 0x570(0x08)
	float SemaphoreDelay; // 0x578(0x04)
	char UnknownData_57C[0x4]; // 0x57c(0x04)
	struct UGameplayEffect* InitialCooldownGameplayEffectClass; // 0x580(0x08)
	char UnknownData_588[0x18]; // 0x588(0x18)
	struct UMadAIAbilityTask_CallBackup* Task; // 0x5a0(0x08)

	void TaskFinished(); // Function Madness.MadAIAbility_CallForBackup.TaskFinished // (Final|Native|Protected) // @ game+0x1527730
	struct FName GetBackupWaveName(); // Function Madness.MadAIAbility_CallForBackup.GetBackupWaveName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1526820
};

// Class Madness.MadAIAbilityTask
// Size: 0x90 (Inherited: 0x80)
struct UMadAIAbilityTask : UAbilityTask {
	struct AAIController* OwnerController; // 0x80(0x08)
	char UnknownData_88[0x8]; // 0x88(0x08)
};

// Class Madness.MadAIAbilityTask_CallBackup
// Size: 0x108 (Inherited: 0x90)
struct UMadAIAbilityTask_CallBackup : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	char UnknownData_C0[0x48]; // 0xc0(0x48)

	void TaskCallBackupDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_CallBackup.TaskCallBackupDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_CallBackup.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x1526ed0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_CallBackup.OnMontageEnded // (Final|Native|Protected) // @ game+0x1526e00
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_CallBackup.OnAnimNotify // (Final|Native|Protected) // @ game+0x1526ac0
	struct UMadAIAbilityTask_CallBackup* CallBackup(struct UObject* WorldContextObject, struct FMontageAssetSelector Montage, struct FName NotifyName, struct FName WaveName); // Function Madness.MadAIAbilityTask_CallBackup.CallBackup // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15263c0
};

// Class Madness.MadAIAbility_Captain_AnomalicCleave
// Size: 0x5b0 (Inherited: 0x518)
struct UMadAIAbility_Captain_AnomalicCleave : UMadAIGameplayAbility {
	struct UAnimMontage* AttackMontage; // 0x518(0x08)
	struct FName Section; // 0x520(0x08)
	struct FName ExecuteNotifyName; // 0x528(0x08)
	float PlayRate; // 0x530(0x04)
	float TurnDuration; // 0x534(0x04)
	struct FScalableFloat MaxRangeScale; // 0x538(0x20)
	float MaxPredictionDistance; // 0x558(0x04)
	float MaxPredictionTime; // 0x55c(0x04)
	struct UGameplayEffect* CastingEffectClass; // 0x560(0x08)
	struct UExplosionTemplate* ExplosionTemplate; // 0x568(0x08)
	struct AMadCharAI* OwnerCharacter; // 0x570(0x08)
	struct AFWAIController* OwnerController; // 0x578(0x08)
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* PlayMontageTask; // 0x580(0x08)
	struct AActor* CurrentTarget; // 0x588(0x08)
	char UnknownData_590[0x10]; // 0x590(0x10)
	struct TArray<struct AMadBaseTurretActor*> IgnoreTurrets; // 0x5a0(0x10)

	void OnNofityBegin(struct FName NotifyName); // Function Madness.MadAIAbility_Captain_AnomalicCleave.OnNofityBegin // (Final|Native|Protected) // @ game+0x1526f70
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Captain_AnomalicCleave.OnMontageComplete // (Final|Native|Protected) // @ game+0x1526d80
};

// Class Madness.MadAIAbility_CastedBase
// Size: 0x698 (Inherited: 0x518)
struct UMadAIAbility_CastedBase : UMadAIGameplayAbility {
	struct FScalableFloat RangeMin; // 0x518(0x20)
	struct FScalableFloat RangeMax; // 0x538(0x20)
	struct UAnimMontage* CastingMontage; // 0x558(0x08)
	float CastingTime; // 0x560(0x04)
	char UnknownData_564_0 : 7; // 0x564(0x01)
	bool bIsChanneled : 1; // 0x564(0x01)
	char UnknownData_565[0x3]; // 0x565(0x03)
	struct AMadBaseAICharacter* OwnerCharacter; // 0x568(0x08)
	struct AMadBaseAI* OwnerController; // 0x570(0x08)
	char UnknownData_578[0x120]; // 0x578(0x120)

	void OnNotifyBegin(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbility_CastedBase.OnNotifyBegin // (Native|Protected) // @ game+0x152bab0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbility_CastedBase.OnMontageEnded // (Final|Native|Protected) // @ game+0x152b860
};

// Class Madness.MadAIAbility_Captain_AnomalyBarrier
// Size: 0x7a8 (Inherited: 0x698)
struct UMadAIAbility_Captain_AnomalyBarrier : UMadAIAbility_CastedBase {
	struct FName TimeBeingTargetedName; // 0x698(0x08)
	float MinTimeBeingTargetedToActivateAbility; // 0x6a0(0x04)
	float RotateToTargetDuration; // 0x6a4(0x04)
	struct FScalableFloat ChannelingTime; // 0x6a8(0x20)
	struct TArray<float> AnglesOfWaves; // 0x6c8(0x10)
	float DelayBetweenWaveSpawns; // 0x6d8(0x04)
	struct FName ChargeHitSpawnSocketName; // 0x6dc(0x08)
	char UnknownData_6E4[0x4]; // 0x6e4(0x04)
	struct AMadAnomalyBarrierProjectile* NavmeshProjectileClass; // 0x6e8(0x08)
	float MaxNavmeshProjectileTestDistance; // 0x6f0(0x04)
	char UnknownData_6F4[0x4]; // 0x6f4(0x04)
	struct TSoftObjectPtr<struct UForceFeedbackEffect> ForceFeedback; // 0x6f8(0x28)
	struct TSoftObjectPtr<struct UForceFeedbackAttenuation> ForceFeedbackAttenuation; // 0x720(0x28)
	struct UCameraShake* CameraShakeClass; // 0x748(0x08)
	float CameraShakeInnerRadius; // 0x750(0x04)
	float CameraShakeOutterRadius; // 0x754(0x04)
	float CameraShakeFalloff; // 0x758(0x04)
	char UnknownData_75C_0 : 7; // 0x75c(0x01)
	bool bCameraShakeOrientTowardsEpicenter : 1; // 0x75c(0x01)
	char UnknownData_75D[0x3]; // 0x75d(0x03)
	struct AMadAnomalyBarrier* AnomalyBarrierClass; // 0x760(0x08)
	struct FName BarrierAttachmentSocketName; // 0x768(0x08)
	struct AMadAnomalyBarrier* Barrier; // 0x770(0x08)
	struct AActor* CurrentTarget; // 0x778(0x08)
	char UnknownData_780[0x28]; // 0x780(0x28)

	void SpawnNextWave(); // Function Madness.MadAIAbility_Captain_AnomalyBarrier.SpawnNextWave // (Final|Native|Private) // @ game+0x152bf20
};

// Class Madness.MadAIAbility_Captain_BaseAura
// Size: 0x710 (Inherited: 0x698)
struct UMadAIAbility_Captain_BaseAura : UMadAIAbility_CastedBase {
	struct FScalableFloat CastTime; // 0x698(0x20)
	struct AMadBaseAura* AuraActor; // 0x6b8(0x08)
	struct UFWAISemaphoreGroupClass* SemaphoreGroupClass; // 0x6c0(0x08)
	struct FScalableFloat SemaphoreDelayScalable; // 0x6c8(0x20)
	struct FScalableFloat SemaphoreDelayCancelledScalable; // 0x6e8(0x20)
	char UnknownData_708[0x8]; // 0x708(0x08)
};

// Class Madness.MadAIAbility_Captain_BeamTrap
// Size: 0x6b0 (Inherited: 0x518)
struct UMadAIAbility_Captain_BeamTrap : UMadAIGameplayAbility {
	struct FScalableFloat MaxRangeScale; // 0x518(0x20)
	struct FScalableFloat BaseDamageScale; // 0x538(0x20)
	struct AMadBeamTrapManager* BeamTrapManagerClass; // 0x558(0x08)
	struct AMadBeamTrapMarker* MarkerClass; // 0x560(0x08)
	float DesiredTrapDistanceToTarget; // 0x568(0x04)
	float MaxTrapDistanceToTarget; // 0x56c(0x04)
	float ExtraSpawnHeight; // 0x570(0x04)
	int32_t DesiredNumberOfTraps; // 0x574(0x04)
	int32_t MinNumberOfTraps; // 0x578(0x04)
	float CalculateTargetMinRotation; // 0x57c(0x04)
	float CalculateTargetMinMovement; // 0x580(0x04)
	float MaxPredictionDistance; // 0x584(0x04)
	float MaxPredictionTime; // 0x588(0x04)
	float ExtraRadius; // 0x58c(0x04)
	struct UAnimMontage* AttackMontage; // 0x590(0x08)
	struct FName StartSection; // 0x598(0x08)
	struct FName SuccessSection; // 0x5a0(0x08)
	struct FName InterruptSection; // 0x5a8(0x08)
	float CastingDuration; // 0x5b0(0x04)
	char UnknownData_5B4_0 : 7; // 0x5b4(0x01)
	bool bIsChanneling : 1; // 0x5b4(0x01)
	char UnknownData_5B5[0x3]; // 0x5b5(0x03)
	struct UGameplayEffect* CastingEffectClass; // 0x5b8(0x08)
	struct UGameplayEffect* ExhaustionEffectClass; // 0x5c0(0x08)
	float ExhaustionDurationLong; // 0x5c8(0x04)
	float ExhaustionDurationShort; // 0x5cc(0x04)
	struct FGameplayTag ExhaustionTag; // 0x5d0(0x08)
	struct AMadCharAI* OwnerCharacter; // 0x5d8(0x08)
	struct AFWAIController* OwnerController; // 0x5e0(0x08)
	struct UMadAbilityTask_PlayMontageAndWaitNotifyName* PlayMontageTask; // 0x5e8(0x08)
	struct UMadAbilityTask_CurrentMontageChangeSection* ChangeMontageSectionTask; // 0x5f0(0x08)
	struct AActor* CurrentTarget; // 0x5f8(0x08)
	char UnknownData_600[0x88]; // 0x600(0x88)
	struct TArray<struct AMadBeamTrapMarker*> Markers; // 0x688(0x10)
	char UnknownData_698[0x18]; // 0x698(0x18)

	void OnMontageFailed(struct FName NotifyName); // Function Madness.MadAIAbility_Captain_BeamTrap.OnMontageFailed // (Final|Native|Protected) // @ game+0x152b930
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Captain_BeamTrap.OnMontageComplete // (Final|Native|Protected) // @ game+0x152b7e0
	void OnChangeMontageSectionFailed(); // Function Madness.MadAIAbility_Captain_BeamTrap.OnChangeMontageSectionFailed // (Final|Native|Protected) // @ game+0x152b6c0
	void OnChangeMontageSectionEnded(); // Function Madness.MadAIAbility_Captain_BeamTrap.OnChangeMontageSectionEnded // (Final|Native|Protected) // @ game+0x152b6a0
};

// Class Madness.MadAIAbility_Captain_BurstHeal
// Size: 0x740 (Inherited: 0x698)
struct UMadAIAbility_Captain_BurstHeal : UMadAIAbility_CastedBase {
	struct UMadGameplayEffect* HealingEffect; // 0x698(0x08)
	struct FScalableFloat WoundThreshold; // 0x6a0(0x20)
	struct FScalableFloat RegularHealValue; // 0x6c0(0x20)
	struct FScalableFloat EliteHealValue; // 0x6e0(0x20)
	struct FScalableFloat CastTime; // 0x700(0x20)
	struct TArray<struct AMadBaseAICharacter*> HealTargets; // 0x720(0x10)
	char UnknownData_730[0x10]; // 0x730(0x10)
};

// Class Madness.MadAIAbility_Captain_ChargingBeam
// Size: 0x740 (Inherited: 0x698)
struct UMadAIAbility_Captain_ChargingBeam : UMadAIAbility_CastedBase {
	float BeamMaxLength; // 0x698(0x04)
	struct FVector BeamDestinationOffset; // 0x69c(0x0c)
	struct AMadChargingBeam* BeamEffectClass; // 0x6a8(0x08)
	struct FName BeamSpawnSocketName; // 0x6b0(0x08)
	float RotateToTargetSpeed; // 0x6b8(0x04)
	struct FName ConeCheckSocketName; // 0x6bc(0x08)
	float ConeCheckHalfAngle; // 0x6c4(0x04)
	struct TSoftObjectPtr<struct UForceFeedbackEffect> ForceFeedback; // 0x6c8(0x28)
	struct TSoftObjectPtr<struct UForceFeedbackAttenuation> ForceFeedbackAttenuation; // 0x6f0(0x28)
	struct UForceFeedbackComponent* ForceFeedbackSpawned; // 0x718(0x08)
	struct UMadAIAbilityTask_RotateTowardActor* RotateTask; // 0x720(0x08)
	struct UMadAIAbilityTask_ConeCheck* ConeCheckTask; // 0x728(0x08)
	char UnknownData_730[0x10]; // 0x730(0x10)

	void OnConeOverlapEnd(struct AActor* OtherActor); // Function Madness.MadAIAbility_Captain_ChargingBeam.OnConeOverlapEnd // (Final|Native|Private) // @ game+0x152b6e0
};

// Class Madness.MadAIAbility_Captain_DustStorm
// Size: 0x6a0 (Inherited: 0x698)
struct UMadAIAbility_Captain_DustStorm : UMadAIAbility_CastedBase {
	struct AMadDustStorm* DustStormActor; // 0x698(0x08)
};

// Class Madness.MadAIAbility_Captain_HealingCocoon
// Size: 0x6a8 (Inherited: 0x698)
struct UMadAIAbility_Captain_HealingCocoon : UMadAIAbility_CastedBase {
	struct AMadHealingCocoon* HealingCocoonActor; // 0x698(0x08)
	int32_t MaxAbilityTargets; // 0x6a0(0x04)
	char UnknownData_6A4[0x4]; // 0x6a4(0x04)
};

// Class Madness.MadAIAbility_Captain_HealthBasedBuff
// Size: 0x708 (Inherited: 0x698)
struct UMadAIAbility_Captain_HealthBasedBuff : UMadAIAbility_CastedBase {
	struct FScalableFloat CastTime; // 0x698(0x20)
	float LevelOfDangerMin; // 0x6b8(0x04)
	float AllowedHealthThreashold; // 0x6bc(0x04)
	float RotateToTargetDuration; // 0x6c0(0x04)
	char UnknownData_6C4_0 : 7; // 0x6c4(0x01)
	bool CanApplyToSelf : 1; // 0x6c4(0x01)
	char UnknownData_6C5[0x3]; // 0x6c5(0x03)
	struct UGameplayEffect* EffectToApplyOnTarget; // 0x6c8(0x08)
	struct FGameplayTagContainer ForbiddenTagsOnTarget; // 0x6d0(0x20)
	struct FGameplayTag TargetLockTag; // 0x6f0(0x08)
	struct AMadBaseCharacter* CastingTarget; // 0x6f8(0x08)
	char UnknownData_700[0x8]; // 0x700(0x08)
};

// Class Madness.MadAIAbility_Captain_IceOrbs
// Size: 0x728 (Inherited: 0x698)
struct UMadAIAbility_Captain_IceOrbs : UMadAIAbility_CastedBase {
	struct FScalableFloat OrbLifeSpan; // 0x698(0x20)
	struct FScalableFloat CastTime; // 0x6b8(0x20)
	struct UEnvQuery* OrbsSpawnLocationsQuery; // 0x6d8(0x08)
	int32_t MaxOrbsToSpawn; // 0x6e0(0x04)
	int32_t MinDistanceBetweenLocations; // 0x6e4(0x04)
	float DelayBetweenSpawns; // 0x6e8(0x04)
	char UnknownData_6EC[0x4]; // 0x6ec(0x04)
	struct AMadIceOrb* OrbActor; // 0x6f0(0x08)
	char UnknownData_6F8[0x30]; // 0x6f8(0x30)

	void SpawnOrb(); // Function Madness.MadAIAbility_Captain_IceOrbs.SpawnOrb // (Final|Native|Private) // @ game+0x152bf40
};

// Class Madness.MadAIAbility_Captain_LifeDevourer
// Size: 0x7d8 (Inherited: 0x698)
struct UMadAIAbility_Captain_LifeDevourer : UMadAIAbility_CastedBase {
	float CasterHealthRatioMaxToActivate; // 0x698(0x04)
	char UnknownData_69C[0x4]; // 0x69c(0x04)
	struct FScalableFloat ChannelingDuration; // 0x6a0(0x20)
	struct FScalableFloat CastingDuration; // 0x6c0(0x20)
	struct FScalableFloat BaseDamage; // 0x6e0(0x20)
	float RotateToTargetSpeed; // 0x700(0x04)
	struct FName ConeCheckSocketName; // 0x704(0x08)
	float ConeCheckHalfAngle; // 0x70c(0x04)
	float ConeCheckMaxRangeOffset; // 0x710(0x04)
	char UnknownData_714[0x4]; // 0x714(0x04)
	struct TSoftObjectPtr<struct UForceFeedbackEffect> ForceFeedback; // 0x718(0x28)
	struct TSoftObjectPtr<struct UForceFeedbackAttenuation> ForceFeedbackAttenuation; // 0x740(0x28)
	struct FGameplayTagContainer LifeDevourerAbilityTag; // 0x768(0x20)
	struct FGameplayTag LifeDevourerHealTag; // 0x788(0x08)
	struct UGameplayEffect* LifeDevourerBeam; // 0x790(0x08)
	struct UGameplayEffect* LifeDevourerHeal; // 0x798(0x08)
	struct UDamageType* DamageType; // 0x7a0(0x08)
	float DamageRate; // 0x7a8(0x04)
	float DamageAbsorbedMultiplier; // 0x7ac(0x04)
	struct UForceFeedbackComponent* ForceFeedbackSpawned; // 0x7b0(0x08)
	struct UMadAIAbilityTask_RotateTowardActor* RotateTask; // 0x7b8(0x08)
	struct UMadAIAbilityTask_ConeCheck* ConeCheckTask; // 0x7c0(0x08)
	char UnknownData_7C8[0x10]; // 0x7c8(0x10)

	void OnConeOverlapEnd(struct AActor* OtherActor); // Function Madness.MadAIAbility_Captain_LifeDevourer.OnConeOverlapEnd // (Final|Native|Private) // @ game+0x152b760
	void OnApplyDamage(); // Function Madness.MadAIAbility_Captain_LifeDevourer.OnApplyDamage // (Final|Native|Private) // @ game+0x152b5c0
};

// Class Madness.MadAIAbility_Captain_Mortar
// Size: 0x638 (Inherited: 0x518)
struct UMadAIAbility_Captain_Mortar : UMadAIGameplayAbility {
	struct FScalableFloat MinRangeScale; // 0x518(0x20)
	struct FScalableFloat MaxRangeScale; // 0x538(0x20)
	struct UGameplayEffect* ThrowEffectClass; // 0x558(0x08)
	struct UGameplayEffect* ExhaustionEffectClass; // 0x560(0x08)
	struct UAnimMontage* AttackMontage; // 0x568(0x08)
	float ArcFromCover; // 0x570(0x04)
	float ArcOutsideCover; // 0x574(0x04)
	enum class ECollisionChannel CollisionChannel; // 0x578(0x01)
	char UnknownData_579[0x3]; // 0x579(0x03)
	float MaxSimTime; // 0x57c(0x04)
	int32_t NumOfTraces; // 0x580(0x04)
	struct FName ThrowLeftNotifyName; // 0x584(0x08)
	struct FName ThrowRightNotifyName; // 0x58c(0x08)
	struct FName ThrowLeftSocketName; // 0x594(0x08)
	struct FName ThrowRightSocketName; // 0x59c(0x08)
	float MaxPredictionDistance; // 0x5a4(0x04)
	float MaxPredictionTime; // 0x5a8(0x04)
	float RandomRadius; // 0x5ac(0x04)
	struct AProjectile* ProjectileClass; // 0x5b0(0x08)
	struct UParticleSystem* Marker; // 0x5b8(0x08)
	struct FScalableFloat BaseDamageScale; // 0x5c0(0x20)
	struct FScalableFloat DamageRadiusScale; // 0x5e0(0x20)
	struct AMadBaseAICharacter* OwnerCharacter; // 0x600(0x08)
	struct AFWAIController* OwnerController; // 0x608(0x08)
	struct UAITask_PlayAnimation* PlayAnimationTask; // 0x610(0x08)
	struct AActor* CurrentTarget; // 0x618(0x08)
	char UnknownData_620[0x18]; // 0x620(0x18)

	void OnNotifyBegin(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbility_Captain_Mortar.OnNotifyBegin // (Final|Native|Protected) // @ game+0x152b9b0
	void OnAnimTaskEnded(struct UFWAITask* Task, enum class EFWAITaskResult Result); // Function Madness.MadAIAbility_Captain_Mortar.OnAnimTaskEnded // (Final|Native|Protected) // @ game+0x152b500
};

// Class Madness.MadAIAbility_Captain_PhaseShift
// Size: 0x5e0 (Inherited: 0x518)
struct UMadAIAbility_Captain_PhaseShift : UMadAIGameplayAbility {
	struct FScalableFloat TravelTimePer1000uu; // 0x518(0x20)
	struct FScalableFloat AttackActivationRange; // 0x538(0x20)
	struct FScalableFloat EscapeActivationRange; // 0x558(0x20)
	struct UEnvQuery* AttackQueryTemplate; // 0x578(0x08)
	struct UEnvQuery* EscapeQueryTemplate; // 0x580(0x08)
	struct AMadPhaseShiftWave* WaveActorClass; // 0x588(0x08)
	float LevelOfDangerActivationThreshold; // 0x590(0x04)
	float EscapeHealthThreshold; // 0x594(0x04)
	struct FPhaseShiftQueryParams AttackQueryParams; // 0x598(0x0c)
	struct FPhaseShiftQueryParams EscapeQueryParams; // 0x5a4(0x0c)
	struct AMadPhaseShiftWave* WaveActor; // 0x5b0(0x08)
	struct AMadBaseAICharacter* OwnerCharacter; // 0x5b8(0x08)
	struct AMadBaseAI* OwnerController; // 0x5c0(0x08)
	char UnknownData_5C8[0x18]; // 0x5c8(0x18)

	void OnTravelFinished(); // Function Madness.MadAIAbility_Captain_PhaseShift.OnTravelFinished // (Final|Native|Public) // @ game+0x152bf00
};

// Class Madness.MadAIAbility_Captain_Reinvigorate
// Size: 0x6b8 (Inherited: 0x698)
struct UMadAIAbility_Captain_Reinvigorate : UMadAIAbility_CastedBase {
	struct AMadReinvigorateAuraWave* ReinvigorateAuraWaveClass; // 0x698(0x08)
	int32_t MinValidTargetAllies; // 0x6a0(0x04)
	char UnknownData_6A4[0x4]; // 0x6a4(0x04)
	struct UMadGameplayEffect* CastingEffectClass; // 0x6a8(0x08)
	char UnknownData_6B0[0x8]; // 0x6b0(0x08)
};

// Class Madness.MadAIAbility_Captain_Vortex
// Size: 0x720 (Inherited: 0x698)
struct UMadAIAbility_Captain_Vortex : UMadAIAbility_CastedBase {
	struct UMadGameplayEffect* ActivationFailedCooldownEffect; // 0x698(0x08)
	struct AMadVortex* VortexActorClass; // 0x6a0(0x08)
	struct UEnvQuery* SpawnLocationQuery; // 0x6a8(0x08)
	struct UEnvQuery* TeleportLocationsQuery; // 0x6b0(0x08)
	enum class EEnvQueryRunMode TeleportLocationsQueryRunMode; // 0x6b8(0x01)
	char UnknownData_6B9[0x3]; // 0x6b9(0x03)
	struct FVector SpawnLocationOffset; // 0x6bc(0x0c)
	struct FVector TeleportLocationOffset; // 0x6c8(0x0c)
	char UnknownData_6D4[0x4c]; // 0x6d4(0x4c)
};

// Class Madness.MadAIAbility_Captain_WanderingFlames
// Size: 0x6d0 (Inherited: 0x698)
struct UMadAIAbility_Captain_WanderingFlames : UMadAIAbility_CastedBase {
	struct UEnvQuery* SpawnLocationsQueryTemplate; // 0x698(0x08)
	struct AMadWanderingFlame* WanderingFlameActorClass; // 0x6a0(0x08)
	struct UMadGameplayEffect* AbilityFailedCooldownEffect; // 0x6a8(0x08)
	struct FName SpawnFlameNotify; // 0x6b0(0x08)
	struct AMadWanderingFlame* FlameActor; // 0x6b8(0x08)
	char UnknownData_6C0[0x10]; // 0x6c0(0x10)
};

// Class Madness.MadAIAbility_Crawler_RotatingBeam_Base
// Size: 0x560 (Inherited: 0x518)
struct UMadAIAbility_Crawler_RotatingBeam_Base : UMadAIGameplayAbility {
	float PreRotateTowardTargetSpeed; // 0x518(0x04)
	float PreRotateTowardTargetAnglePrecision; // 0x51c(0x04)
	float FacingTargetCheckUpdateDelta; // 0x520(0x04)
	float TimeToStayFocusedOnTarget; // 0x524(0x04)
	float PreRotationMaxDuration; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct AMadCharAI* ActivatingPawn; // 0x530(0x08)
	struct UMadAIAbilityTask_RotateTowardActor* RotateTask; // 0x538(0x08)
	struct AActor* RotateTargetActor; // 0x540(0x08)
	char UnknownData_548[0x18]; // 0x548(0x18)

	void StartBeamAbility(); // Function Madness.MadAIAbility_Crawler_RotatingBeam_Base.StartBeamAbility // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void FacingTargetCheckUpdate(); // Function Madness.MadAIAbility_Crawler_RotatingBeam_Base.FacingTargetCheckUpdate // (Final|Native|Private) // @ game+0x152b3e0
	void CancelBeamAbility(); // Function Madness.MadAIAbility_Crawler_RotatingBeam_Base.CancelBeamAbility // (Final|Native|Private) // @ game+0x152b3c0
};

// Class Madness.MadAIAbility_Crawler_SweepingBeam
// Size: 0x618 (Inherited: 0x518)
struct UMadAIAbility_Crawler_SweepingBeam : UMadAIGameplayAbility {
	struct UAnimMontage* LeftTurnMontage; // 0x518(0x08)
	struct UAnimMontage* RightTurnMontage; // 0x520(0x08)
	struct AActor* BeamMarkerClass; // 0x528(0x08)
	struct AActor* BeamClass; // 0x530(0x08)
	struct FScalableFloat ScalableBeamDamage; // 0x538(0x20)
	float MinRangeToTarget; // 0x558(0x04)
	float BeamSize; // 0x55c(0x04)
	float UpdateBeamRate; // 0x560(0x04)
	float PitchModifier; // 0x564(0x04)
	float SweepSphereRadius; // 0x568(0x04)
	float FaceingTargetAccuracy; // 0x56c(0x04)
	enum class ECollisionChannel TraceChannel; // 0x570(0x01)
	char UnknownData_571[0x3]; // 0x571(0x03)
	struct FName StartBeamSocket; // 0x574(0x08)
	char UnknownData_57C[0x4]; // 0x57c(0x04)
	struct UMadDamageType* BeamDamageClass; // 0x580(0x08)
	struct FName BeamDimensionParamName; // 0x588(0x08)
	struct FGameplayTagContainer TagsToRemoveOnHit; // 0x590(0x20)
	char UnknownData_5B0[0x28]; // 0x5b0(0x28)
	struct AMadCharAI_Crawler* OwnerCrawler; // 0x5d8(0x08)
	struct AActor* BeamActor; // 0x5e0(0x08)
	struct AActor* MarkerActor; // 0x5e8(0x08)
	struct AActor* LastHitActor; // 0x5f0(0x08)
	struct TArray<struct AActor*> CharactersHit; // 0x5f8(0x10)
	struct TArray<struct UParticleSystemComponent*> CachedBeamParticles; // 0x608(0x10)

	void OnOwnerKilled(struct ABaseCharacter* character, struct FTakeHitInfo TakeHitInfo); // Function Madness.MadAIAbility_Crawler_SweepingBeam.OnOwnerKilled // (Final|Native|Private) // @ game+0x152bbb0
	void OnBeamOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Madness.MadAIAbility_Crawler_SweepingBeam.OnBeamOverlap // (Final|Native|Private) // @ game+0x152b5e0
	void OnAnimNotify(struct FName InNotifyName); // Function Madness.MadAIAbility_Crawler_SweepingBeam.OnAnimNotify // (Final|Native|Private) // @ game+0x152b480
	void OnAnimEnd(struct FName InNotifyName); // Function Madness.MadAIAbility_Crawler_SweepingBeam.OnAnimEnd // (Final|Native|Private) // @ game+0x152b400
};

// Class Madness.MadAIAbility_Crawler_TurnToFace
// Size: 0x578 (Inherited: 0x518)
struct UMadAIAbility_Crawler_TurnToFace : UMadAIGameplayAbility {
	float TargetBehindMaxConeAngle; // 0x518(0x04)
	char UnknownData_51C[0x4]; // 0x51c(0x04)
	struct UNavigationQueryFilter* SpaceSearchQueryFilterClass; // 0x520(0x08)
	struct FMontageAssetSelector LeftTurnMontage; // 0x528(0x20)
	struct FMontageAssetSelector RightTurnMontage; // 0x548(0x20)
	struct AMadCharAI_Crawler* OwnerCharacter; // 0x568(0x08)
	struct AMadAI_Crawler* OwnerController; // 0x570(0x08)

	void OnAnimationTaskFinished(struct FName NotifyName); // Function Madness.MadAIAbility_Crawler_TurnToFace.OnAnimationTaskFinished // (Final|Native|Private) // @ game+0x152e180
};

// Class Madness.MadAIAbility_ForestBerserker_AerialStrike
// Size: 0x540 (Inherited: 0x518)
struct UMadAIAbility_ForestBerserker_AerialStrike : UMadAIGameplayAbility {
	struct UAnimMontage* AerialStrikeMontage; // 0x518(0x08)
	float MinDistanceToActivate; // 0x520(0x04)
	float MaxDistanceToActivate; // 0x524(0x04)
	float AbilityActivationMaxAngle; // 0x528(0x04)
	float MaxAngleBetweenTargetAndOffmeshLink; // 0x52c(0x04)
	float MaxTargetDistFromOffmeshLink; // 0x530(0x04)
	char UnknownData_534[0xc]; // 0x534(0x0c)

	void OnNotifyBegin(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBerserker_AerialStrike.OnNotifyBegin // (Final|Native|Private) // @ game+0x152e7c0
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBerserker_AerialStrike.OnMontageComplete // (Final|Native|Private) // @ game+0x1526d80
	void OnMontageCancelled(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBerserker_AerialStrike.OnMontageCancelled // (Final|Native|Private) // @ game+0x1526d80
};

// Class Madness.MadAIAbility_ForestBoss_Growl
// Size: 0x5f8 (Inherited: 0x518)
struct UMadAIAbility_ForestBoss_Growl : UMadAIGameplayAbility {
	struct FMulticastInlineDelegate OnComplete; // 0x518(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x528(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x538(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x548(0x10)
	char UnknownData_558[0x28]; // 0x558(0x28)
	int32_t RockEvent; // 0x580(0x04)
	char UnknownData_584[0x4]; // 0x584(0x04)
	struct UAnimMontage* MontageToPlay; // 0x588(0x08)
	char UnknownData_590_0 : 7; // 0x590(0x01)
	bool bIsFinalStage : 1; // 0x590(0x01)
	char UnknownData_591[0x3]; // 0x591(0x03)
	float ProximityDamageRange; // 0x594(0x04)
	float ProximityDamageAngle; // 0x598(0x04)
	char UnknownData_59C[0x4]; // 0x59c(0x04)
	struct UMadDamageType* DamageType; // 0x5a0(0x08)
	struct UCurveTable* DamageCurveTable; // 0x5a8(0x08)
	float DamageInterval; // 0x5b0(0x04)
	float PlayerCheckInterval; // 0x5b4(0x04)
	float CoverDamageInterval; // 0x5b8(0x04)
	float CoverDamageAngle; // 0x5bc(0x04)
	int32_t GrowlLocationIndex; // 0x5c0(0x04)
	float HeightPercentToCheckLOS; // 0x5c4(0x04)
	struct AActor* GrowlMarkerClass; // 0x5c8(0x08)
	struct FName GrowlMarkerBone; // 0x5d0(0x08)
	float GrowlMarkerDownDistance; // 0x5d8(0x04)
	char UnknownData_5DC[0x4]; // 0x5dc(0x04)
	struct AMadCharAI_ForestBoss* OwnerActor; // 0x5e0(0x08)
	struct AActor* GrowlAttackMarker; // 0x5e8(0x08)
	char UnknownData_5F0[0x8]; // 0x5f0(0x08)

	void UpdateGrowlTrace(); // Function Madness.MadAIAbility_ForestBoss_Growl.UpdateGrowlTrace // (Final|Native|Public) // @ game+0x152ef60
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBoss_Growl.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x152e840
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBoss_Growl.OnInterruptedHandler // (Final|Native|Public) // @ game+0x152e640
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBoss_Growl.OnCompleteHandler // (Final|Native|Public) // @ game+0x152e400
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_ForestBoss_Growl.OnCancelledHandler // (Final|Native|Public) // @ game+0x152e200
	void GrowlStarted(); // Function Madness.MadAIAbility_ForestBoss_Growl.GrowlStarted // (Final|Native|Public) // @ game+0x152e160
	void GrowlEnded(); // Function Madness.MadAIAbility_ForestBoss_Growl.GrowlEnded // (Final|Native|Public) // @ game+0x152e140
	void GrowlDamage(); // Function Madness.MadAIAbility_ForestBoss_Growl.GrowlDamage // (Final|Native|Public) // @ game+0x152e120
	void FinishAbility(); // Function Madness.MadAIAbility_ForestBoss_Growl.FinishAbility // (Final|Native|Public|BlueprintCallable) // @ game+0x152e0c0
	void CheckPlayersInCone(); // Function Madness.MadAIAbility_ForestBoss_Growl.CheckPlayersInCone // (Final|Native|Public) // @ game+0x152e060
	void CheckCovers(); // Function Madness.MadAIAbility_ForestBoss_Growl.CheckCovers // (Final|Native|Public) // @ game+0x152e040
	bool AreTargetsTooClose(struct AFWAIController* OwnerAIController, struct FVector Origin, float Radius); // Function Madness.MadAIAbility_ForestBoss_Growl.AreTargetsTooClose // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x152df20
};

// Class Madness.MadAIAbility_ForestBoss_Punch
// Size: 0x558 (Inherited: 0x518)
struct UMadAIAbility_ForestBoss_Punch : UMadAIGameplayAbility {
	struct UMadDamageType* DamageType; // 0x518(0x08)
	struct FScalableFloat DamageValueScaled; // 0x520(0x20)
	struct TArray<struct FName> DamageBones; // 0x540(0x10)
	float PunchRadiusFromBone; // 0x550(0x04)
	float MarkerAreaRadius; // 0x554(0x04)

	void SmashDown(int32_t Count, int32_t MarkerIdx); // Function Madness.MadAIAbility_ForestBoss_Punch.SmashDown // (Final|Native|Protected|BlueprintCallable) // @ game+0x152edb0
};

// Class Madness.MadAiAbility_Guardian_BallLight
// Size: 0x5b8 (Inherited: 0x518)
struct UMadAiAbility_Guardian_BallLight : UMadAIGameplayAbility {
	struct AMadCharAI* Caster; // 0x518(0x08)
	struct UAnimMontage* CastingMontage; // 0x520(0x08)
	struct UAnimMontage* ChannelShield; // 0x528(0x08)
	float AbilityCastingTime; // 0x530(0x04)
	float RotateToTargetDuration; // 0x534(0x04)
	struct UGameplayEffect* PostAbilityEffectClass; // 0x538(0x08)
	struct UGameplayEffect* LightningBallEffectClass; // 0x540(0x08)
	float MaxDistanceToEnemy; // 0x548(0x04)
	char UnknownData_54C[0x4]; // 0x54c(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x550(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x560(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x570(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x580(0x10)
	struct UMadAbilityTask_CurrentMontageChangeSection* ChangeMontageSectionTask; // 0x590(0x08)
	char UnknownData_598[0x20]; // 0x598(0x20)

	void SpawnElectroBall(struct FVector SpawnTransformLocation, bool isPositive); // Function Madness.MadAiAbility_Guardian_BallLight.SpawnElectroBall // (Event|Protected|HasDefaults|BlueprintEvent) // @ game+0x1a35c70
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_BallLight.OnNotifyBeginHandler // (Final|Native|Private) // @ game+0x152e8c0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_BallLight.OnInterruptedHandler // (Final|Native|Private) // @ game+0x152e6c0
	void OnInterruptChangeSectionSuccessful(); // Function Madness.MadAiAbility_Guardian_BallLight.OnInterruptChangeSectionSuccessful // (Final|Native|Private) // @ game+0x152e5e0
	void OnInterruptChangeSectionFailed(); // Function Madness.MadAiAbility_Guardian_BallLight.OnInterruptChangeSectionFailed // (Final|Native|Private) // @ game+0x152e580
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_BallLight.OnCompleteHandler // (Final|Native|Private) // @ game+0x152e480
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_BallLight.OnCancelledHandler // (Final|Native|Private) // @ game+0x152e280
};

// Class Madness.MadAIAbility_Guardian_Blink
// Size: 0x598 (Inherited: 0x598)
struct UMadAIAbility_Guardian_Blink : UMadAIAbility_Altered_Blink {
};

// Class Madness.MadAiAbility_Guardian_LightBlank
// Size: 0x5d8 (Inherited: 0x518)
struct UMadAiAbility_Guardian_LightBlank : UMadAIGameplayAbility {
	struct AMadCharAI* Caster; // 0x518(0x08)
	struct AMadBlanket* BlanketClass; // 0x520(0x08)
	struct FScalableFloat LightningBlanketDurationScalable; // 0x528(0x20)
	struct FScalableFloat LightningBlanketDamageOverTimeScalable; // 0x548(0x20)
	float LightningBlanketDuration; // 0x568(0x04)
	int32_t MaxBlanketsToSpawn; // 0x56c(0x04)
	float DelayBetweenSpawns; // 0x570(0x04)
	char UnknownData_574[0x4]; // 0x574(0x04)
	struct UEnvQuery* SpawnAtTargetQuery; // 0x578(0x08)
	struct AActor* CurrentTarget; // 0x580(0x08)
	char UnknownData_588[0x50]; // 0x588(0x50)

	void SpawnBlankets(struct TArray<struct FVector> BlanketLocations); // Function Madness.MadAiAbility_Guardian_LightBlank.SpawnBlankets // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x152ee90
};

// Class Madness.MadAiAbility_Guardian_Mine
// Size: 0x628 (Inherited: 0x518)
struct UMadAiAbility_Guardian_Mine : UMadAIGameplayAbility {
	struct AMadCharAI* Caster; // 0x518(0x08)
	struct UAnimMontage* CastingMontage; // 0x520(0x08)
	float AbilityCastingTime; // 0x528(0x04)
	float DistanceToEnemy; // 0x52c(0x04)
	float LevelOfDangerMin; // 0x530(0x04)
	float LevelOfDangerMax; // 0x534(0x04)
	char UnknownData_538_0 : 7; // 0x538(0x01)
	bool bTargetOnlyCharactersInCover : 1; // 0x538(0x01)
	char UnknownData_539[0x7]; // 0x539(0x07)
	struct FTimerHandle CastHandle; // 0x540(0x08)
	char UnknownData_548_0 : 7; // 0x548(0x01)
	bool bIsCompleted : 1; // 0x548(0x01)
	char UnknownData_549[0x7]; // 0x549(0x07)
	struct TArray<struct AActor*> AllTargets; // 0x550(0x10)
	struct TArray<struct AActor*> ValidTargets; // 0x560(0x10)
	float RotateToTargetDuration; // 0x570(0x04)
	float TrailTravelTime; // 0x574(0x04)
	struct FScalableFloat MineDurationScalable; // 0x578(0x20)
	struct FScalableFloat MineDamageOverTimeScalable; // 0x598(0x20)
	struct FScalableFloat MineDamageOverTimeIntervalScalable; // 0x5b8(0x20)
	struct ADischargeTrail* DischargeTrailBPClass; // 0x5d8(0x08)
	struct ADischargeMine* DischargeMineBPClass; // 0x5e0(0x08)
	struct UEnvQuery* MineSpawnActorsQuery; // 0x5e8(0x08)
	struct FVector MineSpawnLocationFromActorOffset; // 0x5f0(0x0c)
	char UnknownData_5FC[0x2c]; // 0x5fc(0x2c)

	void SpawnActors(); // Function Madness.MadAiAbility_Guardian_Mine.SpawnActors // (Final|Native|Protected|BlueprintCallable) // @ game+0x152ee70
	bool ShowCastBar(float CastTime, bool bIsChanneling); // Function Madness.MadAiAbility_Guardian_Mine.ShowCastBar // (Final|Native|Protected|BlueprintCallable) // @ game+0x152ece0
	void SetCastEffects(bool bTurnOn); // Function Madness.MadAiAbility_Guardian_Mine.SetCastEffects // (Final|Native|Protected|BlueprintCallable) // @ game+0x152eb60
	void RotateTowardTargetPlayer(); // Function Madness.MadAiAbility_Guardian_Mine.RotateTowardTargetPlayer // (Final|Native|Protected|BlueprintCallable) // @ game+0x152eb40
};

// Class Madness.MadAiAbility_Guardian_Shield
// Size: 0x6a0 (Inherited: 0x518)
struct UMadAiAbility_Guardian_Shield : UMadAIGameplayAbility {
	struct AActor* Target; // 0x518(0x08)
	struct AMadCharAI* Caster; // 0x520(0x08)
	struct UAnimMontage* CastingMontage; // 0x528(0x08)
	float AbilityCastingTime; // 0x530(0x04)
	float LevelOfDangerMin; // 0x534(0x04)
	float UseAbilityAtHealthThreshold; // 0x538(0x04)
	char UnknownData_53C[0x4]; // 0x53c(0x04)
	struct FScalableFloat ChannelDurationScalable; // 0x540(0x20)
	struct FScalableFloat ShieldDurabilityScalable; // 0x560(0x20)
	struct FScalableFloat ShieldDurabilityCoopMulScalable; // 0x580(0x20)
	struct FScalableFloat ShieldDotDamageScalable; // 0x5a0(0x20)
	struct FScalableFloat ShrapnelDamageScalable; // 0x5c0(0x20)
	struct AScrapShield* ShieldBPClass; // 0x5e0(0x08)
	struct UGameplayEffect* ScrapShieldEffectClass; // 0x5e8(0x08)
	struct UGameplayEffect* ScrapShieldCooldownClass; // 0x5f0(0x08)
	struct FGameplayTag DataTag; // 0x5f8(0x08)
	struct UEnvQuery* AreaValidationQuery; // 0x600(0x08)
	int32_t MinRequiredValidAreaPoints; // 0x608(0x04)
	char UnknownData_60C[0x4]; // 0x60c(0x04)
	struct TArray<struct UDamageType*> KnockbackDamageTypesCancellingBlockingReactions; // 0x610(0x10)
	struct UGameplayEffect* BlockingReactionEffectClass; // 0x620(0x08)
	struct FMulticastInlineDelegate OnShieldInterrupted; // 0x628(0x10)
	struct FMulticastInlineDelegate OnShieldReleased; // 0x638(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x648(0x10)
	struct UMadAbilityTask_CurrentMontageChangeSection* ChangeMontageSectionTask; // 0x658(0x08)
	char UnknownData_660[0x40]; // 0x660(0x40)

	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Shield.OnNotifyBeginHandler // (Final|Native|Protected) // @ game+0x152e9c0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Shield.OnInterruptedHandler // (Final|Native|Protected) // @ game+0x152e380
	void OnInterruptChangeSectionSuccessful(); // Function Madness.MadAiAbility_Guardian_Shield.OnInterruptChangeSectionSuccessful // (Final|Native|Private) // @ game+0x152e620
	void OnInterruptChangeSectionFailed(); // Function Madness.MadAiAbility_Guardian_Shield.OnInterruptChangeSectionFailed // (Final|Native|Private) // @ game+0x152e5c0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Shield.OnCompleteHandler // (Final|Native|Protected) // @ game+0x152e180
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAiAbility_Guardian_Shield.OnCancelledHandler // (Final|Native|Protected) // @ game+0x152e380
	void ExplodeShields(); // Function Madness.MadAiAbility_Guardian_Shield.ExplodeShields // (Final|Native|Protected) // @ game+0x152e0a0
};

// Class Madness.MadAiAbility_Guardian_Shock
// Size: 0x518 (Inherited: 0x518)
struct UMadAiAbility_Guardian_Shock : UMadAIGameplayAbility {
};

// Class Madness.MadAIAbility_Lurker_Charge
// Size: 0x658 (Inherited: 0x518)
struct UMadAIAbility_Lurker_Charge : UMadAIGameplayAbility {
	float MinRunInPlaceMoveDistance; // 0x518(0x04)
	char UnknownData_51C[0x134]; // 0x51c(0x134)
	struct AMadCharAI* OwningPawn; // 0x650(0x08)

	void OnTargetPassed(); // Function Madness.MadAIAbility_Lurker_Charge.OnTargetPassed // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void OnTargetHitAnObtacle(); // Function Madness.MadAIAbility_Lurker_Charge.OnTargetHitAnObtacle // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	bool IsDirectHit(struct FVector ImpactHitLocation, struct AActor* AbilityOwner); // Function Madness.MadAIAbility_Lurker_Charge.IsDirectHit // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532e80
	bool IsCurrentTargetUnderAttack(struct Acharacter* SelfCharacter, struct AActor* TargetCharacter); // Function Madness.MadAIAbility_Lurker_Charge.IsCurrentTargetUnderAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532dc0
	void EnableSpreadOutLogic(bool bEnabled); // Function Madness.MadAIAbility_Lurker_Charge.EnableSpreadOutLogic // (Final|Native|Public|BlueprintCallable) // @ game+0x15326e0
	void EnableIndirectHitTest(bool bEnableTest); // Function Madness.MadAIAbility_Lurker_Charge.EnableIndirectHitTest // (Final|Native|Public|BlueprintCallable) // @ game+0x1532660
	bool CanTraceReachTarget(struct Acharacter* SelfCharacter, struct AActor* TargetCharacter, float CapsuleRadiusMultiplier, float CapsuleHalfHeightMultiplier); // Function Madness.MadAIAbility_Lurker_Charge.CanTraceReachTarget // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532230
	bool CanStartChargeAttack(struct Acharacter* SelfCharacter, struct AActor* TargetCharacter, float MinDistanceToTarget, float MaxDistanceToTarget, float MinDotToTarget, float CapsuleRadiusMultiplier, float CapsuleHalfHeightMultiplier); // Function Madness.MadAIAbility_Lurker_Charge.CanStartChargeAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532030
	bool CanActivateDistanceAttack(struct AActor* SourceActor, struct AActor* TargetActor, float MinDistanceToTarget, float MaxDistanceToTarget, float MinDotToTarget); // Function Madness.MadAIAbility_Lurker_Charge.CanActivateDistanceAttack // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1531ea0
	void BroadcastStunStateToSquadMembers(struct Acharacter* SelfCharacter); // Function Madness.MadAIAbility_Lurker_Charge.BroadcastStunStateToSquadMembers // (Final|Native|Public|BlueprintCallable|Const) // @ game+0x1531e20
};

// Class Madness.MadAIAbility_Lurker_Stomp
// Size: 0x518 (Inherited: 0x518)
struct UMadAIAbility_Lurker_Stomp : UMadAIGameplayAbility {

	bool IsTargetLocationReachable(struct AActor* TargetActor, float ExtraDistance, float DistanceMultiplier, struct UNavigationQueryFilter* FilterClass); // Function Madness.MadAIAbility_Lurker_Stomp.IsTargetLocationReachable // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532f60
	bool AreHostileActorsInRange(struct AFWAIController* OwnerAIController, struct FVector Origin, int32_t MinNumberOfHostiles, float Radius); // Function Madness.MadAIAbility_Lurker_Stomp.AreHostileActorsInRange // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1531cb0
	bool AreAnyTeammatesAlive(struct AFWAIController* OwnerAIConrtoller); // Function Madness.MadAIAbility_Lurker_Stomp.AreAnyTeammatesAlive // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1531c20
};

// Class Madness.MadAIAbility_OasisShaman_Healing
// Size: 0x518 (Inherited: 0x518)
struct UMadAIAbility_OasisShaman_Healing : UMadAIGameplayAbility {

	bool IsWoundedMemberFromSquadInRange(struct AFWAIController* MemberToExclude, struct FVector Origin, float Radius, float LastSeenTimeout); // Function Madness.MadAIAbility_OasisShaman_Healing.IsWoundedMemberFromSquadInRange // (Final|Native|Public|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1533150
	void GetWoundedMemberFromSquadInRange(struct AFWAIController* MemberToExclude, struct FVector Origin, float Radius, float LastSeenTimeout, struct AController* OutController); // Function Madness.MadAIAbility_OasisShaman_Healing.GetWoundedMemberFromSquadInRange // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532c00
};

// Class Madness.MadAIAbility_Perforo_PoisonousMist
// Size: 0x588 (Inherited: 0x518)
struct UMadAIAbility_Perforo_PoisonousMist : UMadAIGameplayAbility {
	struct UMadDataAsset_ThrowSequentialProjectilesVariants* ThrowAnimVariants; // 0x518(0x08)
	struct TArray<struct FMontageAssetSelector> DodgeAnimations; // 0x520(0x10)
	struct UFWAISemaphoreGroupClass* StartSemaphore; // 0x530(0x08)
	struct UFWAISemaphoreGroupClass* PerTargetSemaphore; // 0x538(0x08)
	struct UFWAISemaphoreGroupClass* HeavySemaphore; // 0x540(0x08)
	float StartSemaphoreUnlockDelay; // 0x548(0x04)
	float PerTargetSemaphoreUnlockDelay; // 0x54c(0x04)
	float HeavySemaphoreUnlockDelay; // 0x550(0x04)
	char UnknownData_554[0x4]; // 0x554(0x04)
	struct AMadCharAI* AbilityOwner; // 0x558(0x08)
	struct AActor* TargetActor; // 0x560(0x08)
	struct UMadAIAbilityTask_ThrowSequentialProjectiles* Task; // 0x568(0x08)
	struct UAnimMontage* PlayingMontage; // 0x570(0x08)
	float TestsInterval; // 0x578(0x04)
	char UnknownData_57C[0xc]; // 0x57c(0x0c)

	void OnInterrupted(); // Function Madness.MadAIAbility_Perforo_PoisonousMist.OnInterrupted // (Final|Native|Private) // @ game+0x1533770
	void OnDodgeMontageEnded(struct UAnimMontage* Montage, bool bInterupted); // Function Madness.MadAIAbility_Perforo_PoisonousMist.OnDodgeMontageEnded // (Final|Native|Private) // @ game+0x1533520
	void OnComplete(); // Function Madness.MadAIAbility_Perforo_PoisonousMist.OnComplete // (Final|Native|Private) // @ game+0x1533480
	void OnCancelled(); // Function Madness.MadAIAbility_Perforo_PoisonousMist.OnCancelled // (Final|Native|Private) // @ game+0x15333e0
};

// Class Madness.MadAIAbility_PerforoAlpha_BroodCalling
// Size: 0x5b0 (Inherited: 0x5a8)
struct UMadAIAbility_PerforoAlpha_BroodCalling : UMadAIAbility_CallForBackup {
	struct UFWAIArchetype* MinionArchetype; // 0x5a8(0x08)
};

// Class Madness.MadAIAbility_Sciathan_FlyByTarget
// Size: 0x688 (Inherited: 0x518)
struct UMadAIAbility_Sciathan_FlyByTarget : UMadAIGameplayAbility {
	float MinDistForActivate; // 0x518(0x04)
	float MaxDistForActivate; // 0x51c(0x04)
	float TimeBetweenBreakOutChecks; // 0x520(0x04)
	float TimeBetweenBreakOutChecksIfShot; // 0x524(0x04)
	float TimeAfterSpawnToStartCheckingForBreak; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct UEnvQuery* ShotWhenFlyingEQSTemplate; // 0x530(0x08)
	char UnknownData_538[0x120]; // 0x538(0x120)
	char UnknownData_658_0 : 7; // 0x658(0x01)
	bool bHasBeenActivated : 1; // 0x658(0x01)
	char UnknownData_659[0x3]; // 0x659(0x03)
	float TimeForNextCheck; // 0x65c(0x04)
	float StartCheckingTime; // 0x660(0x04)
	char UnknownData_664[0x24]; // 0x664(0x24)

	void OnFlyByTaskFinished(struct UMadAIAbilityTask* Task, enum class EFWAITaskResult Result); // Function Madness.MadAIAbility_Sciathan_FlyByTarget.OnFlyByTaskFinished // (Final|Native|Protected) // @ game+0x15336b0
};

// Class Madness.MadAIAbility_ShotReactionBase
// Size: 0x528 (Inherited: 0x518)
struct UMadAIAbility_ShotReactionBase : UMadAIGameplayAbility {
	char UnknownData_518[0x10]; // 0x518(0x10)

	void RestoreMovementModeAndEndAbility(struct FName NotifyName); // Function Madness.MadAIAbility_ShotReactionBase.RestoreMovementModeAndEndAbility // (Final|Native|Public) // @ game+0x1533810
};

// Class Madness.MadAIAbility_Sniper_CallForBackup
// Size: 0x5d8 (Inherited: 0x5a8)
struct UMadAIAbility_Sniper_CallForBackup : UMadAIAbility_CallForBackup {
	float MinDistanceToEnemies; // 0x5a8(0x04)
	char UnknownData_5AC_0 : 7; // 0x5ac(0x01)
	bool bTestOnlyMainTarget : 1; // 0x5ac(0x01)
	char UnknownData_5AD[0x3]; // 0x5ad(0x03)
	struct FScalableFloat CallChargesScale; // 0x5b0(0x20)
	char UnknownData_5D0[0x8]; // 0x5d0(0x08)
};

// Class Madness.MadAIAbility_ThrowSmokeGrenade
// Size: 0x528 (Inherited: 0x518)
struct UMadAIAbility_ThrowSmokeGrenade : UMadAIGameplayAbility {
	struct FVector ThrowLocation; // 0x518(0x0c)
	char UnknownData_524[0x4]; // 0x524(0x04)

	bool GetBestThrowLocation(float RandomRadius, float MinDistance, float MaxDistance, float Offset, float PredictDistance, float PredictDuration, float MaxAngleOutOfCover, float MaxAngleInCover); // Function Madness.MadAIAbility_ThrowSmokeGrenade.GetBestThrowLocation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1532990
};

// Class Madness.MadAIAbility_TurnToAshes
// Size: 0x558 (Inherited: 0x518)
struct UMadAIAbility_TurnToAshes : UMadAIGameplayAbility {
	struct UMadGameplayEffect* EffectWhileHidden; // 0x518(0x08)
	float TimeInAshes; // 0x520(0x04)
	float HealthPercentageAfterRessurection; // 0x524(0x04)
	struct AMadBaseAICharacter* OwnerCharacter; // 0x528(0x08)
	struct AMadAI* OwnerController; // 0x530(0x08)
	struct FTimerHandle TimerHandle; // 0x538(0x08)
	struct AActor* LethalDamageInstigator; // 0x540(0x08)
	char UnknownData_548[0x10]; // 0x548(0x10)

	void OnFakeDeath(struct AActor* DamageCauser, struct UDamageType* DamageTypeClass); // Function Madness.MadAIAbility_TurnToAshes.OnFakeDeath // (Final|Native|Protected) // @ game+0x15335f0
};

// Class Madness.MadAIAbility_VolcanoBoss_ChargeEnd
// Size: 0x5a8 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_ChargeEnd : UMadAIGameplayAbility {
	struct UAnimMontage* MontageToPlay; // 0x518(0x08)
	struct AProjectile* VolcanoProjectile; // 0x520(0x08)
	struct FName ProjectileSocketName; // 0x528(0x08)
	float ProjectileArc; // 0x530(0x04)
	int32_t AttacksToRepeatMin; // 0x534(0x04)
	int32_t AttacksToRepeatMax; // 0x538(0x04)
	float RandomLocationValidDotThreshold; // 0x53c(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x540(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x550(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x560(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x570(0x10)
	struct TArray<struct ABasePlayerController*> AllPlayers; // 0x580(0x10)
	char UnknownData_590[0x18]; // 0x590(0x18)

	void WallLocationReached(); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.WallLocationReached // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void StartClimb(); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.StartClimb // (Final|Native|Protected|BlueprintCallable) // @ game+0x15339a0
	void SetArenaTargetLocations(struct TArray<struct FVector> Locations); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.SetArenaTargetLocations // (Final|Native|Protected|BlueprintCallable) // @ game+0x1533890
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.OnNotifyBeginHandler // (Final|Native|Private) // @ game+0x1533790
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.OnInterruptedHandler // (Final|Native|Private) // @ game+0x152e480
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.OnCompleteHandler // (Final|Native|Private) // @ game+0x15334a0
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.OnCancelledHandler // (Final|Native|Private) // @ game+0x1533400
	void Land(); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.Land // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void JumpDown(); // Function Madness.MadAIAbility_VolcanoBoss_ChargeEnd.JumpDown // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
};

// Class Madness.MadAIAbility_VolcanoBoss_ChargeStart
// Size: 0x530 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_ChargeStart : UMadAIGameplayAbility {
	char UnknownData_518_0 : 7; // 0x518(0x01)
	bool bChargeStartSuccessful : 1; // 0x518(0x01)
	char UnknownData_519[0x3]; // 0x519(0x03)
	float VerticalChargeOffset; // 0x51c(0x04)
	float FinalLocationHeightOffset; // 0x520(0x04)
	float MaxChargeDistance; // 0x524(0x04)
	float WallDistance; // 0x528(0x04)
	float MaxAngleDotOffset; // 0x52c(0x04)

	bool FindAndSetChargeLocation(); // Function Madness.MadAIAbility_VolcanoBoss_ChargeStart.FindAndSetChargeLocation // (Final|Native|Protected|BlueprintCallable) // @ game+0x1532770
};

// Class Madness.MadAIAbility_VolcanoBoss_DiveAttack
// Size: 0x528 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_DiveAttack : UMadAIGameplayAbility {
	float ClawDamageAmount; // 0x518(0x04)
	float ClawDamageZOffset; // 0x51c(0x04)
	struct UBaseDamageType* ClawDamageType; // 0x520(0x08)

	void LegStrikeDamage(struct FName SocketName, float BaseDamage, float DamageRadius); // Function Madness.MadAIAbility_VolcanoBoss_DiveAttack.LegStrikeDamage // (Final|Native|Protected|BlueprintCallable) // @ game+0x15332e0
	void ClawTraceAndDamage(struct FName StartBone, struct FName EndBone); // Function Madness.MadAIAbility_VolcanoBoss_DiveAttack.ClawTraceAndDamage // (Final|Native|Protected|BlueprintCallable) // @ game+0x1532380
};

// Class Madness.MadAIAbility_VolcanoBoss_JumpWall
// Size: 0x578 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_JumpWall : UMadAIGameplayAbility {
	struct AProjectile* VolcanoProjectile; // 0x518(0x08)
	struct FName ProjectileSocketName; // 0x520(0x08)
	int32_t NumberOfTargetedProjectilesThrew; // 0x528(0x04)
	char UnknownData_52C[0x4]; // 0x52c(0x04)
	struct TArray<struct AActor*> AllPlayers; // 0x530(0x10)
	struct FTrajectoryCorrectionData TrajectoryCorrectionData; // 0x540(0x30)
	char UnknownData_570[0x8]; // 0x570(0x08)

	void TryToCalculateTrajectoryCorrectionBounds(struct TArray<struct FVector> Locations, struct FVector CenterPointOfArena); // Function Madness.MadAIAbility_VolcanoBoss_JumpWall.TryToCalculateTrajectoryCorrectionBounds // (Final|Native|Protected|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x15339c0
	void LaunchProjectile(); // Function Madness.MadAIAbility_VolcanoBoss_JumpWall.LaunchProjectile // (Final|Native|Protected|BlueprintCallable) // @ game+0x15332c0
};

// Class Madness.MadAIAbility_VolcanoBoss_Melee
// Size: 0x528 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_Melee : UMadAIGameplayAbility {
	struct UDamageType* DamageType; // 0x518(0x08)
	float ClawDamage; // 0x520(0x04)
	float ClawRadius; // 0x524(0x04)

	void ClawTraceAndDamage(struct FName StartBone, struct FName EndBone, struct TArray<struct AActor*> IgnoreActors, struct AActor* OutDamagedActor); // Function Madness.MadAIAbility_VolcanoBoss_Melee.ClawTraceAndDamage // (Final|Native|Protected|HasOutParms|BlueprintCallable) // @ game+0x1532440
};

// Class Madness.MadAIAbility_VolcanoBoss_Swing
// Size: 0x518 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_Swing : UMadAIGameplayAbility {

	float DotToActor(struct AActor* Target); // Function Madness.MadAIAbility_VolcanoBoss_Swing.DotToActor // (Final|Native|Protected|BlueprintCallable) // @ game+0x15325c0
};

// Class Madness.MadAIAbility_VolcanoBoss_ThrowProjectile
// Size: 0x548 (Inherited: 0x518)
struct UMadAIAbility_VolcanoBoss_ThrowProjectile : UMadAIGameplayAbility {
	float YawOffset; // 0x518(0x04)
	float PitchOffset; // 0x51c(0x04)
	float MinimumSpeed; // 0x520(0x04)
	float MaximumSpeed; // 0x524(0x04)
	struct AProjectile* VolcanoProjectile; // 0x528(0x08)
	struct FName SourceSocket; // 0x530(0x08)
	struct AMadCharAI* Owner; // 0x538(0x08)
	char UnknownData_540[0x8]; // 0x540(0x08)

	void SpawnVolcanoProjectile(); // Function Madness.MadAIAbility_VolcanoBoss_ThrowProjectile.SpawnVolcanoProjectile // (Final|Native|Protected|BlueprintCallable) // @ game+0x1533980
};

// Class Madness.MadAIAbility_Yagak_AnomalyRifts
// Size: 0x6f0 (Inherited: 0x698)
struct UMadAIAbility_Yagak_AnomalyRifts : UMadAIAbility_CastedBase {
	struct UExplosionTemplate* ShieldSpawnExplosionTemplate; // 0x698(0x08)
	struct UMadGameplayEffect* FailedActivationCooldownEffect; // 0x6a0(0x08)
	struct UEnvQuery* RiftQuery; // 0x6a8(0x08)
	struct AActor* TurretClass; // 0x6b0(0x08)
	int32_t DesiredTurretsPerPlayer; // 0x6b8(0x04)
	float TurretSpawnInterval; // 0x6bc(0x04)
	struct FTimerHandle TurretSpawnTimerHandle; // 0x6c0(0x08)
	struct TArray<struct ABaseCharacter*> Targets; // 0x6c8(0x10)
	char UnknownData_6D8[0x18]; // 0x6d8(0x18)

	void SpawnTurret(); // Function Madness.MadAIAbility_Yagak_AnomalyRifts.SpawnTurret // (Final|Native|Protected) // @ game+0x15379a0
};

// Class Madness.MadAIAbility_Yagak_Barrier
// Size: 0x588 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Barrier : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	struct UAnimMontage* MontageToPlay; // 0x520(0x08)
	struct AYagakShield* ShieldBPClass; // 0x528(0x08)
	struct AYagakShield* Shield; // 0x530(0x08)
	float CastTime; // 0x538(0x04)
	float BarrierZOffset; // 0x53c(0x04)
	float BarrierDuration; // 0x540(0x04)
	char UnknownData_544[0x4]; // 0x544(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x548(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x558(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x568(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x578(0x10)

	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Barrier.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x15373d0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Barrier.OnInterruptedHandler // (Final|Native|Public) // @ game+0x1537060
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Barrier.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536e60
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Barrier.OnCancelledHandler // (Final|Native|Public) // @ game+0x1536c60
	void BarrierFinished(); // Function Madness.MadAIAbility_Yagak_Barrier.BarrierFinished // (Final|Native|Public) // @ game+0x1536a40
};

// Class Madness.MadAIAbility_Yagak_BaseTaunt
// Size: 0x538 (Inherited: 0x518)
struct UMadAIAbility_Yagak_BaseTaunt : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	struct TArray<struct UAnimMontage*> AnimMontages; // 0x520(0x10)
	struct UAnimMontage* CastingMontage; // 0x530(0x08)

	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_BaseTaunt.OnCompleteHandler // (Final|Native|Public) // @ game+0x152e180
	void CheckingAIPawn(); // Function Madness.MadAIAbility_Yagak_BaseTaunt.CheckingAIPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a80
};

// Class Madness.MadAIAbility_Yagak_Blink
// Size: 0x598 (Inherited: 0x598)
struct UMadAIAbility_Yagak_Blink : UMadAIAbility_Altered_Blink {
};

// Class Madness.MadAIAbility_Yagak_ChainLight
// Size: 0x6f8 (Inherited: 0x698)
struct UMadAIAbility_Yagak_ChainLight : UMadAIAbility_CastedBase {
	struct UMadDamageType* DamageTypeClass; // 0x698(0x08)
	struct UMadGameplayEffect* LightningEffectClass; // 0x6a0(0x08)
	struct UMadGameplayEffect* LightningHopEffectClass; // 0x6a8(0x08)
	struct FScalableFloat LightningHopRange; // 0x6b0(0x20)
	struct FScalableFloat BaseDamage; // 0x6d0(0x20)
	char UnknownData_6F0[0x8]; // 0x6f0(0x08)
};

// Class Madness.MadAIAbility_Yagak_Chains
// Size: 0x550 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Chains : UMadAIGameplayAbility {
	struct UAnimMontage* CastingMontage; // 0x518(0x08)
	float HookLocationOffset; // 0x520(0x04)
	char UnknownData_524[0x4]; // 0x524(0x04)
	struct FGameplayTagContainer Tag; // 0x528(0x20)
	struct UGameplayEffect* HeavySwingClass; // 0x548(0x08)

	struct FVector LocationBetweenHooks(); // Function Madness.MadAIAbility_Yagak_Chains.LocationBetweenHooks // (Final|Native|Public|HasDefaults|BlueprintCallable) // @ game+0x1536c20
	void EndAbilityCleanup(); // Function Madness.MadAIAbility_Yagak_Chains.EndAbilityCleanup // (Final|Native|Public|BlueprintCallable) // @ game+0x1536bc0
	void DeactivateCrossFireArea(); // Function Madness.MadAIAbility_Yagak_Chains.DeactivateCrossFireArea // (Final|Native|Public|BlueprintCallable) // @ game+0x1536ba0
};

// Class Madness.MadAIAbility_Yagak_ChainsCatch
// Size: 0x760 (Inherited: 0x698)
struct UMadAIAbility_Yagak_ChainsCatch : UMadAIAbility_CastedBase {
	struct UMadDamageType* PushDamageTypeClass; // 0x698(0x08)
	struct UMadDamageType* CatchDamageTypeClass; // 0x6a0(0x08)
	struct UMadExplosionTemplate* GroundHitExplosionTemplateClass; // 0x6a8(0x08)
	struct UMadGameplayEffect* EffectOnHitClass; // 0x6b0(0x08)
	struct FScalableFloat PushBaseDamage; // 0x6b8(0x20)
	struct FScalableFloat CatchBaseDamage; // 0x6d8(0x20)
	struct FGameplayTagContainer GameplayTagsToRemoveOnHit; // 0x6f8(0x20)
	int32_t MinSpins; // 0x718(0x04)
	int32_t MaxSpins; // 0x71c(0x04)
	float DamageToleranceDist; // 0x720(0x04)
	float CatchToleranceDist; // 0x724(0x04)
	struct TArray<struct AActor*> DamagedActors; // 0x728(0x10)
	char UnknownData_738[0x28]; // 0x738(0x28)

	void OnNotifyEnd(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbility_Yagak_ChainsCatch.OnNotifyEnd // (Final|Native|Protected) // @ game+0x15375d0
};

// Class Madness.MadAIAbility_Yagak_ChainsTaunt
// Size: 0x538 (Inherited: 0x518)
struct UMadAIAbility_Yagak_ChainsTaunt : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	struct TArray<struct UAnimMontage*> AnimMontages; // 0x520(0x10)
	struct UAnimMontage* CastingMontage; // 0x530(0x08)

	void CheckingAIPawn(); // Function Madness.MadAIAbility_Yagak_ChainsTaunt.CheckingAIPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a80
};

// Class Madness.MadAIAbility_Yagak_Cleaver
// Size: 0x570 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Cleaver : UMadAIGameplayAbility {
	struct UAnimMontage* AttackMontage; // 0x518(0x08)
	struct AMadCharAI_Yagak_Cleaver* Yagak; // 0x520(0x08)
	float MaxRange; // 0x528(0x04)
	float MinRange; // 0x52c(0x04)
	struct UCurveTable* EnemySkillsValues; // 0x530(0x08)
	struct FGameplayAttribute Attribute; // 0x538(0x38)
};

// Class Madness.MadAIAbility_Yagak_Cleave
// Size: 0x5b0 (Inherited: 0x570)
struct UMadAIAbility_Yagak_Cleave : UMadAIAbility_Yagak_Cleaver {
	struct FMulticastInlineDelegate OnComplete; // 0x570(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x580(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x590(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5a0(0x10)

	void SetOverlapAndEndAbility(); // Function Madness.MadAIAbility_Yagak_Cleave.SetOverlapAndEndAbility // (Final|Native|Public) // @ game+0x15377e0
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Cleave.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x1537450
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Cleave.OnInterruptedHandler // (Final|Native|Public) // @ game+0x15370e0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Cleave.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536ee0
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Cleave.OnCancelledHandler // (Final|Native|Public) // @ game+0x1536ce0
	void FaceRotation(); // Function Madness.MadAIAbility_Yagak_Cleave.FaceRotation // (Final|Native|Public|BlueprintCallable) // @ game+0x1536be0
	void BasicSetters(); // Function Madness.MadAIAbility_Yagak_Cleave.BasicSetters // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a60
};

// Class Madness.MadAIAbility_Yagak_CleaverComboBase
// Size: 0x540 (Inherited: 0x518)
struct UMadAIAbility_Yagak_CleaverComboBase : UMadAIGameplayAbility {
	float RangeMin; // 0x518(0x04)
	float RangeMax; // 0x51c(0x04)
	struct AMadCharAI_Yagak_Cleaver* OwnerCharacter; // 0x520(0x08)
	struct AMadAI_Yagak* OwnerController; // 0x528(0x08)
	struct UAnimMontage* MontageToPlay; // 0x530(0x08)
	char UnknownData_538[0x8]; // 0x538(0x08)

	struct UAnimMontage* SelectAnimMontageToPlay(float DistanceToTarget); // Function Madness.MadAIAbility_Yagak_CleaverComboBase.SelectAnimMontageToPlay // (Event|Protected|BlueprintEvent|Const) // @ game+0x1a35c70
	void OnNotifyBegin(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbility_Yagak_CleaverComboBase.OnNotifyBegin // (Native|Protected) // @ game+0x15372d0
	void OnMontageBlendingOut(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbility_Yagak_CleaverComboBase.OnMontageBlendingOut // (Native|Protected) // @ game+0x15371e0
};

// Class Madness.MadAIAbility_Yagak_CleaverTaunt
// Size: 0x538 (Inherited: 0x518)
struct UMadAIAbility_Yagak_CleaverTaunt : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	struct TArray<struct UAnimMontage*> AnimMontages; // 0x520(0x10)
	struct UAnimMontage* CastingMontage; // 0x530(0x08)

	void CheckingAIPawn(); // Function Madness.MadAIAbility_Yagak_CleaverTaunt.CheckingAIPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a80
};

// Class Madness.MadAIAbility_Yagak_ControlSandWyrms
// Size: 0x6b0 (Inherited: 0x698)
struct UMadAIAbility_Yagak_ControlSandWyrms : UMadAIAbility_CastedBase {
	struct AMadTentacle* TentacleTemplate; // 0x698(0x08)
	float TargetGroupingMaxDistance; // 0x6a0(0x04)
	char UnknownData_6A4[0x4]; // 0x6a4(0x04)
	struct UAnimMontage* TentacleMontage; // 0x6a8(0x08)
};

// Class Madness.MadAIAbility_Yagak_Dash
// Size: 0x568 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Dash : UMadAIGameplayAbility {
	struct UEnvQuery* QueryTemplate; // 0x518(0x08)
	struct UGameplayEffect* PostAbilityEffectClass; // 0x520(0x08)
	float MoveDuration; // 0x528(0x04)
	float TurnDuration; // 0x52c(0x04)
	struct UAnimMontage* StartMontage; // 0x530(0x08)
	struct UAnimMontage* LoopMontage; // 0x538(0x08)
	struct UAnimMontage* StopMontage; // 0x540(0x08)
	struct UCurveFloat* DashCurve; // 0x548(0x08)
	char UnknownData_550[0x18]; // 0x550(0x18)

	void OnMoveComplete(); // Function Madness.MadAIAbility_Yagak_Dash.OnMoveComplete // (Final|Native|Protected) // @ game+0x15372b0
	void DashStop(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Dash.DashStop // (Final|Native|Protected) // @ game+0x1536b20
	void DashLoop(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Dash.DashLoop // (Final|Native|Protected) // @ game+0x1536aa0
};

// Class Madness.MadAIAbility_Yagak_FloatingTaunt
// Size: 0x538 (Inherited: 0x518)
struct UMadAIAbility_Yagak_FloatingTaunt : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	struct TArray<struct UAnimMontage*> AnimMontages; // 0x520(0x10)
	struct UAnimMontage* CastingMontage; // 0x530(0x08)

	void CheckingAIPawn(); // Function Madness.MadAIAbility_Yagak_FloatingTaunt.CheckingAIPawn // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a80
};

// Class Madness.MadAIAbility_Yagak_FullSwing
// Size: 0x600 (Inherited: 0x550)
struct UMadAIAbility_Yagak_FullSwing : UMadAIAbility_Yagak_Chains {
	struct UParticleSystem* MarkerAbility; // 0x550(0x08)
	struct FName MarkerParamSizeName; // 0x558(0x08)
	struct FVector MarkerSize; // 0x560(0x0c)
	char UnknownData_56C[0x4]; // 0x56c(0x04)
	struct UExplosionTemplate* Explosion; // 0x570(0x08)
	struct AChainsSmallSphereQuakeProjectile* SmallSphereBPClass; // 0x578(0x08)
	int32_t NumberOfSwings; // 0x580(0x04)
	int32_t MaxSwings; // 0x584(0x04)
	int32_t MinSwings; // 0x588(0x04)
	char UnknownData_58C[0x4]; // 0x58c(0x04)
	float DeformRadius; // 0x590(0x04)
	float DeformSpeed; // 0x594(0x04)
	float RotateCharacterTurningSpeed; // 0x598(0x04)
	char UnknownData_59C[0x4]; // 0x59c(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x5a0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5d0(0x10)
	struct FMulticastInlineDelegate OnNotifyEnd; // 0x5e0(0x10)
	struct UParticleSystemComponent* Marker; // 0x5f0(0x08)
	struct UMadAIAbilityTask_RotateTowardActor* RotateTask; // 0x5f8(0x08)

	void UpdateSwingLoopCounter(); // Function Madness.MadAIAbility_Yagak_FullSwing.UpdateSwingLoopCounter // (Final|Native|Public|BlueprintCallable) // @ game+0x15379e0
	void OnNotifyEndHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_FullSwing.OnNotifyEndHandler // (Final|Native|Public) // @ game+0x15376d0
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_FullSwing.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x15374d0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_FullSwing.OnInterruptedHandler // (Final|Native|Public) // @ game+0x1537160
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_FullSwing.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536f60
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_FullSwing.OnCancelledHandler // (Final|Native|Public) // @ game+0x1536d60
};

// Class Madness.MadAIAbility_Yagak_GatherEnergy
// Size: 0x6b8 (Inherited: 0x698)
struct UMadAIAbility_Yagak_GatherEnergy : UMadAIAbility_CastedBase {
	struct AYagakRiftEnergy* EnergyActorTemplate; // 0x698(0x08)
	struct AMadYagakAnomalyShield* AnomalyShieldClass; // 0x6a0(0x08)
	struct UGameplayEffect* AnomalyPowerBuff; // 0x6a8(0x08)
	struct FTimerHandle ShieldSpawnTimerHandle; // 0x6b0(0x08)
};

// Class Madness.MadAIAbility_Yagak_Jump
// Size: 0x558 (Inherited: 0x540)
struct UMadAIAbility_Yagak_Jump : UMadAIAbility_Yagak_CleaverComboBase {
	char UnknownData_540[0xc]; // 0x540(0x0c)
	float DefaultDesiredDistance; // 0x54c(0x04)
	float PredictDuration; // 0x550(0x04)
	float MaxPredictionDistance; // 0x554(0x04)
};

// Class Madness.MadAIAbility_Yagak_LightStrikes
// Size: 0x5f8 (Inherited: 0x518)
struct UMadAIAbility_Yagak_LightStrikes : UMadAIGameplayAbility {
	struct AActor* Target; // 0x518(0x08)
	struct AMadCharAI* Caster; // 0x520(0x08)
	struct UAnimMontage* CastingMontage; // 0x528(0x08)
	struct FTimerHandle CastHandle; // 0x530(0x08)
	struct FTimerHandle StrikeDelayHandle; // 0x538(0x08)
	struct TArray<struct AActor*> AllTargets; // 0x540(0x10)
	struct AYagakLightningStrike* LightningStrikeClass; // 0x550(0x08)
	struct UGameplayEffect* ChannelEffectClass; // 0x558(0x08)
	struct UGameplayEffect* ExhaustionEffectClass; // 0x560(0x08)
	float StrikeInterval; // 0x568(0x04)
	float MinRange; // 0x56c(0x04)
	float MaxRange; // 0x570(0x04)
	int32_t StrikeCount; // 0x574(0x04)
	float StrikeTimeModifier; // 0x578(0x04)
	float TimeToLightningHit; // 0x57c(0x04)
	char UnknownData_580[0x18]; // 0x580(0x18)
	struct TArray<struct AActor*> StrikeTargets; // 0x598(0x10)
	struct AActor* StrikeTarget; // 0x5a8(0x08)
	struct FMulticastInlineDelegate OnComplete; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x5d0(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5e0(0x10)
	char UnknownData_5F0[0x8]; // 0x5f0(0x08)

	void StrikesFinished(); // Function Madness.MadAIAbility_Yagak_LightStrikes.StrikesFinished // (Final|Native|Public|BlueprintCallable) // @ game+0x15379c0
	void SpawnStrikesAtLocations(); // Function Madness.MadAIAbility_Yagak_LightStrikes.SpawnStrikesAtLocations // (Final|Native|Public|BlueprintCallable) // @ game+0x1537980
	bool ShowCastBar(struct FText AbilityName, float CastTime, bool bIsChanneling); // Function Madness.MadAIAbility_Yagak_LightStrikes.ShowCastBar // (Final|Native|Public|BlueprintCallable) // @ game+0x1537800
	void SetCastEffects(bool bTurnOn); // Function Madness.MadAIAbility_Yagak_LightStrikes.SetCastEffects // (Final|Native|Public|BlueprintCallable) // @ game+0x1537750
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_LightStrikes.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x1537550
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_LightStrikes.OnInterruptedHandler // (Final|Native|Public) // @ game+0x1536d60
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_LightStrikes.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536fe0
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_LightStrikes.OnCancelledHandler // (Final|Native|Public) // @ game+0x1536de0
	void GetCasterAndTargets(); // Function Madness.MadAIAbility_Yagak_LightStrikes.GetCasterAndTargets // (Final|Native|Public|BlueprintCallable) // @ game+0x1536c00
};

// Class Madness.MadAIAbility_Yagak_Melee
// Size: 0x540 (Inherited: 0x540)
struct UMadAIAbility_Yagak_Melee : UMadAIAbility_Yagak_CleaverComboBase {
};

// Class Madness.MadAIAbility_Yagak_QuickSlash
// Size: 0x618 (Inherited: 0x550)
struct UMadAIAbility_Yagak_QuickSlash : UMadAIAbility_Yagak_Chains {
	struct UAnimMontage* StartAttackMontage; // 0x550(0x08)
	char UnknownData_558_0 : 7; // 0x558(0x01)
	bool bFinishedWithRightHand : 1; // 0x558(0x01)
	char UnknownData_559[0x7]; // 0x559(0x07)
	struct UGameplayEffect* LeftPoseEffectClass; // 0x560(0x08)
	struct FGameplayTagContainer LeftPoseTag; // 0x568(0x20)
	struct FGameplayTagContainer UsingHeavySwingTag; // 0x588(0x20)
	struct FGameplayTag QuickSlashTag; // 0x5a8(0x08)
	struct UExplosionTemplate* Explosion; // 0x5b0(0x08)
	struct AChainsSmallSphereQuakeProjectile* SmallSphereBPClass; // 0x5b8(0x08)
	struct FMulticastInlineDelegate OnComplete; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x5d0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x5e0(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5f0(0x10)
	struct FMulticastInlineDelegate OnNotifyEnd; // 0x600(0x10)
	int32_t LoopsCount; // 0x610(0x04)
	char UnknownData_614[0x4]; // 0x614(0x04)

	void StartMontage(); // Function Madness.MadAIAbility_Yagak_QuickSlash.StartMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x153adb0
	void OnNotifyEndHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_QuickSlash.OnNotifyEndHandler // (Final|Native|Public) // @ game+0x153a840
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_QuickSlash.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x153a640
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_QuickSlash.OnInterruptedHandler // (Final|Native|Public) // @ game+0x153a3c0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_QuickSlash.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536d60
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_QuickSlash.OnCancelledHandler // (Final|Native|Public) // @ game+0x153a140
	void FinishMontage(); // Function Madness.MadAIAbility_Yagak_QuickSlash.FinishMontage // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a40
	void ApplyIdleLeftPoseStatus(bool bApply); // Function Madness.MadAIAbility_Yagak_QuickSlash.ApplyIdleLeftPoseStatus // (Final|Native|Public|BlueprintCallable) // @ game+0x1539ef0
};

// Class Madness.MadAIAbility_Yagak_Reset
// Size: 0x518 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Reset : UMadAIGameplayAbility {
};

// Class Madness.MadAIAbility_Yagak_Shroud
// Size: 0x5e0 (Inherited: 0x518)
struct UMadAIAbility_Yagak_Shroud : UMadAIGameplayAbility {
	struct UAnimMontage* CleaverMontage; // 0x518(0x08)
	struct UAnimMontage* ChainsMontage; // 0x520(0x08)
	struct AMadCharAI_Yagak* Yagak; // 0x528(0x08)
	struct UGameplayEffect* InShroudClass; // 0x530(0x08)
	struct UGameplayEffect* InitialCooldownEffectTemplate; // 0x538(0x08)
	struct FTimerHandle TimerChecker; // 0x540(0x08)
	struct FName SupportWaveName; // 0x548(0x08)
	struct AYagakShroud* Shroud; // 0x550(0x08)
	struct AYagakShroud* ShroudBPClass; // 0x558(0x08)
	struct FGameplayTagContainer Tag; // 0x560(0x20)
	struct FVector ShroudScale; // 0x580(0x0c)
	struct FVector SwordLocationOffset; // 0x58c(0x0c)
	float ClearTime; // 0x598(0x04)
	float MaxHealthRatioForActivation; // 0x59c(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x5a0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x5b0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x5c0(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5d0(0x10)

	void SetOverlapAndEndAbility(); // Function Madness.MadAIAbility_Yagak_Shroud.SetOverlapAndEndAbility // (Final|Native|Public|BlueprintCallable) // @ game+0x1536a40
	void RemoveTag(); // Function Madness.MadAIAbility_Yagak_Shroud.RemoveTag // (Final|Native|Public) // @ game+0x153ad70
	void OnSupportWaveKilled(struct AFWWaveSpawningSystem* Wss, int32_t WaveIndex, struct FName WaveName, int32_t NumWavesKilled, struct ABaseCharacter* KilledCharacter); // Function Madness.MadAIAbility_Yagak_Shroud.OnSupportWaveKilled // (Final|Native|Public) // @ game+0x153a9c0
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Shroud.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x153a6c0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Shroud.OnInterruptedHandler // (Final|Native|Public) // @ game+0x1536fe0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Shroud.OnCompleteHandler // (Final|Native|Public) // @ game+0x1536f60
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Shroud.OnCancelledHandler // (Final|Native|Public) // @ game+0x1536d60
	void DestroyShroud(); // Function Madness.MadAIAbility_Yagak_Shroud.DestroyShroud // (Final|Native|Public|BlueprintCallable) // @ game+0x153a020
	void CallGameplayTagRemove(); // Function Madness.MadAIAbility_Yagak_Shroud.CallGameplayTagRemove // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
};

// Class Madness.MadAIAbility_Yagak_Strike
// Size: 0x5f8 (Inherited: 0x570)
struct UMadAIAbility_Yagak_Strike : UMadAIAbility_Yagak_Cleaver {
	struct FVector JumpDestination; // 0x570(0x0c)
	struct FVector TraceOffset; // 0x57c(0x0c)
	struct FVector HalfSize; // 0x588(0x0c)
	struct FVector GroundSlamOffset; // 0x594(0x0c)
	float TargetDistance; // 0x5a0(0x04)
	float GroundSlamOffsetMultiplier; // 0x5a4(0x04)
	float AttackRate; // 0x5a8(0x04)
	char UnknownData_5AC_0 : 7; // 0x5ac(0x01)
	bool bCanSubmitCooldown : 1; // 0x5ac(0x01)
	char UnknownData_5AD[0x3]; // 0x5ad(0x03)
	struct UExplosionTemplate* Explosion; // 0x5b0(0x08)
	struct FMulticastInlineDelegate OnComplete; // 0x5b8(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x5c8(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x5d8(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5e8(0x10)

	void StartAbility(); // Function Madness.MadAIAbility_Yagak_Strike.StartAbility // (Final|Native|Public|BlueprintCallable) // @ game+0x153ad90
	void RunEQS(); // Function Madness.MadAIAbility_Yagak_Strike.RunEQS // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Strike.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x153a740
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Strike.OnInterruptedHandler // (Final|Native|Public) // @ game+0x153a440
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Strike.OnCompleteHandler // (Final|Native|Public) // @ game+0x153a240
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_Strike.OnCancelledHandler // (Final|Native|Public) // @ game+0x153a1c0
	void BasicSetters(); // Function Madness.MadAIAbility_Yagak_Strike.BasicSetters // (Final|Native|Public|BlueprintCallable) // @ game+0x1539f80
};

// Class Madness.MadAIAbility_Yagak_SummonRiftWyrm
// Size: 0x598 (Inherited: 0x518)
struct UMadAIAbility_Yagak_SummonRiftWyrm : UMadAIGameplayAbility {
	char UnknownData_518[0x28]; // 0x518(0x28)
	float ChannelTime; // 0x540(0x04)
	float CastTime; // 0x544(0x04)
	float HighHealthRatio; // 0x548(0x04)
	float LowHealthRatio; // 0x54c(0x04)
	struct FName StartFromRight; // 0x550(0x08)
	struct FName StartFromLeft; // 0x558(0x08)
	struct FName SpawnNotifyName; // 0x560(0x08)
	struct UAnimMontage* CastingMontage; // 0x568(0x08)
	struct FRotator WyrmRotationOffset; // 0x570(0x0c)
	char UnknownData_57C[0x4]; // 0x57c(0x04)
	struct AActor* RiftWyrmCallerClass; // 0x580(0x08)
	struct FGameplayTag GlobalCooldownTag; // 0x588(0x08)
	float MinGlobalCooldown; // 0x590(0x04)
	float MaxGlobalCooldown; // 0x594(0x04)

	void OnMontageNotifyBegin(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SummonRiftWyrm.OnMontageNotifyBegin // (Final|Native|Protected) // @ game+0x153a540
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SummonRiftWyrm.OnMontageComplete // (Final|Native|Protected) // @ game+0x153a4c0
	void OnMontageCancelled(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SummonRiftWyrm.OnMontageCancelled // (Final|Native|Protected) // @ game+0x1526d80
};

// Class Madness.MadAIAbility_Yagak_SwingingCombo
// Size: 0x858 (Inherited: 0x570)
struct UMadAIAbility_Yagak_SwingingCombo : UMadAIAbility_Yagak_Cleaver {
	struct UAnimMontage* InitialTauntMontage; // 0x570(0x08)
	struct UAnimMontage* SwordJumpMontage; // 0x578(0x08)
	struct UAnimMontage* SwordJumpMidMontage; // 0x580(0x08)
	struct UAnimMontage* SwordJumpEndMontage; // 0x588(0x08)
	struct UAnimMontage* StabMontage; // 0x590(0x08)
	struct UAnimMontage* PostStabMontage; // 0x598(0x08)
	struct UAnimMontage* FinishersMontage; // 0x5a0(0x08)
	struct UAnimMontage* LightBackhandRightMontage; // 0x5a8(0x08)
	struct UAnimMontage* LightBackhandLeftMontage; // 0x5b0(0x08)
	struct UAnimMontage* LightBackhandForwardMontage; // 0x5b8(0x08)
	struct UAnimMontage* LightForehandRightMontage; // 0x5c0(0x08)
	struct UAnimMontage* LightForehandLeftMontage; // 0x5c8(0x08)
	struct UAnimMontage* LightForehandForwardMontage; // 0x5d0(0x08)
	struct UAnimMontage* HeavyBackhandMontage; // 0x5d8(0x08)
	struct UAnimMontage* SwordDodgeMontage; // 0x5e0(0x08)
	struct TArray<struct UAnimMontage*> FinisherTaunts; // 0x5e8(0x10)
	struct TArray<struct UAnimMontage*> FronthandTaunts; // 0x5f8(0x10)
	struct FName InitialTauntTask; // 0x608(0x08)
	struct FName SwordJumpTask; // 0x610(0x08)
	struct FName SwordJumpSection; // 0x618(0x08)
	struct FName SwordJumpMidTask; // 0x620(0x08)
	struct FName JumpAttackMoveToTargetTask; // 0x628(0x08)
	struct FName SwordJumpEndTask; // 0x630(0x08)
	struct FName SwordJumpEndSection; // 0x638(0x08)
	struct FName StabTask; // 0x640(0x08)
	struct FName PostStabTask; // 0x648(0x08)
	struct FName LightBackhandTask; // 0x650(0x08)
	struct FName StrongBackhandTask; // 0x658(0x08)
	struct FName QuickBackhandTask; // 0x660(0x08)
	struct FName QuickForehandTask; // 0x668(0x08)
	struct FName QuickFinishTask; // 0x670(0x08)
	struct FName MediumQuickForehandTask; // 0x678(0x08)
	struct FName MediumStrongBackhandTask; // 0x680(0x08)
	struct FName LightForehandTask; // 0x688(0x08)
	struct FName StrongForehandTask; // 0x690(0x08)
	struct FName SwordDodgeTask; // 0x698(0x08)
	struct FName LightBackhandSection; // 0x6a0(0x08)
	struct FName StrongBackhandSection; // 0x6a8(0x08)
	struct FName QuickBackhandSection; // 0x6b0(0x08)
	struct FName StrongForehandSection; // 0x6b8(0x08)
	struct FName LightForehandSection; // 0x6c0(0x08)
	struct FName RightDodgeSection; // 0x6c8(0x08)
	struct FName LeftDodgeSection; // 0x6d0(0x08)
	struct FName StrongFinishTask; // 0x6d8(0x08)
	struct FName SwordForwardSection; // 0x6e0(0x08)
	struct FName Sword45RSection; // 0x6e8(0x08)
	struct FName Sword45LSection; // 0x6f0(0x08)
	struct FName Sword90RSection; // 0x6f8(0x08)
	struct FName Sword90LSection; // 0x700(0x08)
	struct FName Sword135RSection; // 0x708(0x08)
	struct FName Sword135LSection; // 0x710(0x08)
	struct FName Sword180RSection; // 0x718(0x08)
	struct FName Sword180LSection; // 0x720(0x08)
	struct FName FinisherTauntTask; // 0x728(0x08)
	struct FName FronthandTauntTask; // 0x730(0x08)
	float TauntChance; // 0x738(0x04)
	float JumpDistance; // 0x73c(0x04)
	float SwordJumpTurnDuration; // 0x740(0x04)
	float JumpAttackMoveOffset; // 0x744(0x04)
	float JumpOffsetFromNavmeshEdge; // 0x748(0x04)
	float LightBackhandChance; // 0x74c(0x04)
	float StrongBackhandChance; // 0x750(0x04)
	float JumpLightChance; // 0x754(0x04)
	float JumpAfterDistance; // 0x758(0x04)
	float BackhandAfterDistance; // 0x75c(0x04)
	float StabDistance; // 0x760(0x04)
	float InitialTauntRate; // 0x764(0x04)
	float SwordJumpRate; // 0x768(0x04)
	float SwordJumpMidRate; // 0x76c(0x04)
	float SwordJumpEndRate; // 0x770(0x04)
	float StabRate; // 0x774(0x04)
	float PostStabRate; // 0x778(0x04)
	float FinisherTauntRate; // 0x77c(0x04)
	float SwordDodgeRate; // 0x780(0x04)
	float LightBackhandRate; // 0x784(0x04)
	float StrongBackhandRate; // 0x788(0x04)
	float StrongForehandRate; // 0x78c(0x04)
	float LightForehandRate; // 0x790(0x04)
	float AfterStabFarDistance; // 0x794(0x04)
	float AfterStabNearDistance; // 0x798(0x04)
	float PostStabFinisherWeight; // 0x79c(0x04)
	float NearDodgeDistance; // 0x7a0(0x04)
	float FarDodgeDistance; // 0x7a4(0x04)
	float DodgeFinisherWeight; // 0x7a8(0x04)
	float DiagonalDotMin; // 0x7ac(0x04)
	float DiagonalDotMax; // 0x7b0(0x04)
	float AttackIdleWait; // 0x7b4(0x04)
	float TargetForwardAngle; // 0x7b8(0x04)
	float Target45Angle; // 0x7bc(0x04)
	float Target90Angle; // 0x7c0(0x04)
	float Target135Angle; // 0x7c4(0x04)
	float Target180Angle; // 0x7c8(0x04)
	char UnknownData_7CC[0x4]; // 0x7cc(0x04)
	struct FGameplayTagContainer HeavySwingTags; // 0x7d0(0x20)
	struct FGameplayTag RegularQuakeCue; // 0x7f0(0x08)
	struct FGameplayTag BackhandPoseTag; // 0x7f8(0x08)
	struct UExplosionTemplate* LightSlamExplosion; // 0x800(0x08)
	struct UExplosionTemplate* HeavySlamExplosion; // 0x808(0x08)
	struct UGameplayEffect* HeavySwingEffectClass; // 0x810(0x08)
	struct UGameplayEffect* BackhandIdleEffect; // 0x818(0x08)
	struct AActor* HeavyQuakeClass; // 0x820(0x08)
	struct AActor* LightQuakeClass; // 0x828(0x08)
	struct UCurveFloat* JumpAttackMoveToTargetCurve; // 0x830(0x08)
	char UnknownData_838[0x20]; // 0x838(0x20)

	void TriggeringSwordDamageEnd(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.TriggeringSwordDamageEnd // (Final|Native|Protected) // @ game+0x153ae50
	void TriggeringSwordDamageBegin(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.TriggeringSwordDamageBegin // (Final|Native|Protected) // @ game+0x153add0
	void PostJumpLightCombo_Step3(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.PostJumpLightCombo_Step3 // (Final|Native|Protected) // @ game+0x153acf0
	void PostJumpLightCombo_Step2(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.PostJumpLightCombo_Step2 // (Final|Native|Protected) // @ game+0x153ac70
	void OnSwordJumpStartComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnSwordJumpStartComplete // (Final|Native|Protected) // @ game+0x153abf0
	void OnSwordJumpMoveComplete(); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnSwordJumpMoveComplete // (Final|Native|Protected) // @ game+0x153abd0
	void OnSwordJumpEndComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnSwordJumpEndComplete // (Final|Native|Protected) // @ game+0x153ab50
	void OnStabComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnStabComplete // (Final|Native|Protected) // @ game+0x153a940
	void OnPostStabComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnPostStabComplete // (Final|Native|Protected) // @ game+0x153a8c0
	void OnInitialTauntComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.OnInitialTauntComplete // (Final|Native|Protected) // @ game+0x153a340
	void FronthandComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.FronthandComplete // (Final|Native|Protected) // @ game+0x153a0c0
	void EndForehandFinisher(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.EndForehandFinisher // (Final|Native|Protected) // @ game+0x153a040
	void CloseRangeMediumCombo_Step2(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.CloseRangeMediumCombo_Step2 // (Final|Native|Protected) // @ game+0x1539fa0
	void AllDone(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_SwingingCombo.AllDone // (Final|Native|Protected) // @ game+0x152e180
};

// Class Madness.MadAIAbility_Yagak_TeleGrasp
// Size: 0x560 (Inherited: 0x518)
struct UMadAIAbility_Yagak_TeleGrasp : UMadAIGameplayAbility {
	char UnknownData_518[0xc]; // 0x518(0x0c)
	float TelekineticGraspRadius; // 0x524(0x04)
	struct AMadCharAI_Yagak* Caster; // 0x528(0x08)
	struct UParticleSystemComponent* HazardousMarker; // 0x530(0x08)
	struct UParticleSystem* MarkerTemplate; // 0x538(0x08)
	float CastTime; // 0x540(0x04)
	char UnknownData_544[0x4]; // 0x544(0x04)
	struct UAnimMontage* CastingMontage; // 0x548(0x08)
	struct UExplosionTemplate* ExplosionTemplate; // 0x550(0x08)
	struct FGameplayTag GlobalCooldownTag; // 0x558(0x08)

	void OnMontageNotifyBegin(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleGrasp.OnMontageNotifyBegin // (Final|Native|Public) // @ game+0x153a5c0
	void OnMontageComplete(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleGrasp.OnMontageComplete // (Final|Native|Public) // @ game+0x1526d80
};

// Class Madness.MadAIAbility_Yagak_TeleSlam
// Size: 0x588 (Inherited: 0x518)
struct UMadAIAbility_Yagak_TeleSlam : UMadAIGameplayAbility {
	struct AMadCharAI* AIPawn; // 0x518(0x08)
	float CastingDuration; // 0x520(0x04)
	char UnknownData_524[0x4]; // 0x524(0x04)
	struct UAnimMontage* MontageToPlay; // 0x528(0x08)
	struct UExplosionTemplate* Explosion; // 0x530(0x08)
	struct FMulticastInlineDelegate OnComplete; // 0x538(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x548(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x558(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x568(0x10)
	char UnknownData_578[0x10]; // 0x578(0x10)

	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleSlam.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x153a7c0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleSlam.OnInterruptedHandler // (Final|Native|Public) // @ game+0x1536e60
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleSlam.OnCompleteHandler // (Final|Native|Public) // @ game+0x153a2c0
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_TeleSlam.OnCancelledHandler // (Final|Native|Public) // @ game+0x1537060
};

// Class Madness.MadAIAbility_Yagak_WideSlash
// Size: 0x5c8 (Inherited: 0x550)
struct UMadAIAbility_Yagak_WideSlash : UMadAIAbility_Yagak_Chains {
	char UnknownData_550_0 : 7; // 0x550(0x01)
	bool bFirstAreaSpawned : 1; // 0x550(0x01)
	char UnknownData_551[0x7]; // 0x551(0x07)
	struct AChainsCrossAreaSingleLine* ChainsCrossAreaClass; // 0x558(0x08)
	float FireAreaOffset; // 0x560(0x04)
	float FireOffset1; // 0x564(0x04)
	float FireOffset2; // 0x568(0x04)
	float FireYawOffset1; // 0x56c(0x04)
	float FireYawOffset2; // 0x570(0x04)
	int32_t CombatState; // 0x574(0x04)
	struct FMulticastInlineDelegate OnComplete; // 0x578(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0x588(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0x598(0x10)
	struct FMulticastInlineDelegate OnNotifyBegin; // 0x5a8(0x10)
	struct FMulticastInlineDelegate OnNotifyEnd; // 0x5b8(0x10)

	void SpawnFireLineArea(bool bRightHookAsLocation, float Offset, bool bInvertRotation, float YawOffset); // Function Madness.MadAIAbility_Yagak_WideSlash.SpawnFireLineArea // (Final|Native|Public|BlueprintCallable) // @ game+0x153f7b0
	void OnNotifyEndHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_WideSlash.OnNotifyEndHandler // (Final|Native|Public) // @ game+0x153f570
	void OnNotifyBeginHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_WideSlash.OnNotifyBeginHandler // (Final|Native|Public) // @ game+0x153f4f0
	void OnInterruptedHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_WideSlash.OnInterruptedHandler // (Final|Native|Public) // @ game+0x153f0b0
	void OnCompleteHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_WideSlash.OnCompleteHandler // (Final|Native|Public) // @ game+0x153f030
	void OnCancelledHandler(struct FName NotifyName); // Function Madness.MadAIAbility_Yagak_WideSlash.OnCancelledHandler // (Final|Native|Public) // @ game+0x153efb0
};

// Class Madness.MadAIAbilityTask_ConeCheck
// Size: 0x100 (Inherited: 0x90)
struct UMadAIAbilityTask_ConeCheck : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnStartOverlap; // 0x90(0x10)
	struct FMulticastInlineDelegate OnEndOverlap; // 0xa0(0x10)
	struct AActor* ActorAsConeOrigin; // 0xb0(0x08)
	struct AActor* ConeDirectionActor; // 0xb8(0x08)
	struct AActor* ActorToWatch; // 0xc0(0x08)
	struct TArray<struct AActor*> OverlappingActors; // 0xc8(0x10)
	char UnknownData_D8[0x28]; // 0xd8(0x28)

	struct UMadAIAbilityTask_ConeCheck* ConeCheck(struct UMadAIGameplayAbility* WorldContextObject, struct AActor* ActorAsConeOrigin, struct FString SocketName, struct FVector VectorAsConeOrigin, float ConeHalfAngle, struct AActor* ConeDirection, struct AActor* ActorToCheck, float ConeDistance, bool UseBoneRotation, bool UseOnlyBoneYawRotation, bool GatherAllCharacters, bool DebugDraw, enum class None Priority); // Function Madness.MadAIAbilityTask_ConeCheck.ConeCheck // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x153d860
};

// Class Madness.MadAIAbilityTask_CreateAnomalyShield
// Size: 0x110 (Inherited: 0x90)
struct UMadAIAbilityTask_CreateAnomalyShield : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnCreateShield; // 0xc0(0x10)
	char UnknownData_D0[0x40]; // 0xd0(0x40)

	void TaskCreateAnomalyShieldDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_CreateAnomalyShield.TaskCreateAnomalyShieldDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_CreateAnomalyShield.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x153f470
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_CreateAnomalyShield.OnMontageEnded // (Final|Native|Protected) // @ game+0x153f130
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_CreateAnomalyShield.OnAnimNotify // (Final|Native|Protected) // @ game+0x153ed60
	void CreateShield(); // Function Madness.MadAIAbilityTask_CreateAnomalyShield.CreateShield // (BlueprintAuthorityOnly|Event|Public|BlueprintEvent) // @ game+0x1a35c70
	struct UMadAIAbilityTask_CreateAnomalyShield* CreateAnomalyShield(struct UObject* WorldContextObject, struct FMontageAssetSelector Montage, struct FName NotifyName); // Function Madness.MadAIAbilityTask_CreateAnomalyShield.CreateAnomalyShield // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x153dcb0
};

// Class Madness.MadAIAbilityTask_DDBoomBlastSelectTarget
// Size: 0x108 (Inherited: 0x90)
struct UMadAIAbilityTask_DDBoomBlastSelectTarget : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnFailed; // 0xa0(0x10)
	char UnknownData_B0[0x8]; // 0xb0(0x08)
	struct AActor* CurrentTarget; // 0xb8(0x08)
	struct TArray<struct AActor*> Targets; // 0xc0(0x10)
	char UnknownData_D0[0x38]; // 0xd0(0x38)

	void TaskDDBoomBlastSelectTargetDelegate__DelegateSignature(struct AActor* Target, struct FVector Destination); // DelegateFunction Madness.MadAIAbilityTask_DDBoomBlastSelectTarget.TaskDDBoomBlastSelectTargetDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate|HasDefaults) // @ game+0x1a35c70
	struct UMadAIAbilityTask_DDBoomBlastSelectTarget* DDBoomBlastSelectTarget(struct UObject* WorldContextObject, struct AActor* CurrentTarget, bool bTryToSwapTarget, bool bCheckOnlyCurrentTarget, float DeltaDistanceTest, float MaxDistance, float MinDistance, float MaxAngle); // Function Madness.MadAIAbilityTask_DDBoomBlastSelectTarget.DDBoomBlastSelectTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x153e280
};

// Class Madness.MadDataAsset_DirectionalMeleeAttack
// Size: 0x48 (Inherited: 0x30)
struct UMadDataAsset_DirectionalMeleeAttack : UDataAsset {
	struct TArray<struct FMadAI_SingleMeleeAttack> Variants; // 0x30(0x10)
	float MaxAttackDistanceIncreased; // 0x40(0x04)
	char UnknownData_44_0 : 7; // 0x44(0x01)
	bool bIsInPlaceAttack : 1; // 0x44(0x01)
	char UnknownData_45[0x3]; // 0x45(0x03)
};

// Class Madness.MadAIAbilityTask_DirectionalMeleeAttack
// Size: 0x120 (Inherited: 0x90)
struct UMadAIAbilityTask_DirectionalMeleeAttack : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnAIAnimNotify; // 0x90(0x10)
	struct FMulticastInlineDelegate OnComplete; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xc0(0x10)
	struct AActor* TargetActor; // 0xd0(0x08)
	struct UMadDataAsset_DirectionalMeleeAttack* AnimDataAsset; // 0xd8(0x08)
	char UnknownData_E0[0x40]; // 0xe0(0x40)

	void TaskDirectionalMeleeAttackDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_DirectionalMeleeAttack.TaskDirectionalMeleeAttackDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void TaskDirectionalMeleeAttackAnimNotifyDelegate__DelegateSignature(struct UFWAnimNotify* AnimNotify, struct FName NotifyName); // DelegateFunction Madness.MadAIAbilityTask_DirectionalMeleeAttack.TaskDirectionalMeleeAttackAnimNotifyDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_DirectionalMeleeAttack.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x153f4b0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_DirectionalMeleeAttack.OnMontageEnded // (Final|Native|Protected) // @ game+0x153f2d0
	void OnAnimNotify(struct UFWAnimNotify* AnimNotify, struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_DirectionalMeleeAttack.OnAnimNotify // (Final|Native|Protected) // @ game+0x153ee60
	struct UMadAIAbilityTask_DirectionalMeleeAttack* DirectionalMeleeAttack(struct UObject* WorldContextObject, struct AActor* TargetActor, struct UMadDataAsset_DirectionalMeleeAttack* AnimDataAsset, bool bComboAttack, bool bContinuousAttacks, bool bCheckDistanceOnNavmesh); // Function Madness.MadAIAbilityTask_DirectionalMeleeAttack.DirectionalMeleeAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x153e4d0
};

// Class Madness.MadAIAbilityTask_DS360Attack
// Size: 0x3f8 (Inherited: 0x90)
struct UMadAIAbilityTask_DS360Attack : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyBegin; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyEnd; // 0xd0(0x10)
	char UnknownData_E0[0x318]; // 0xe0(0x318)

	void TaskDS360AttackDelegate__DelegateSignature(struct FName NotifyName); // DelegateFunction Madness.MadAIAbilityTask_DS360Attack.TaskDS360AttackDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void SpawnNextProjectile(); // Function Madness.MadAIAbilityTask_DS360Attack.SpawnNextProjectile // (Final|Native|Protected) // @ game+0x153f910
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_DS360Attack.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x153f490
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_DS360Attack.OnMontageEnded // (Final|Native|Protected) // @ game+0x153f200
	void OnAbilityAnimNotifyEnd(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_DS360Attack.OnAbilityAnimNotifyEnd // (Final|Native|Protected) // @ game+0x153ec60
	void OnAbilityAnimNotifyBegin(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_DS360Attack.OnAbilityAnimNotifyBegin // (Final|Native|Protected) // @ game+0x153ea60
	struct UMadAIAbilityTask_DS360Attack* ExecuteDS360Attack(struct UObject* WorldContextObject, float MinDistance, float MaxDistance, struct AProjectile* Projectile, float ProjectileGroundSpeed, float ExtraHeight, struct FMontageAssetSelector Montage, struct TArray<struct FName> NotifyNames, float PredictionTime, float MaxPredictionDistance, float MaxRotationAngle, float MaxTestRotationAngle, bool bAdjustDistance); // Function Madness.MadAIAbilityTask_DS360Attack.ExecuteDS360Attack // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x153e690
	bool CanUse360Attack(struct UMadAIGameplayAbility* OwningAbility, struct TArray<struct F360AttackBandInfo> BandInfos); // Function Madness.MadAIAbilityTask_DS360Attack.CanUse360Attack // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x153d570
};

// Class Madness.MadAIAbilityTask_DSChangeHeight
// Size: 0xc0 (Inherited: 0x90)
struct UMadAIAbilityTask_DSChangeHeight : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnCompleted; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct UMadDSHeightComponent* HeightComponent; // 0xb0(0x08)
	char UnknownData_B8[0x8]; // 0xb8(0x08)

	struct UMadAIAbilityTask_DSChangeHeight* RestoreDSOriginalHeight(struct UObject* WorldContextObject, float MaxSpeed, float Acceleration, bool bDeclerateAtEnd, bool bGlide, float StartSpeed); // Function Madness.MadAIAbilityTask_DSChangeHeight.RestoreDSOriginalHeight // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x153f5f0
	struct UMadAIAbilityTask_DSChangeHeight* ChangeDSHeight(struct UObject* WorldContextObject, float NewHeight, float MaxSpeed, float Acceleration, bool bDeclerateAtEnd, bool bResetToDefaultOnArrival, float StartSpeed); // Function Madness.MadAIAbilityTask_DSChangeHeight.ChangeDSHeight // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x153d660
};

// Class Madness.MadAIAbilityTask_DSGlideAttack
// Size: 0x210 (Inherited: 0x90)
struct UMadAIAbilityTask_DSGlideAttack : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnPlayAttackAnimation; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnPlayAttackExitForwardAnimation; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnPlayAttackExitBackwardAnimation; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnPlayIntoDiveAnimation; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnPlayDiveAnimation; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnPlayClimbAnimation; // 0x100(0x10)
	struct AActor* TargetActor; // 0x110(0x08)
	struct UMadDSHeightComponent* HeightComp; // 0x118(0x08)
	struct UBaseCharacterMovementComponent* MovementComp; // 0x120(0x08)
	struct UMadAnimReplication_DesertSciathan* AnimReplComp; // 0x128(0x08)
	char UnknownData_130[0xe0]; // 0x130(0xe0)

	void TaskDSGlideAttackDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_DSGlideAttack.TaskDSGlideAttackDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_DSGlideAttack* CreateDSGlideAttack(struct UObject* WorldContextObject, struct AActor* TargetActor, float AttackAnimDistance, float DistanceBehindTarget, float Height, float Acceleration, float DiveAcceleration, float ClimbAcceleration, float TurnSpeed, float MaxSpeed, float MinSpeed, float ClimbGroundSpeed, float DiveSpeed, float ClimbSpeed, float PredictionTime, float PredictionDistance, bool bEndInGlide); // Function Madness.MadAIAbilityTask_DSGlideAttack.CreateDSGlideAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x153ddf0
	bool CanHitTargetWithGlideAttack(struct UMadAIGameplayAbility* OwningAbility, struct AActor* Target, float MinDistance, float MaxDistance, float MaxAngle, float MinSpeed, float MinHeight, bool bMustGlide); // Function Madness.MadAIAbilityTask_DSGlideAttack.CanHitTargetWithGlideAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x153d280
	void AnimationFinished(); // Function Madness.MadAIAbilityTask_DSGlideAttack.AnimationFinished // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x153d260
	void AnimationFailed(); // Function Madness.MadAIAbilityTask_DSGlideAttack.AnimationFailed // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x153d240
};

// Class Madness.MadDataAsset_SFThrowProjectileVariants
// Size: 0x40 (Inherited: 0x30)
struct UMadDataAsset_SFThrowProjectileVariants : UDataAsset {
	struct TArray<struct FMadAI_SFThrowEntry> Variants; // 0x30(0x10)
};

// Class Madness.MadAIAbilityTask_FSThrowProjectile
// Size: 0x420 (Inherited: 0x90)
struct UMadAIAbilityTask_FSThrowProjectile : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyBegin; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyEnd; // 0xd0(0x10)
	char UnknownData_E0[0x340]; // 0xe0(0x340)

	struct UMadAIAbilityTask_FSThrowProjectile* ThrowSFProjectile(struct UObject* WorldContextObject, struct UFWAIWeaponComponent* WeaponComponent); // Function Madness.MadAIAbilityTask_FSThrowProjectile.ThrowSFProjectile // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x153f950
	void TaskFSThrowProjectileNotifyDelegate__DelegateSignature(struct FName NotifyName); // DelegateFunction Madness.MadAIAbilityTask_FSThrowProjectile.TaskFSThrowProjectileNotifyDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void TaskFSThrowProjectileDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_FSThrowProjectile.TaskFSThrowProjectileDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void SpawnNextProjectile(); // Function Madness.MadAIAbilityTask_FSThrowProjectile.SpawnNextProjectile // (Final|Native|Protected) // @ game+0x153f930
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_FSThrowProjectile.OnMontageInterrupted // (Final|Native|Public) // @ game+0x153f4d0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_FSThrowProjectile.OnMontageEnded // (Final|Native|Public) // @ game+0x153f3a0
	void OnAbilityAnimNotifyEnd(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_FSThrowProjectile.OnAbilityAnimNotifyEnd // (Final|Native|Public) // @ game+0x153ec60
	void OnAbilityAnimNotifyBegin(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_FSThrowProjectile.OnAbilityAnimNotifyBegin // (Final|Native|Public) // @ game+0x153eb60
	bool CanThrowSFProjectile(struct UFWAIWeaponComponent* WeaponComponent, struct UMadDataAsset_SFThrowProjectileVariants* AnimVariants); // Function Madness.MadAIAbilityTask_FSThrowProjectile.CanThrowSFProjectile // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x153d4b0
};

// Class Madness.FWSpaceWrappingDestinationProvider_SFThrowProjectile
// Size: 0x28 (Inherited: 0x28)
struct UFWSpaceWrappingDestinationProvider_SFThrowProjectile : UFWSpaceWrappingDestinationProvider {
};

// Class Madness.MadAIAbilityTask_IntervalTick
// Size: 0xb0 (Inherited: 0x90)
struct UMadAIAbilityTask_IntervalTick : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnTickTask; // 0x90(0x10)
	float TimerInterval; // 0xa0(0x04)
	float TimerRandomDeviation; // 0xa4(0x04)
	float TimerNextActivationTime; // 0xa8(0x04)
	char UnknownData_AC[0x4]; // 0xac(0x04)

	struct UMadAIAbilityTask_IntervalTick* IntervalTick(struct UMadAIGameplayAbility* OwningAbility, float InTimerInterval, float InTimerRandomDeviation); // Function Madness.MadAIAbilityTask_IntervalTick.IntervalTick // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1542150
};

// Class Madness.Mad_PAAnomalyEruptionDamage
// Size: 0x370 (Inherited: 0x2f0)
struct AMad_PAAnomalyEruptionDamage : AActor {
	struct UMadDamageType* DamageType; // 0x2f0(0x08)
	float DelayToStart; // 0x2f8(0x04)
	float DelayToEnd; // 0x2fc(0x04)
	struct FScalableFloat DamageDurationScale; // 0x300(0x20)
	struct FScalableFloat DamageIntervalScale; // 0x320(0x20)
	float ScaleMultiplier; // 0x340(0x04)
	char UnknownData_344[0x4]; // 0x344(0x04)
	struct AFWAIController* OwnerAI; // 0x348(0x08)
	struct TArray<struct FPAAnomalyEruption_OverlappingActors> OverlappingActors; // 0x350(0x10)
	char UnknownData_360[0x10]; // 0x360(0x10)

	void OnOverlapEnd(struct AActor* MyActor, struct AActor* OtherActor); // Function Madness.Mad_PAAnomalyEruptionDamage.OnOverlapEnd // (Final|Native|Protected) // @ game+0x1542eb0
	void OnOverlapBegin(struct AActor* MyActor, struct AActor* OtherActor); // Function Madness.Mad_PAAnomalyEruptionDamage.OnOverlapBegin // (Final|Native|Protected) // @ game+0x1542c70
	void OnDamagingStop(); // Function Madness.Mad_PAAnomalyEruptionDamage.OnDamagingStop // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void OnDamagingStart(); // Function Madness.Mad_PAAnomalyEruptionDamage.OnDamagingStart // (BlueprintAuthorityOnly|Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	float GetEffectLifeTime(); // Function Madness.Mad_PAAnomalyEruptionDamage.GetEffectLifeTime // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1542110
};

// Class Madness.Mad_PAAnomalyEruptionTrail
// Size: 0x3a8 (Inherited: 0x2f0)
struct AMad_PAAnomalyEruptionTrail : AActor {
	float Speed; // 0x2f0(0x04)
	char UnknownData_2F4[0x4]; // 0x2f4(0x04)
	struct AMad_PAAnomalyEruptionDamage* DamageActorClass; // 0x2f8(0x08)
	int32_t ExtraSpawnCount; // 0x300(0x04)
	float RadiusMin; // 0x304(0x04)
	float RadiusMax; // 0x308(0x04)
	float DeltaAngleMin; // 0x30c(0x04)
	float DeltaAngleMax; // 0x310(0x04)
	float DamageScaleDown; // 0x314(0x04)
	char UnknownData_318_0 : 7; // 0x318(0x01)
	bool bDamage : 1; // 0x318(0x01)
	char UnknownData_319[0x7]; // 0x319(0x07)
	struct UMadDamageType* DamageType; // 0x320(0x08)
	float ExtraLifeTime; // 0x328(0x04)
	char UnknownData_32C[0x4]; // 0x32c(0x04)
	struct FMulticastInlineDelegate OnStart; // 0x330(0x10)
	struct FMulticastInlineDelegate OnMoving; // 0x340(0x10)
	struct FMulticastInlineDelegate OnFinish; // 0x350(0x10)
	char UnknownData_360[0x4]; // 0x360(0x04)
	struct FVector Destination; // 0x364(0x0c)
	struct AFWAIController* OwnerAI; // 0x370(0x08)
	char UnknownData_378[0x30]; // 0x378(0x30)

	void PAAnomalyEruptionTrailDelegate__DelegateSignature(); // DelegateFunction Madness.Mad_PAAnomalyEruptionTrail.PAAnomalyEruptionTrailDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnOverlapBegin(struct AActor* MyActor, struct AActor* OtherActor); // Function Madness.Mad_PAAnomalyEruptionTrail.OnOverlapBegin // (Final|Native|Protected) // @ game+0x1542d30
	void OnArrived(); // Function Madness.Mad_PAAnomalyEruptionTrail.OnArrived // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	bool IsMoving(); // Function Madness.Mad_PAAnomalyEruptionTrail.IsMoving // (Final|Native|Private|BlueprintCallable|BlueprintPure|Const) // @ game+0x1542240
};

// Class Madness.MadAIAbilityTask_PAAnomalyEruption
// Size: 0x138 (Inherited: 0x90)
struct UMadAIAbilityTask_PAAnomalyEruption : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	char UnknownData_C0[0x50]; // 0xc0(0x50)
	struct TArray<struct AMad_PAAnomalyEruptionTrail*> Trails; // 0x110(0x10)
	char UnknownData_120[0x18]; // 0x120(0x18)

	void TaskPAAnomalyEruptionDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_PAAnomalyEruption.TaskPAAnomalyEruptionDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_PAAnomalyEruption* PAAnomalyEruption(struct UObject* WorldContextObject, float MaxDistance, struct AMad_PAAnomalyEruptionTrail* EruptionTrailClass, struct FMontageAssetSelector Montage, float PredictionTime, float PredictionMaxDistance, struct FName StartBoneName, struct FName NotifySpawnName, struct FName NotifyMoveName); // Function Madness.MadAIAbilityTask_PAAnomalyEruption.PAAnomalyEruption // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1542f70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_PAAnomalyEruption.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x1542c30
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_PAAnomalyEruption.OnMontageEnded // (Final|Native|Protected) // @ game+0x15429c0
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_PAAnomalyEruption.OnAnimNotify // (Final|Native|Protected) // @ game+0x1542270
	bool CanUsePAAnomalyEruption(struct UMadAIGameplayAbility* OwningAbility, float MaxDistance); // Function Madness.MadAIAbilityTask_PAAnomalyEruption.CanUsePAAnomalyEruption // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1541e00
};

// Class Madness.Mad_PAAnomalySlashTrail
// Size: 0x350 (Inherited: 0x2f0)
struct AMad_PAAnomalySlashTrail : AActor {
	float Speed; // 0x2f0(0x04)
	float TurnSpeed; // 0x2f4(0x04)
	float ExtraLifeTime; // 0x2f8(0x04)
	char UnknownData_2FC[0x4]; // 0x2fc(0x04)
	struct UMadDamageType* DamageType; // 0x300(0x08)
	char UnknownData_308[0x8]; // 0x308(0x08)
	struct AFWAIController* OwnerAI; // 0x310(0x08)
	struct APawn* TargetActor; // 0x318(0x08)
	char UnknownData_320[0x30]; // 0x320(0x30)

	void OnOverlapBegin(struct AActor* MyActor, struct AActor* OtherActor); // Function Madness.Mad_PAAnomalySlashTrail.OnOverlapBegin // (Final|Native|Protected) // @ game+0x1542df0
	void OnArrived(); // Function Madness.Mad_PAAnomalySlashTrail.OnArrived // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
};

// Class Madness.MadAIAbilityTask_PAAnomalySlash
// Size: 0x120 (Inherited: 0x90)
struct UMadAIAbilityTask_PAAnomalySlash : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	char UnknownData_C0[0x10]; // 0xc0(0x10)
	struct UAnimMontage* MontageAsset; // 0xd0(0x08)
	char UnknownData_D8[0x48]; // 0xd8(0x48)

	void TaskPAAnomalySlashDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_PAAnomalySlash.TaskPAAnomalySlashDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_PAAnomalySlash* PAAnomalySlash(struct UObject* WorldContextObject, float MaxDistance, struct AMad_PAAnomalySlashTrail* SlashTrailClass, struct UAnimMontage* Montage, struct TArray<struct FPAAnomalySlash_MontageSection> MontageSections, struct FName StartBoneName, struct FName NotifyName, float PredictionTime, float PredictionDistance); // Function Madness.MadAIAbilityTask_PAAnomalySlash.PAAnomalySlash // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1543210
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_PAAnomalySlash.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x153f470
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_PAAnomalySlash.OnMontageEnded // (Final|Native|Protected) // @ game+0x1542a90
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_PAAnomalySlash.OnAnimNotify // (Final|Native|Protected) // @ game+0x1542370
	bool CanUsePAAnomalySlash(struct UMadAIGameplayAbility* OwningAbility, float MinDistance, float MaxDistance, float TestDuration); // Function Madness.MadAIAbilityTask_PAAnomalySlash.CanUsePAAnomalySlash // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1541ed0
};

// Class Madness.MadAIAbilityTask_PAMotherTouch
// Size: 0x118 (Inherited: 0x90)
struct UMadAIAbilityTask_PAMotherTouch : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	char UnknownData_C0[0x58]; // 0xc0(0x58)

	void TaskPAMotherTouchDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_PAMotherTouch.TaskPAMotherTouchDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_PAMotherTouch* PAMotherTouch(struct UObject* WorldContextObject, struct TArray<struct UGameplayEffect*> EffectsToApply, struct UFWAIArchetype* MinionArchetype, struct FMontageAssetSelector Montage, struct FName NotifyName); // Function Madness.MadAIAbilityTask_PAMotherTouch.PAMotherTouch // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x15434d0
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_PAMotherTouch.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x1526ed0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_PAMotherTouch.OnMontageEnded // (Final|Native|Protected) // @ game+0x1526e00
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_PAMotherTouch.OnAnimNotify // (Final|Native|Protected) // @ game+0x1542470
	bool CanUsePAMotherTouch(struct UMadAIGameplayAbility* OwningAbility, struct UFWAIArchetype* MinionArchetype, bool bIgnoreGland); // Function Madness.MadAIAbilityTask_PAMotherTouch.CanUsePAMotherTouch // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1542000
};

// Class Madness.MadAIAbilityTask_PerforateCharge
// Size: 0x150 (Inherited: 0x90)
struct UMadAIAbilityTask_PerforateCharge : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnPlayChargeAnimation; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnPlayAttackAnimation; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnPlayHitAnimation; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnPlayMissAnimation; // 0xe0(0x10)
	struct FMulticastInlineDelegate OnPlayAbortAnimation; // 0xf0(0x10)
	struct FMulticastInlineDelegate OnBoom; // 0x100(0x10)
	struct AActor* TargetActor; // 0x110(0x08)
	char UnknownData_118[0x38]; // 0x118(0x38)

	void TaskPerforateCharge__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_PerforateCharge.TaskPerforateCharge__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_PerforateCharge* PerforateCharge(struct UObject* WorldContextObject, struct AActor* Target, struct FName BoomNotify, float MaxChargeDistance, float AttackMinDistance, float AttackMaxDistance, float AbortDistance, float AttackMaxAngle, float PredictionTime, float PredictionDistance, bool bSelectAttackTime, bool bEarlyAbortIfCantReachTarget, bool bAbortIfOutOfRange); // Function Madness.MadAIAbilityTask_PerforateCharge.PerforateCharge // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1543a00
	void OnDamageDone(struct AMadBaseCharacter* Enemy, struct FTakeHitInfo TakeHitInfo); // Function Madness.MadAIAbilityTask_PerforateCharge.OnDamageDone // (Final|Native|Protected) // @ game+0x1542670
	void OnAnimNotify(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_PerforateCharge.OnAnimNotify // (Final|Native|Protected) // @ game+0x1542570
	bool CanHitTargetWithPerforateCharge(struct UMadAIGameplayAbility* OwningAbility, struct AActor* Target, float MinDistance, float MaxDistance, float MaxAngle, float PredictionTime, float PredictionDistance); // Function Madness.MadAIAbilityTask_PerforateCharge.CanHitTargetWithPerforateCharge // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1541b10
	void AnimationFinished(); // Function Madness.MadAIAbilityTask_PerforateCharge.AnimationFinished // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x15418c0
	void AnimationFailed(enum class EPerforateChargeState FailedInState); // Function Madness.MadAIAbilityTask_PerforateCharge.AnimationFailed // (Final|BlueprintAuthorityOnly|Native|Public|BlueprintCallable) // @ game+0x1541840
};

// Class Madness.MadAIAbilityTask_PAPerforateCharge
// Size: 0x150 (Inherited: 0x150)
struct UMadAIAbilityTask_PAPerforateCharge : UMadAIAbilityTask_PerforateCharge {

	struct UMadAIAbilityTask_PAPerforateCharge* PAPerforateCharge(struct UObject* WorldContextObject, struct AActor* Target, struct FName BoomNotify, float MaxChargeDistance, float AttackMinDistance, float AttackMaxDistance, float AbortDistance, float AttackMaxAngle, float PredictionTime, float PredictionDistance, bool bSelectAttackTime, bool bEarlyAbortIfCantReachTarget); // Function Madness.MadAIAbilityTask_PAPerforateCharge.PAPerforateCharge // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x15436c0
	bool CanHitTargetWithPAPerforateCharge(struct UMadAIGameplayAbility* OwningAbility, struct AActor* Target, float MinDistance, float MaxDistance, float MaxAngle, float PredictionTime, float PredictionDistance, bool bIgnoreGland); // Function Madness.MadAIAbilityTask_PAPerforateCharge.CanHitTargetWithPAPerforateCharge // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x15418e0
};

// Class Madness.MadDataAsset_Dodges
// Size: 0x40 (Inherited: 0x30)
struct UMadDataAsset_Dodges : UDataAsset {
	struct TArray<struct FMadAI_SingleDodge> Variants; // 0x30(0x10)
};

// Class Madness.MadAIAbilityTask_PlayDodgeAnim
// Size: 0xf8 (Inherited: 0x90)
struct UMadAIAbilityTask_PlayDodgeAnim : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	struct UMadDataAsset_Dodges* AnimDataAsset; // 0xc0(0x08)
	char UnknownData_C8[0x30]; // 0xc8(0x30)

	void TaskPlayDodgeAnimDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_PlayDodgeAnim.TaskPlayDodgeAnimDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_PlayDodgeAnim* PlayDodgeAnim(struct UObject* WorldContextObject, struct UMadDataAsset_Dodges* AnimDataAsset, int32_t AssetIndex); // Function Madness.MadAIAbilityTask_PlayDodgeAnim.PlayDodgeAnim // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1543d90
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_PlayDodgeAnim.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x1542c50
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_PlayDodgeAnim.OnMontageEnded // (Final|Native|Protected) // @ game+0x1542b60
	bool CanPlayDodgeAnim(struct AActor* Target, struct UMadDataAsset_Dodges* AnimDataAsset, int32_t OutAnimIndex); // Function Madness.MadAIAbilityTask_PlayDodgeAnim.CanPlayDodgeAnim // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1541d00
};

// Class Madness.MadAIAbilityTask_RequestAISpawn
// Size: 0xd0 (Inherited: 0x90)
struct UMadAIAbilityTask_RequestAISpawn : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnAISpawn; // 0x90(0x10)
	char UnknownData_A0[0x30]; // 0xa0(0x30)

	struct UMadAIAbilityTask_RequestAISpawn* RequestAISpawn(struct UObject* WorldContextObject, struct AActor* Instigator, struct UFWAIArchetype* AIArchetype, struct FVector SpawnLocation, struct FRotator SpawnRotation, enum class ETeam SpawnTeam, bool bDisableCollision); // Function Madness.MadAIAbilityTask_RequestAISpawn.RequestAISpawn // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x1543e80
};

// Class Madness.MadAIAbilityTask_RotateToFaceActor
// Size: 0xd8 (Inherited: 0x90)
struct UMadAIAbilityTask_RotateToFaceActor : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnCancelled; // 0x90(0x10)
	struct FMulticastInlineDelegate OnComplete; // 0xa0(0x10)
	struct AActor* TargetActor; // 0xb0(0x08)
	char UnknownData_B8[0x20]; // 0xb8(0x20)

	void TaskRotateToFaceDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_RotateToFaceActor.TaskRotateToFaceDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	struct UMadAIAbilityTask_RotateToFaceActor* RotateToFaceActor(struct UMadAIGameplayAbility* WorldContextObject, struct AActor* TargetActor, float Precision, float ConeAngle, bool UseControllerDesiredRotation); // Function Madness.MadAIAbilityTask_RotateToFaceActor.RotateToFaceActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154a780
};

// Class Madness.MadAIAbilityTask_RotateTowardActor
// Size: 0xa8 (Inherited: 0x90)
struct UMadAIAbilityTask_RotateTowardActor : UMadAIAbilityTask {
	struct AActor* TargetActor; // 0x90(0x08)
	char UnknownData_98[0x10]; // 0x98(0x10)

	struct UMadAIAbilityTask_RotateTowardActor* RotateTowardActor(struct UObject* WorldContextObject, struct AActor* TargetActor, float YawSpeed); // Function Madness.MadAIAbilityTask_RotateTowardActor.RotateTowardActor // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154a900
};

// Class Madness.MadAIAbilityTask_SciathanFlyByTarget
// Size: 0xc0 (Inherited: 0x90)
struct UMadAIAbilityTask_SciathanFlyByTarget : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnTaskFinished; // 0x90(0x10)
	char UnknownData_A0[0x8]; // 0xa0(0x08)
	struct AActor* Target; // 0xa8(0x08)
	char UnknownData_B0[0x10]; // 0xb0(0x10)

	struct UMadAIAbilityTask_SciathanFlyByTarget* SciathanFlyByTarget(struct UMadAIGameplayAbility* OwningAbility, struct AActor* TargetActor); // Function Madness.MadAIAbilityTask_SciathanFlyByTarget.SciathanFlyByTarget // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154aa00
};

// Class Madness.MadAIAbilityTask_SMMeleeAttack
// Size: 0x138 (Inherited: 0x90)
struct UMadAIAbilityTask_SMMeleeAttack : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnAIAnimNotify; // 0x90(0x10)
	struct FMulticastInlineDelegate OnComplete; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xb0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xc0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyBegin; // 0xd0(0x10)
	struct FMulticastInlineDelegate OnAbilityNotifyEnd; // 0xe0(0x10)
	char UnknownData_F0[0x8]; // 0xf0(0x08)
	struct AActor* TargetActor; // 0xf8(0x08)
	struct UMadDataAsset_SMMeleeAttacks* AnimDataAsset; // 0x100(0x08)
	char UnknownData_108[0x30]; // 0x108(0x30)

	void TaskSMMeleeAttackDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_SMMeleeAttack.TaskSMMeleeAttackDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void TaskSMMeleeAttackAnimNotifyDelegate__DelegateSignature(struct UFWAnimNotify* AnimNotify, struct FName NotifyName); // DelegateFunction Madness.MadAIAbilityTask_SMMeleeAttack.TaskSMMeleeAttackAnimNotifyDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void TaskSMMeleeAttackAbilityNotifyDelegate__DelegateSignature(struct UMadAIMeleeAttack* MeleeAttack, struct FName NotifyName); // DelegateFunction Madness.MadAIAbilityTask_SMMeleeAttack.TaskSMMeleeAttackAbilityNotifyDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_SMMeleeAttack.OnMontageInterrupted // (Final|Native|Protected) // @ game+0x154a5e0
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_SMMeleeAttack.OnMontageEnded // (Final|Native|Protected) // @ game+0x154a440
	void OnAnimNotifyEarlyExit(struct UFWAnimNotify* AnimNotify, struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_SMMeleeAttack.OnAnimNotifyEarlyExit // (Final|Native|Protected) // @ game+0x154a2f0
	void OnAbilityAnimNotifyEnd(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_SMMeleeAttack.OnAbilityAnimNotifyEnd // (Final|Native|Protected) // @ game+0x154a0f0
	void OnAbilityAnimNotifyBegin(struct FName NotifyNameIn, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_SMMeleeAttack.OnAbilityAnimNotifyBegin // (Final|Native|Protected) // @ game+0x1549ff0
	struct UMadAIAbilityTask_SMMeleeAttack* CreateSMMeleeAttack(struct UObject* WorldContextObject, struct AActor* TargetActor, struct UMadDataAsset_SMMeleeAttacks* AnimDataAsset); // Function Madness.MadAIAbilityTask_SMMeleeAttack.CreateSMMeleeAttack // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x15497f0
};

// Class Madness.MadDataAsset_ThrowSequentialProjectilesVariants
// Size: 0x48 (Inherited: 0x30)
struct UMadDataAsset_ThrowSequentialProjectilesVariants : UDataAsset {
	struct TArray<struct FMadAI_SequentialThrowEntry> Variants; // 0x30(0x10)
	float MaxAttackDistanceIncreased; // 0x40(0x04)
	char UnknownData_44[0x4]; // 0x44(0x04)
};

// Class Madness.MadAIAbilityTask_ThrowSequentialProjectiles
// Size: 0x110 (Inherited: 0x90)
struct UMadAIAbilityTask_ThrowSequentialProjectiles : UMadAIAbilityTask {
	struct FMulticastInlineDelegate OnComplete; // 0x90(0x10)
	struct FMulticastInlineDelegate OnInterrupted; // 0xa0(0x10)
	struct FMulticastInlineDelegate OnCancelled; // 0xb0(0x10)
	char UnknownData_C0_0 : 7; // 0xc0(0x01)
	bool bDidMoveDuringTask : 1; // 0xc0(0x01)
	char UnknownData_C1[0x4f]; // 0xc1(0x4f)

	struct UMadAIAbilityTask_ThrowSequentialProjectiles* ThrowSequentialProjectiles(struct UObject* WorldContextObject, struct UFWAIWeaponComponent* WeaponComponent); // Function Madness.MadAIAbilityTask_ThrowSequentialProjectiles.ThrowSequentialProjectiles // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154ab80
	void TaskThrowSequentialProjectilesDelegate__DelegateSignature(); // DelegateFunction Madness.MadAIAbilityTask_ThrowSequentialProjectiles.TaskThrowSequentialProjectilesDelegate__DelegateSignature // (MulticastDelegate|Public|Delegate) // @ game+0x1a35c70
	void OnMontageInterrupted(); // Function Madness.MadAIAbilityTask_ThrowSequentialProjectiles.OnMontageInterrupted // (Final|Native|Public) // @ game+0x154a600
	void OnMontageEnded(struct UAnimMontage* Montage, bool bInterrupted); // Function Madness.MadAIAbilityTask_ThrowSequentialProjectiles.OnMontageEnded // (Final|Native|Public) // @ game+0x154a510
	void OnAnimNotify(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAIAbilityTask_ThrowSequentialProjectiles.OnAnimNotify // (Final|Native|Public) // @ game+0x154a1f0
	bool CanThrowSequentialProjectiles(struct UFWAIWeaponComponent* WeaponComponent, struct UMadDataAsset_ThrowSequentialProjectilesVariants* AnimVariants, bool bCanUseHeavyVariant); // Function Madness.MadAIAbilityTask_ThrowSequentialProjectiles.CanThrowSequentialProjectiles // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x1549390
};

// Class Madness.FWSpaceWrappingDestinationProvider_ThrowProjectile
// Size: 0x28 (Inherited: 0x28)
struct UFWSpaceWrappingDestinationProvider_ThrowProjectile : UFWSpaceWrappingDestinationProvider {
};

// Class Madness.MadAIBlueprintLibrary
// Size: 0x28 (Inherited: 0x28)
struct UMadAIBlueprintLibrary : UBlueprintFunctionLibrary {

	void SetHealthBarVisible(struct APawn* Pawn, bool bVisible); // Function Madness.MadAIBlueprintLibrary.SetHealthBarVisible // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154aac0
	void RestoreFullHealth(struct APawn* Pawn); // Function Madness.MadAIBlueprintLibrary.RestoreFullHealth // (Final|Native|Static|Public|BlueprintCallable) // @ game+0x154a710
	void RemoveLooseGameplayTag(struct APawn* Pawn, struct FGameplayTagContainer Tags); // Function Madness.MadAIBlueprintLibrary.RemoveLooseGameplayTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x154a620
	struct FVector GetTargetingLocation(struct UAIPerceptionComponent* PerceptionComponent, struct AActor* Target); // Function Madness.MadAIBlueprintLibrary.GetTargetingLocation // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1549f20
	bool GetRandomReachablePointInVolume(struct APawn* Pawn, struct FVector Centre, float Radius, struct AVolume* Volume, struct FVector ResultLocation, float RadiusMultipler, float ExtraRadius); // Function Madness.MadAIBlueprintLibrary.GetRandomReachablePointInVolume // (Final|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure) // @ game+0x1549d10
	bool GetInterceptTime(float ShotSpeed, struct FVector StartPos, struct FVector TargetPos, struct FVector TargetVelocity, float InterceptTime); // Function Madness.MadAIBlueprintLibrary.GetInterceptTime // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1549b30
	float EvaluateRandomForLevel(struct APawn* Pawn, struct FScalableFloat Min, struct FScalableFloat Max); // Function Madness.MadAIBlueprintLibrary.EvaluateRandomForLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15499e0
	float EvaluateForLevel(struct APawn* Pawn, struct FScalableFloat ScalableFloat); // Function Madness.MadAIBlueprintLibrary.EvaluateForLevel // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x15498e0
	bool CheckIfProjectileArcSectionCollides(struct UObject* WorldContextObject, struct TArray<struct AActor*> IgnoreActors, struct FVector StartPos, struct FVector EndPos, struct FVector StartVelocity, float StartTime, float EndTime, float SphereRadius, struct AActor* HitActor, float DistanceToIgnorePawns, bool DoTraceToEndPos); // Function Madness.MadAIBlueprintLibrary.CheckIfProjectileArcSectionCollides // (Final|BlueprintAuthorityOnly|Native|Static|Public|HasOutParms|HasDefaults|BlueprintCallable) // @ game+0x1549480
	bool CanHitTargetUsingAIAbility(struct FGameplayTagContainer GameplayAbilityTag, struct ABaseCharacter* Owner, struct AActor* TargetActor, bool UseIdealYawRotationToTarget); // Function Madness.MadAIBlueprintLibrary.CanHitTargetUsingAIAbility // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1549200
	bool CanActivateAIAbility(struct FGameplayTagContainer GameplayAbilityTag, struct ABaseCharacter* Owner); // Function Madness.MadAIBlueprintLibrary.CanActivateAIAbility // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x15490e0
	void AddLooseGameplayTag(struct APawn* Pawn, struct FGameplayTagContainer Tags); // Function Madness.MadAIBlueprintLibrary.AddLooseGameplayTag // (Final|Native|Static|Public|HasOutParms|BlueprintCallable) // @ game+0x1548ff0
};

// Class Madness.MadAIRank_Common
// Size: 0x28 (Inherited: 0x28)
struct UMadAIRank_Common : UFWAIRank {
};

// Class Madness.MadAIRank_Elite
// Size: 0x28 (Inherited: 0x28)
struct UMadAIRank_Elite : UFWAIRank {
};

// Class Madness.MadAIRank_Leader
// Size: 0x28 (Inherited: 0x28)
struct UMadAIRank_Leader : UFWAIRank {
};

// Class Madness.MadAIRank_Boss
// Size: 0x28 (Inherited: 0x28)
struct UMadAIRank_Boss : UFWAIRank {
};

// Class Madness.MadAIFaction_Creature
// Size: 0x28 (Inherited: 0x28)
struct UMadAIFaction_Creature : UFWAIFaction {
};

// Class Madness.MadAIFaction_Ally
// Size: 0x28 (Inherited: 0x28)
struct UMadAIFaction_Ally : UFWAIFaction {
};

// Class Madness.MadAIArchetype_Ally
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Ally : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_TestNPC
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_TestNPC : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Rifleman
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Rifleman : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Shotgunner
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Shotgunner : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Sniper
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Sniper : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Berserker
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Berserker : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_RadioTelegraphist
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_RadioTelegraphist : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Perforo
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Perforo : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Hound
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Hound : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Lurker
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Lurker : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_SmallLurker
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_SmallLurker : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_LurkerTutorial
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_LurkerTutorial : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Crawler
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Crawler : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Sciathan
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Sciathan : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_SpaceCow
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_SpaceCow : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Captain
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Captain : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_CaptainRifleman
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_CaptainRifleman : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_CaptainShotgunner
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_CaptainShotgunner : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_CaptainSniper
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_CaptainSniper : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_CaptainBerserker
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_CaptainBerserker : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_CaptainHeavygunner
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_CaptainHeavygunner : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Veteran
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Veteran : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Altered
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Altered : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_AlphaPerforo
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_AlphaPerforo : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Ticks
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Ticks : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_SwarnTicks
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_SwarnTicks : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Insect
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Insect : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Boss01
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Boss01 : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_BossForest
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_BossForest : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_Boss02
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_Boss02 : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_VolcanoSpider
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_VolcanoSpider : UFWAIArchetype {
};

// Class Madness.MadAIArchetype_BossYagak
// Size: 0x28 (Inherited: 0x28)
struct UMadAIArchetype_BossYagak : UFWAIArchetype {
};

// Class Madness.MadAIComponent
// Size: 0x1f0 (Inherited: 0x1f0)
struct UMadAIComponent : UFWAIComponent {

	struct AMadAI* GetMadController(); // Function Madness.MadAIComponent.GetMadController // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e610
	struct AMadCharAI* GetCharacter(); // Function Madness.MadAIComponent.GetCharacter // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x154e3c0
};

// Class Madness.MadAIDamageReactionComponent
// Size: 0x1e8 (Inherited: 0x1e0)
struct UMadAIDamageReactionComponent : UFWAIDamageReactionComponent {
	char UnknownData_1E0[0x8]; // 0x1e0(0x08)
};

// Class Madness.MadAIMeleeAttack
// Size: 0x88 (Inherited: 0x28)
struct UMadAIMeleeAttack : UObject {
	struct FName AttackName; // 0x28(0x08)
	struct FMontageAssetSelector Montage; // 0x30(0x20)
	char UnknownData_50_0 : 7; // 0x50(0x01)
	bool bCanBeFirstAttack : 1; // 0x50(0x01)
	char UnknownData_51_0 : 7; // 0x51(0x01)
	bool GlobalCoolDownFromAttackEnd : 1; // 0x51(0x01)
	char UnknownData_52_0 : 7; // 0x52(0x01)
	bool bDisableAttack : 1; // 0x52(0x01)
	char UnknownData_53[0x1]; // 0x53(0x01)
	float COOLDOWN; // 0x54(0x04)
	float GlobalCoolDown; // 0x58(0x04)
	float PredictionDuration; // 0x5c(0x04)
	float PredictionMaxDistance; // 0x60(0x04)
	char UnknownData_64[0x4]; // 0x64(0x04)
	struct TArray<struct UMadAIMeleeAttackCondition*> EnterConditions; // 0x68(0x10)
	struct TArray<struct FMadAINextMeleeAttack> NextAttacks; // 0x78(0x10)
};

// Class Madness.MadDataAsset_SMMeleeAttacks
// Size: 0x50 (Inherited: 0x30)
struct UMadDataAsset_SMMeleeAttacks : UDataAsset {
	struct TArray<struct UMadAIMeleeAttack*> Attacks; // 0x30(0x10)
	float MinDistanceToCheckSq; // 0x40(0x04)
	float MaxPredictionTime; // 0x44(0x04)
	float MaxPredictionDistance; // 0x48(0x04)
	char UnknownData_4C[0x4]; // 0x4c(0x04)
};

// Class Madness.MadAIMeleeAttackCondition
// Size: 0x30 (Inherited: 0x28)
struct UMadAIMeleeAttackCondition : UObject {
	char UnknownData_28[0x8]; // 0x28(0x08)
};

// Class Madness.MadAIMeleeAttackCondition_BPBase
// Size: 0x30 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_BPBase : UMadAIMeleeAttackCondition {

	struct FVector PredictPosition(struct FMadAIMeleeAttackRuntime RunTime, enum class EMAPredictionMode PredictionMode, struct UMadAIMeleeAttack* Attack, struct AActor* Owner, struct AActor* Target); // Function Madness.MadAIMeleeAttackCondition_BPBase.PredictPosition // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x154f2c0
	struct FString GetFailureString(struct FMadAIMeleeAttackRuntime RunTime, struct UMadAIMeleeAttack* Attack, struct AActor* Owner, struct AActor* Target); // Function Madness.MadAIMeleeAttackCondition_BPBase.GetFailureString // (Native|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x154e3f0
	bool EvalInt(enum class EAttackConditionRelation Relation, int32_t T1, int32_t T2); // Function Madness.MadAIMeleeAttackCondition_BPBase.EvalInt // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x154e130
	bool EvalFloat(enum class EAttackConditionRelation Relation, float T1, float T2); // Function Madness.MadAIMeleeAttackCondition_BPBase.EvalFloat // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x154e030
	bool CanExecute(struct FMadAIMeleeAttackRuntime RunTime, struct UMadAIMeleeAttack* Attack, struct AActor* Owner, struct AActor* Target); // Function Madness.MadAIMeleeAttackCondition_BPBase.CanExecute // (Native|Event|Public|HasOutParms|BlueprintEvent|Const) // @ game+0x154db90
};

// Class Madness.MadAIMeleeAttackCondition_Distance
// Size: 0x40 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_Distance : UMadAIMeleeAttackCondition {
	float MinDistance; // 0x30(0x04)
	float MaxDistance; // 0x34(0x04)
	enum class EMAPredictionMode PredictionMode; // 0x38(0x01)
	char UnknownData_39[0x7]; // 0x39(0x07)
};

// Class Madness.MadAIMeleeAttackCondition_Direction
// Size: 0x40 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_Direction : UMadAIMeleeAttackCondition {
	float Angle; // 0x30(0x04)
	float AngleRange; // 0x34(0x04)
	enum class EMAPredictionMode PredictionMode; // 0x38(0x01)
	char UnknownData_39[0x7]; // 0x39(0x07)
};

// Class Madness.MadAIMeleeAttackCondition_DirectPath
// Size: 0x38 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_DirectPath : UMadAIMeleeAttackCondition {
	enum class EMAPredictionMode PredictionMode; // 0x30(0x01)
	char UnknownData_31[0x7]; // 0x31(0x07)
};

// Class Madness.MadAIMeleeAttackCondition_BlockedByOthers
// Size: 0x38 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_BlockedByOthers : UMadAIMeleeAttackCondition {
	enum class EMAPredictionMode PredictionMode; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	float SizeMultipler; // 0x34(0x04)
};

// Class Madness.MadAIMeleeAttackCondition_ChainLength
// Size: 0x38 (Inherited: 0x30)
struct UMadAIMeleeAttackCondition_ChainLength : UMadAIMeleeAttackCondition {
	enum class EAttackConditionRelation Relation; // 0x30(0x01)
	char UnknownData_31[0x3]; // 0x31(0x03)
	int32_t Value; // 0x34(0x04)
};

// Class Madness.MadAIMetrics
// Size: 0x58 (Inherited: 0x50)
struct UMadAIMetrics : UFWAIMetrics {
	enum class EFWDiscreteDistance MinCoverDistanceToTarget; // 0x50(0x01)
	enum class EFWDiscreteDistance MaxCoverDistanceToTarget; // 0x51(0x01)
	char UnknownData_52[0x6]; // 0x52(0x06)
};

// Class Madness.MadAIDataProvider_Metrics
// Size: 0x30 (Inherited: 0x28)
struct UMadAIDataProvider_Metrics : UAIDataProvider {
	float MinBestCoverDistanceToTarget; // 0x28(0x04)
	float MaxBestCoverDistanceToTarget; // 0x2c(0x04)
};

// Class Madness.MadAIRes_AnomalyShieldDestroyed
// Size: 0x150 (Inherited: 0x70)
struct UMadAIRes_AnomalyShieldDestroyed : UFWAIResponse {
	struct FScalableFloat HealthPercentToDestroyScale; // 0x70(0x20)
	struct FGameplayTagContainer AnomalyShieldTag; // 0x90(0x20)
	struct FMontageAssetSelector DestroyedMontage; // 0xb0(0x20)
	struct FName MeshColorParameter; // 0xd0(0x08)
	struct FVector MinBrightGlowColor; // 0xd8(0x0c)
	struct FVector MaxBrightGlowColor; // 0xe4(0x0c)
	struct FVector BlinkBrightGlowColor; // 0xf0(0x0c)
	char UnknownData_FC[0x4]; // 0xfc(0x04)
	struct TArray<struct UGameplayEffect*> RemoveEffectsOnDestroy; // 0x100(0x10)
	struct TArray<struct UGameplayEffect*> ApplyEffectsOnDestroy; // 0x110(0x10)
	float BlinkOnDelay; // 0x120(0x04)
	float BlinkOffDelay; // 0x124(0x04)
	char UnknownData_128_0 : 7; // 0x128(0x01)
	bool bRequestSprintMovementOnDestroy : 1; // 0x128(0x01)
	char UnknownData_129[0x7]; // 0x129(0x07)
	struct UMadAbilitySystemComponent* AbilityComp; // 0x130(0x08)
	char UnknownData_138[0x18]; // 0x138(0x18)
};

// Class Madness.MadAIRes_AvoidEnemyProjectile
// Size: 0x98 (Inherited: 0x70)
struct UMadAIRes_AvoidEnemyProjectile : UFWAIResponse {
	char UnknownData_70[0x28]; // 0x70(0x28)

	void OnProjectile(struct FVector EventOrigin, struct AProjectile* ProjectileClass, struct FName Info, struct FVector Direction); // Function Madness.MadAIRes_AvoidEnemyProjectile.OnProjectile // (Final|Native|Public|HasOutParms|HasDefaults) // @ game+0x154f140
};

// Class Madness.MadAIRes_ChangeCoverAfterDamage
// Size: 0x118 (Inherited: 0x70)
struct UMadAIRes_ChangeCoverAfterDamage : UFWAIResponse {
	char UnknownData_70[0x1c]; // 0x70(0x1c)
	float ChangeCoverAfterDamageQueryRepeatTime; // 0x8c(0x04)
	struct FScalableFloat HealthPercentScale; // 0x90(0x20)
	struct FScalableFloat DamageDurationScale; // 0xb0(0x20)
	float MinTimeInCurrentCover; // 0xd0(0x04)
	char UnknownData_D4_0 : 7; // 0xd4(0x01)
	bool bCanMoveWhileTargeted : 1; // 0xd4(0x01)
	char UnknownData_D5_0 : 7; // 0xd5(0x01)
	bool bCanMoveMidAbility : 1; // 0xd5(0x01)
	char UnknownData_D6[0x42]; // 0xd6(0x42)
};

// Class Madness.MadAIRes_Damage
// Size: 0x90 (Inherited: 0x80)
struct UMadAIRes_Damage : UFWAIRes_Damage {
	char UnknownData_80[0x10]; // 0x80(0x10)
};

// Class Madness.MadAITask_DSChangeHeight
// Size: 0xb8 (Inherited: 0x98)
struct UMadAITask_DSChangeHeight : UFWAITask {
	struct UMadDSHeightComponent* HeightComponent; // 0x98(0x08)
	char UnknownData_A0[0x18]; // 0xa0(0x18)
};

// Class Madness.MadAITask_DSFallToGround
// Size: 0xe0 (Inherited: 0xb8)
struct UMadAITask_DSFallToGround : UMadAITask_DSChangeHeight {
	struct FMulticastInlineDelegate OnReachedGround; // 0xb8(0x10)
	char UnknownData_C8[0x18]; // 0xc8(0x18)
};

// Class Madness.MadAIRes_DSFallToGround
// Size: 0x178 (Inherited: 0x70)
struct UMadAIRes_DSFallToGround : UFWAIResponse {
	struct FScalableFloat Duration1PlayerScale; // 0x70(0x20)
	struct FScalableFloat DamageFraction1PlayerScale; // 0x90(0x20)
	struct FScalableFloat Duration2PlayerScale; // 0xb0(0x20)
	struct FScalableFloat DamageFraction2PlayerScale; // 0xd0(0x20)
	struct FScalableFloat Duration3PlayerScale; // 0xf0(0x20)
	struct FScalableFloat DamageFraction3PlayerScale; // 0x110(0x20)
	float COOLDOWN; // 0x130(0x04)
	float FallSpeed; // 0x134(0x04)
	float FallAcceleration; // 0x138(0x04)
	float OnGroundDuration; // 0x13c(0x04)
	struct FSoftObjectPath FallMontage; // 0x140(0x18)
	struct FName FallStart; // 0x158(0x08)
	struct UAITask_PlayAnimation* PlayAnimTask; // 0x160(0x08)
	char UnknownData_168[0x10]; // 0x168(0x10)

	void OnReachedGround(); // Function Madness.MadAIRes_DSFallToGround.OnReachedGround // (Final|Native|Protected) // @ game+0x154f2a0
	void OnAITaskEnded(struct UFWAITask* Task, enum class EFWAITaskResult Result); // Function Madness.MadAIRes_DSFallToGround.OnAITaskEnded // (Final|Native|Protected) // @ game+0x154efc0
};

// Class Madness.MadAIRes_DSGlideEvade
// Size: 0xf8 (Inherited: 0x70)
struct UMadAIRes_DSGlideEvade : UFWAIResponse {
	float MinDistanceToDestination; // 0x70(0x04)
	float MinDistanceToCurrentTarget; // 0x74(0x04)
	float MaxAngleToCurrentTarget; // 0x78(0x04)
	float MaxSpeedWhileEvading; // 0x7c(0x04)
	float MinTimeBetweenEvades; // 0x80(0x04)
	float MaxTimeToBeInChain; // 0x84(0x04)
	float MinTimeBetweenChains; // 0x88(0x04)
	int32_t ChainLength; // 0x8c(0x04)
	float MaxTimeSinceThreatenedToStartEvade; // 0x90(0x04)
	char UnknownData_94[0x4]; // 0x94(0x04)
	struct FGameplayTagContainer GameplayTags; // 0x98(0x20)
	struct FSoftObjectPath AvoidGlideMontage; // 0xb8(0x18)
	struct TArray<struct FName> AvoidGlideRightSections; // 0xd0(0x10)
	struct TArray<struct FName> AvoidGlideLeftSections; // 0xe0(0x10)
	char UnknownData_F0_0 : 7; // 0xf0(0x01)
	bool bEvadeOnAiming : 1; // 0xf0(0x01)
	char UnknownData_F1[0x7]; // 0xf1(0x07)

	void OnAITaskEnded(struct UFWAITask* Task, enum class EFWAITaskResult Result); // Function Madness.MadAIRes_DSGlideEvade.OnAITaskEnded // (Final|Native|Protected) // @ game+0x154f080
};

// Class Madness.MadAIRes_HeavyDamage
// Size: 0x70 (Inherited: 0x70)
struct UMadAIRes_HeavyDamage : UFWAIResponse {
};

// Class Madness.MadAIRes_LeaveCover
// Size: 0x78 (Inherited: 0x78)
struct UMadAIRes_LeaveCover : UFWAIRes_AbilityTag {
};

// Class Madness.MadAIRes_Lurker_Damage
// Size: 0x98 (Inherited: 0x70)
struct UMadAIRes_Lurker_Damage : UFWAIResponse {
	struct AMadCharAI_Lurker* MyCharacter; // 0x70(0x08)
	struct AMadAI_LurkerAlpha* AIController; // 0x78(0x08)
	char UnknownData_80[0x18]; // 0x80(0x18)
};

// Class Madness.MadAIRes_RecoverFromSkill
// Size: 0x78 (Inherited: 0x78)
struct UMadAIRes_RecoverFromSkill : UFWAIRes_AbilityTag {
};

// Class Madness.MadAIRes_Shotgunner_Desert_HeavyDamage
// Size: 0x70 (Inherited: 0x70)
struct UMadAIRes_Shotgunner_Desert_HeavyDamage : UFWAIResponse {
};

// Class Madness.MadAIRes_Shotgunner_HeavyDamage
// Size: 0x70 (Inherited: 0x70)
struct UMadAIRes_Shotgunner_HeavyDamage : UFWAIResponse {
};

// Class Madness.MadAIRes_WakeUpNeighbor
// Size: 0x70 (Inherited: 0x70)
struct UMadAIRes_WakeUpNeighbor : UFWAIResponse {
};

// Class Madness.MadGrenade
// Size: 0x5d0 (Inherited: 0x5c0)
struct AMadGrenade : AMadProjectile {
	struct FMulticastInlineDelegate GrenadeExploded; // 0x5c0(0x10)
};

// Class Madness.MadAirstrikeFlare
// Size: 0x690 (Inherited: 0x5d0)
struct AMadAirstrikeFlare : AMadGrenade {
	float RotationSpeed; // 0x5d0(0x04)
	float FlareDeactivationDelayInSeconds; // 0x5d4(0x04)
	struct UParticleSystemComponent* FlareParticleComp; // 0x5d8(0x08)
	struct UAudioComponent* AudioComponent; // 0x5e0(0x08)
	struct USoundCue* OnHitSoundCue; // 0x5e8(0x08)
	float AudioLoopFadeOutDuration; // 0x5f0(0x04)
	float FirstSpawnDelay; // 0x5f4(0x04)
	float TimeBetweenMissileSpawnsMin; // 0x5f8(0x04)
	float TimeBetweenMissileSpawnsMax; // 0x5fc(0x04)
	float MissileRadius; // 0x600(0x04)
	float MissilesSpawnOffsetMin; // 0x604(0x04)
	float MissilesSpawnOffsetMax; // 0x608(0x04)
	uint32_t MissileCount; // 0x60c(0x04)
	struct AProjectile* MissileClass; // 0x610(0x08)
	struct UBase3DWidgetComponent* HazardZoneWidget; // 0x618(0x08)
	char UnknownData_620[0x70]; // 0x620(0x70)

	void SpawnMissile(); // Function Madness.MadAirstrikeFlare.SpawnMissile // (Final|Native|Private) // @ game+0x1553bf0
	void OnFlareFuseBurned(); // Function Madness.MadAirstrikeFlare.OnFlareFuseBurned // (Final|Native|Private) // @ game+0x1553310
	void HandleSoundsOnHit(struct FVector HitLocation); // Function Madness.MadAirstrikeFlare.HandleSoundsOnHit // (Net|Native|Event|NetMulticast|Protected|HasDefaults) // @ game+0x1552b50
};

// Class Madness.MadAISquad_Lurker
// Size: 0x1c8 (Inherited: 0x1a8)
struct UMadAISquad_Lurker : UFWAISquad {
	struct TArray<struct AActor*> LurkerChargeTargets; // 0x1a8(0x10)
	struct TArray<struct AActor*> TargetedActors; // 0x1b8(0x10)

	void RemoveTargetedCharacterFromTheList(struct AActor* HostileActor); // Function Madness.MadAISquad_Lurker.RemoveTargetedCharacterFromTheList // (Final|Native|Public|BlueprintCallable) // @ game+0x1553850
	bool IsFreeTargetAvailable(struct AActor* AIController); // Function Madness.MadAISquad_Lurker.IsFreeTargetAvailable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1552da0
	bool IsActorTargeted(struct AActor* Actor); // Function Madness.MadAISquad_Lurker.IsActorTargeted // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1552c60
	bool IsActorOnToChargeAtList(struct AActor* TargetActor); // Function Madness.MadAISquad_Lurker.IsActorOnToChargeAtList // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1552bd0
	int32_t GetNumberOfTargetedActors(); // Function Madness.MadAISquad_Lurker.GetNumberOfTargetedActors // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1552b30
	struct AActor* GetNewTarget(struct AActor* AIController); // Function Madness.MadAISquad_Lurker.GetNewTarget // (Final|Native|Public|BlueprintCallable) // @ game+0x1552aa0
	void AddActorToChargeAtList(bool bAdd, struct AActor* TargetActor); // Function Madness.MadAISquad_Lurker.AddActorToChargeAtList // (Final|Native|Public|BlueprintCallable) // @ game+0x15529c0
};

// Class Madness.FWAISemaphoreGroupClass_Advance
// Size: 0x30 (Inherited: 0x30)
struct UFWAISemaphoreGroupClass_Advance : UFWAISemaphoreGroupClass {
};

// Class Madness.FWAISemaphoreGroupClass_Grenade
// Size: 0x30 (Inherited: 0x30)
struct UFWAISemaphoreGroupClass_Grenade : UFWAISemaphoreGroupClass {
};

// Class Madness.MadAISemaphoreGroupClass_SniperFireTickets
// Size: 0x30 (Inherited: 0x30)
struct UMadAISemaphoreGroupClass_SniperFireTickets : UFWAISemaphoreGroupClass {
};

// Class Madness.MadAISemaphoreGroupClass_MeleeAttack
// Size: 0x30 (Inherited: 0x30)
struct UMadAISemaphoreGroupClass_MeleeAttack : UFWAISemaphoreGroupClass {
};

// Class Madness.MadAISemaphoreGroupClass_BerserkerMoveToTarget
// Size: 0x30 (Inherited: 0x30)
struct UMadAISemaphoreGroupClass_BerserkerMoveToTarget : UFWAISemaphoreGroupClass {
};

// Class Madness.MadAISemaphoreGroupClass_SniperChangeSlot
// Size: 0x30 (Inherited: 0x30)
struct UMadAISemaphoreGroupClass_SniperChangeSlot : UFWAISemaphoreGroupClass {
};

// Class Madness.MadAISystem
// Size: 0x518 (Inherited: 0x408)
struct UMadAISystem : UFWAISystem {
	struct FString DefaultWssTweaks; // 0x408(0x10)
	char UnknownData_418[0x38]; // 0x418(0x38)
	struct TArray<struct AMadWanderingFlame*> SpawnedWanderingFlames; // 0x450(0x10)
	struct UCurveTable* SemaphoresCurveTable; // 0x460(0x08)
	struct UCurveTable* ChallengeSemaphoresCurveTable; // 0x468(0x08)
	char UnknownData_470[0x68]; // 0x470(0x68)
	struct TArray<struct UMadCoverBoxComponent*> AllCoverBox; // 0x4d8(0x10)
	struct TArray<struct UMadStaticNavModifierBoxComponent*> AllNavModBox; // 0x4e8(0x10)
	struct TArray<struct AMadNavModVolume*> AllNavModVolumes; // 0x4f8(0x10)
	char UnknownData_508[0x10]; // 0x508(0x10)

	void SetHasActiveAura(struct UObject* WorldContextObject, bool bValue); // Function Madness.MadAISystem.SetHasActiveAura // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1553ab0
	void OnWssOverridesDataTableReceived(bool bSuccess, struct UDataTable* Table, int32_t NewConfigStatus, int32_t BackendFailureCode); // Function Madness.MadAISystem.OnWssOverridesDataTableReceived // (Final|Native|Private) // @ game+0x1553710
	void OnRegionDifficultyDataTableReceived(bool bSuccess, struct UDataTable* Table, int32_t NewConfigStatus, int32_t BackendFailureCode); // Function Madness.MadAISystem.OnRegionDifficultyDataTableReceived // (Final|Native|Private) // @ game+0x15535b0
	void OnEventDataTableReceived(bool bSuccess, struct UDataTable* Table, int32_t NewConfigStatus, int32_t BackendFailureCode); // Function Madness.MadAISystem.OnEventDataTableReceived // (Final|Native|Private) // @ game+0x15531d0
	bool IsAnyAuraActive(struct UObject* WorldContextObject); // Function Madness.MadAISystem.IsAnyAuraActive // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1552d20
	void DisplayBiom(); // Function Madness.MadAISystem.DisplayBiom // (Exec|Native|Public) // @ game+0x1552a80
};

// Class Madness.MadAITask_ChangeCoverSlot
// Size: 0xa0 (Inherited: 0x98)
struct UMadAITask_ChangeCoverSlot : UFWAITask {
	struct UEnvQuery* QueryTemplate; // 0x98(0x08)
};

// Class Madness.MadAITask_ClimbCover
// Size: 0x128 (Inherited: 0x128)
struct UMadAITask_ClimbCover : UFWAITask_MantleOverCover {
};

// Class Madness.MadAITask_DesertShotgunner_ShieldActivation
// Size: 0xa0 (Inherited: 0x98)
struct UMadAITask_DesertShotgunner_ShieldActivation : UFWAITask {
	struct UAnimMontage* MontageAsset; // 0x98(0x08)
};

// Class Madness.MadAITask_DSGlideEvade
// Size: 0x130 (Inherited: 0xf0)
struct UMadAITask_DSGlideEvade : UAITask_PlayAnimation {
	char UnknownData_F0[0x30]; // 0xf0(0x30)
	struct USkeletalMeshComponent* MyMeshComp; // 0x120(0x08)
	struct UMadPathFollowingComponent_DesertSciathan* PathFollowerComp; // 0x128(0x08)

	void NotifyEndReceived(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAITask_DSGlideEvade.NotifyEndReceived // (Final|Native|Protected) // @ game+0x1552f30
	void NotifyBeginReceived(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadAITask_DSGlideEvade.NotifyBeginReceived // (Final|Native|Protected) // @ game+0x1552e30
};

// Class Madness.MadAITask_Jump
// Size: 0x138 (Inherited: 0x138)
struct UMadAITask_Jump : UFWAITask_Jump {
};

// Class Madness.MadAITask_MantleOverCover
// Size: 0x128 (Inherited: 0x128)
struct UMadAITask_MantleOverCover : UFWAITask_MantleOverCover {
};

// Class Madness.MadAITask_RotateRequest
// Size: 0x98 (Inherited: 0x98)
struct UMadAITask_RotateRequest : UFWAITask {
};

// Class Madness.MadAITask_RunAway
// Size: 0xc0 (Inherited: 0x98)
struct UMadAITask_RunAway : UFWAITask {
	char UnknownData_98[0x28]; // 0x98(0x28)
};

// Class Madness.MadAITask_ScriptedGoto
// Size: 0xd8 (Inherited: 0x98)
struct UMadAITask_ScriptedGoto : UFWAITask {
	char UnknownData_98[0x30]; // 0x98(0x30)
	struct AActor* GoalActor; // 0xc8(0x08)
	char UnknownData_D0[0x8]; // 0xd0(0x08)

	struct UMadAITask_ScriptedGoto* ScriptedGoTo(struct AAIController* Controller, struct FCoverSlotInfo CoverSlotInfo, struct FVector GoalLocation, struct AActor* GoalActor, enum class EMovementMood NewMood, bool bEquipWeapon); // Function Madness.MadAITask_ScriptedGoto.ScriptedGoTo // (Final|Native|Static|Public|HasDefaults|BlueprintCallable) // @ game+0x15538d0
};

// Class Madness.MadAITask_SniperPeekAction
// Size: 0x130 (Inherited: 0x130)
struct UMadAITask_SniperPeekAction : UFWAITask_PeekAction {
};

// Class Madness.MadBackpackComponent
// Size: 0x1110 (Inherited: 0xe40)
struct UMadBackpackComponent : UFWBackpackComponent {
	struct UParticleSystem* SmokeParticle; // 0xe38(0x08)
	struct FVector ParticleRelativeLocation; // 0xe40(0x0c)
	struct FRotator ParticleRelativeRotation; // 0xe4c(0x0c)
	struct FVector SmokeParticleScaleMin; // 0xe58(0x0c)
	struct FVector SmokeParticleScaleMax; // 0xe64(0x0c)
	int32_t ParticleScaleChangeStepsNum; // 0xe70(0x04)
	struct USoundBase* SmokeSound; // 0xe78(0x08)
	struct UAnimMontage* ExplosionAnim; // 0xe80(0x08)
	struct UMadDamageType* BackpackSelfExplosionDT; // 0xe88(0x08)
	struct UMaterial* BackpackDamagedMaterial; // 0xe90(0x08)
	struct FString CurveTableRowName; // 0xe98(0x10)
	struct UCurveTable* CurveTable; // 0xea8(0x08)
	struct FGameplayTagContainer GameplayTags; // 0xeb0(0x20)
	struct FTakeHitInfo LastHitInfo; // 0xed0(0x200)
	char UnknownData_10D4[0x4]; // 0x10d4(0x04)
	struct UParticleSystemComponent* ParticleSystemComponent; // 0x10d8(0x08)
	struct UAudioComponent* AudioComponent; // 0x10e0(0x08)
	char UnknownData_10E8_0 : 7; // 0x10e8(0x01)
	bool bExplosionHandled : 1; // 0x10e8(0x01)
	char UnknownData_10E9[0x27]; // 0x10e9(0x27)

	void OnRep_Explosion(); // Function Madness.MadBackpackComponent.OnRep_Explosion // (Final|Native|Private) // @ game+0x15735f0
	void OnAnimNotify(struct FName NotifyName, struct USkeletalMeshComponent* MeshComp, struct UAnimSequenceBase* Animation); // Function Madness.MadBackpackComponent.OnAnimNotify // (Native|Protected) // @ game+0x1572ff0
};

// Class Madness.MadAlphaPerforoBackpackComponent
// Size: 0x1120 (Inherited: 0x1110)
struct UMadAlphaPerforoBackpackComponent : UMadBackpackComponent {
	struct FGameplayTag AbilityTag; // 0x1110(0x08)
	struct USkeletalMesh* DestroyedSkeletalMesh; // 0x1118(0x08)
};

// Class Madness.MadItem
// Size: 0x4c0 (Inherited: 0x300)
struct AMadItem : AInventoryItem {
	struct USceneComponent* Scene; // 0x300(0x08)
	struct FGuid BackendId; // 0x308(0x10)
	struct FMadItemProperties Properties; // 0x318(0xa0)
	struct TArray<enum class EMadItemSlot> PossibleEquipmentSlots; // 0x3b8(0x10)
	struct FWeakObjectPtr<struct AMadInventory> MyMadInventory; // 0x3c8(0x08)
	char UnknownData_3D0_0 : 7; // 0x3d0(0x01)
	bool bWasPickedUp : 1; // 0x3d0(0x01)
	char UnknownData_3D1[0xc7]; // 0x3d1(0xc7)
	struct FMadEnhanceMods EnhanceMods; // 0x498(0x10)
	int32_t ImproveCounter; // 0x4a8(0x04)
	int32_t ChangeModCounter; // 0x4ac(0x04)
	int32_t ChangeConfigVariantCounter; // 0x4b0(0x04)
	int32_t LevelCounter; // 0x4b4(0x04)
	struct FName Paint; // 0x4b8(0x08)

	void ServerSetSkin(struct FName InSkinName); // Function Madness.MadItem.ServerSetSkin // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657d50
	void ServerSetRecent(bool bRecent); // Function Madness.MadItem.ServerSetRecent // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657cc0
	void ServerSelectEnhanceMod(int32_t ModID); // Function Madness.MadItem.ServerSelectEnhanceMod // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657c30
	void ServerPaint(struct FName PaintName); // Function Madness.MadItem.ServerPaint // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657ba0
	void ServerLevel(); // Function Madness.MadItem.ServerLevel // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15da3d0
	void ServerImprove(int32_t AttributeId); // Function Madness.MadItem.ServerImprove // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657b10
	void ServerEnhance(); // Function Madness.MadItem.ServerEnhance // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657af0
	void ServerChangeModByName(int32_t SlotID, struct FName AvailableModName); // Function Madness.MadItem.ServerChangeModByName // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657a20
	void ServerChangeMod(int32_t SlotID, int32_t AvailableModId); // Function Madness.MadItem.ServerChangeMod // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x1657960
	void ServerChangeConfigVariant(struct FName ConfigVariantName); // Function Madness.MadItem.ServerChangeConfigVariant // (Net|NetReliableNative|Event|Public|NetServer|BlueprintCallable) // @ game+0x15da630
	struct TMap<struct FName, int32_t> RollDismantleYield(); // Function Madness.MadItem.RollDismantleYield // (Final|Native|Public|BlueprintCallable|BlueprintPure) // @ game+0x1657750
	void OnRep_Paint(); // Function Madness.MadItem.OnRep_Paint // (Native|Protected) // @ game+0x16574c0
	void OnRep_LevelCounter(); // Function Madness.MadItem.OnRep_LevelCounter // (Final|Native|Protected) // @ game+0x16574a0
	void OnRep_ImproveCounter(); // Function Madness.MadItem.OnRep_ImproveCounter // (Final|Native|Protected) // @ game+0x1657480
	void OnRep_EnhanceMods(); // Function Madness.MadItem.OnRep_EnhanceMods // (Final|Native|Public) // @ game+0x1657460
	void OnRep_ChangeModCounter(); // Function Madness.MadItem.OnRep_ChangeModCounter // (Final|Native|Protected) // @ game+0x1657440
	void OnRep_ChangeConfigVariantCounter(); // Function Madness.MadItem.OnRep_ChangeConfigVariantCounter // (Final|Native|Protected) // @ game+0x1657420
	bool IsScrappable(); // Function Madness.MadItem.IsScrappable // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16565d0
	bool IsRecent(); // Function Madness.MadItem.IsRecent // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656580
	enum class EMadItemType GetType(); // Function Madness.MadItem.GetType // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16564a0
	void GetTextName(struct FText OutName); // Function Madness.MadItem.GetTextName // (Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x16563d0
	struct FMadItemSkillData GetSkillData(); // Function Madness.MadItem.GetSkillData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656350
	struct FMadItemSaveData GetSaveData(); // Function Madness.MadItem.GetSaveData // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656290
	float GetRefinement(); // Function Madness.MadItem.GetRefinement // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656260
	int32_t GetRating(); // Function Madness.MadItem.GetRating // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656240
	enum class EMadItemRarity GetRarity(); // Function Madness.MadItem.GetRarity // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1656220
	struct FMadCraftingModUIData GetModUIData(struct UMadSkillData* Mod, int32_t ItemLevel); // Function Madness.MadItem.GetModUIData // (Final|Native|Static|Public|BlueprintCallable|BlueprintPure) // @ game+0x1656120
	void GetLoadedIcon(struct AMadPlayerCharacter* Observer, struct FDelegate IconLoaded); // Function Madness.MadItem.GetLoadedIcon // (Native|Public|HasOutParms|BlueprintCallable) // @ game+0x1655fd0
	int32_t GetLevel(); // Function Madness.MadItem.GetLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655e50
	struct FName GetKeyName(); // Function Madness.MadItem.GetKeyName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655e10
	struct FMadItemSaveData GetImprovePreview(int32_t AttributeId); // Function Madness.MadItem.GetImprovePreview // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655c40
	struct FString GetIconPath(struct AMadPlayerCharacter* Observer); // Function Madness.MadItem.GetIconPath // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655b60
	struct UTexture2D* GetIcon(struct AMadPlayerCharacter* Observer); // Function Madness.MadItem.GetIcon // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655ac0
	struct FString GetFullName(); // Function Madness.MadItem.GetFullName // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655a70
	int32_t GetFirepowerOrArmor(); // Function Madness.MadItem.GetFirepowerOrArmor // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655a40
	struct FText GetDescription(); // Function Madness.MadItem.GetDescription // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16558d0
	enum class EMadItemSlot GetCurrentTargetEquipmentSlot(struct AMadInventory* ExternalInventory); // Function Madness.MadItem.GetCurrentTargetEquipmentSlot // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655830
	struct FName GetCurrentSkin(); // Function Madness.MadItem.GetCurrentSkin // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16557f0
	struct FName GetCurrentPaint(); // Function Madness.MadItem.GetCurrentPaint // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16557d0
	struct TArray<struct FMadAnomalyCrystal> GetCrystals(); // Function Madness.MadItem.GetCrystals // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655750
	struct FMadCraftingModUIData GetCraftingModUIData(int32_t ModSlotId); // Function Madness.MadItem.GetCraftingModUIData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655680
	struct FMadCraftingConfigVariantUIData GetCraftingConfigVariantUIData(); // Function Madness.MadItem.GetCraftingConfigVariantUIData // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655580
	struct FName GetConfigVariantName(); // Function Madness.MadItem.GetConfigVariantName // (Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655540
	struct TArray<struct FMadAttribute> GetAttributes(); // Function Madness.MadItem.GetAttributes // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1655430
	struct TArray<struct FMadCraftingModsTierUIData> DebugGetCraftingModsUIData(int32_t ModSlotId); // Function Madness.MadItem.DebugGetCraftingModsUIData // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16552f0
	bool CanLevel(bool bCheckCost); // Function Madness.MadItem.CanLevel // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x16551a0
	bool CanImprove(int32_t AttributeId, bool bCheckCost); // Function Madness.MadItem.CanImprove // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1654fe0
	bool CanEnhance(bool bCheckCost); // Function Madness.MadItem.CanEnhance // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1654f50
	struct FMadCraftingModAvailability CanChangeMod(struct FName AvailableModName, bool bCheckCost); // Function Madness.MadItem.CanChangeMod // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1654e10
	struct FMadCraftingConfigVariantAvailability CanChangeConfigVariant(struct FName ConfigVariantName, bool bCheckCost); // Function Madness.MadItem.CanChangeConfigVariant // (Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const) // @ game+0x1654d20
};

// Class Madness.MadAmmo
// Size: 0x4c0 (Inherited: 0x4c0)
struct AMadAmmo : AMadItem {

	struct AMadAmmo* SpawnAmmo(struct UObject* WorldContextObject); // Function Madness.MadAmmo.SpawnAmmo // (Final|BlueprintAuthorityOnly|Native|Static|Public|BlueprintCallable) // @ game+0x1553b70
};

// Class Madness.MadAmmoChest
// Size: 0x340 (Inherited: 0x2f0)
struct AMadAmmoChest : AActor {
	struct USceneComponent* Scene; // 0x2f0(0x08)
	struct USkeletalMeshComponent* ChestMesh; // 0x2f8(0x08)
	struct UAnimMontage* CharAnim; // 0x300(0x08)
	struct UAnimMontage* ChestAnim; // 0x308(0x08)
	struct ULocalInteractionComponent* LocalInteractionComponent; // 0x310(0x08)
	char UnknownData_318_0 : 7; // 0x318(0x01)
	bool bCheckPlayerInArea : 1; // 0x318(0x01)
	char UnknownData_319[0x7]; // 0x319(0x07)
	struct AVolume* AreaVolume; // 0x320(0x08)
	char UnknownData_328_0 : 7; // 0x328(0x01)
	bool bShowMinimapIconOnPlayerEnterArea : 1; // 0x328(0x01)
	char UnknownData_329[0xf]; // 0x329(0x0f)
	struct UMinimapNodeComponent* CachedMinimapNodeComp; // 0x338(0x08)

	void OnOpen(); // Function Madness.MadAmmoChest.OnOpen // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void OnInteractionNotify(struct ABaseCharacter* InteractingPawn, struct ULocalInteractionComponent* InteractedWith, struct FName NotifyName); // Function Madness.MadAmmoChest.OnInteractionNotify // (Final|Native|Protected) // @ game+0x15534b0
	void OnInteractionAnimStarted(struct ABasePlayerController* InteractingController, struct ULocalInteractionComponent* InteractedWith); // Function Madness.MadAmmoChest.OnInteractionAnimStarted // (Final|Native|Protected) // @ game+0x15533f0
	void OnInteracted(struct ABasePlayerController* InteractingController, struct ULocalInteractionComponent* InteractedWith); // Function Madness.MadAmmoChest.OnInteracted // (Final|Native|Protected) // @ game+0x1553330
	void OnAreaEndOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Madness.MadAmmoChest.OnAreaEndOverlap // (Final|Native|Protected) // @ game+0x1553110
	void OnAreaBeginOverlap(struct AActor* OverlappedActor, struct AActor* OtherActor); // Function Madness.MadAmmoChest.OnAreaBeginOverlap // (Final|Native|Protected) // @ game+0x1553050
	void OnAnimationEnded(); // Function Madness.MadAmmoChest.OnAnimationEnded // (Final|Native|Protected) // @ game+0x1553030
};

// Class Madness.MadAngryStatusVisualComponent
// Size: 0x1b0 (Inherited: 0x180)
struct UMadAngryStatusVisualComponent : UActorComponent {
	struct FVector DefaultEmissiveValue; // 0x180(0x0c)
	struct FVector AngryEmissiveValue; // 0x18c(0x0c)
	struct FName EmissiveParamName; // 0x198(0x08)
	struct UStaticMeshComponent* MeshComponent; // 0x1a0(0x08)
	char bIsAngry : 1; // 0x1a8(0x01)
	char UnknownData_1A8_1 : 7; // 0x1a8(0x01)
	char UnknownData_1A9[0x7]; // 0x1a9(0x07)

	void OnRep_IsAngry(); // Function Madness.MadAngryStatusVisualComponent.OnRep_IsAngry // (Final|Native|Protected) // @ game+0x15536f0
};

// Class Madness.MadAnimationGlobals
// Size: 0x38 (Inherited: 0x30)
struct UMadAnimationGlobals : UDataAsset {
	struct UWeaponEquipAnimData* WeaponEquips; // 0x30(0x08)
};

// Class Madness.MadAnimationProxyDataPlayer
// Size: 0xc0 (Inherited: 0x28)
struct UMadAnimationProxyDataPlayer : UBaseAnimProxyData {
	float MoveForwardSpeed; // 0x28(0x04)
	float MoveRightSpeed; // 0x2c(0x04)
	float MoveSpeed; // 0x30(0x04)
	float MoveAngle; // 0x34(0x04)
	enum class EPlayerMovementSpeed MoveSpeedType; // 0x38(0x01)
	enum class ECoverMovementDirection CoverFacing; // 0x39(0x01)
	char UnknownData_3A_0 : 7; // 0x3a(0x01)
	bool bStrafing : 1; // 0x3a(0x01)
	char UnknownData_3B_0 : 7; // 0x3b(0x01)
	bool bBackward : 1; // 0x3b(0x01)
	float SideArcStrength; // 0x3c(0x04)
	char UnknownData_40_0 : 7; // 0x40(0x01)
	bool bInCombat : 1; // 0x40(0x01)
	char UnknownData_41_0 : 7; // 0x41(0x01)
	bool bNoWeapon : 1; // 0x41(0x01)
	char UnknownData_42_0 : 7; // 0x42(0x01)
	bool bTargeting : 1; // 0x42(0x01)
	char UnknownData_43_0 : 7; // 0x43(0x01)
	bool bWantsAndCanFire : 1; // 0x43(0x01)
	char UnknownData_44_0 : 7; // 0x44(0x01)
	bool bFiring : 1; // 0x44(0x01)
	enum class EWeaponState WeaponState; // 0x45(0x01)
	enum class ECombatState CombatState; // 0x46(0x01)
	char UnknownData_47_0 : 7; // 0x47(0x01)
	bool IsWeaponPostFiringDelayActive : 1; // 0x47(0x01)
	char UnknownData_48_0 : 7; // 0x48(0x01)
	bool bCharacterWantedToFireRecently : 1; // 0x48(0x01)
	char UnknownData_49_0 : 7; // 0x49(0x01)
	bool bDisableLooktAtCurveActive : 1; // 0x49(0x01)
	enum class EMadAimOffsetType AimOffsetType; // 0x4a(0x01)
	char UnknownData_4B[0x1]; // 0x4b(0x01)
	float GripMode; // 0x4c(0x04)
	float GroundIKMultiplierAlpha; // 0x50(0x04)
	float Slope; // 0x54(0x04)
	struct FVector2D Aim; // 0x58(0x08)
	struct FVector2D HeadAimOffset; // 0x60(0x08)
	float AimAlpha; // 0x68(0x04)
	char UnknownData_6C_0 : 7; // 0x6c(0x01)
	bool bShouldKeepFiringAimOffset : 1; // 0x6c(0x01)
	char UnknownData_6D_0 : 7; // 0x6d(0x01)
	bool bShouldKeepIdleAimOffset : 1; // 0x6d(0x01)
	char UnknownData_6E_0 : 7; // 0x6e(0x01)
	bool bShouldResetWeaponFiredRecently : 1; // 0x6e(0x01)
	char UnknownData_6F[0x1]; // 0x6f(0x01)
	float ScriptedLookAtAlpha; // 0x70(0x04)
	struct FVector ScriptedLookAtLocation; // 0x74(0x0c)
	struct FVector LocationInDirectionToCrosshair; // 0x80(0x0c)
	float PhysicalVelocity; // 0x8c(0x04)
	float MoveActionAngle; // 0x90(0x04)
	float MoveActionProgress; // 0x94(0x04)
	enum class None MoveActionSeed; // 0x98(0x01)
	enum class EPlayerMoveAction MoveAction; // 0x99(0x01)
	enum class EPlayerLocomotionState LocomotionState; // 0x9a(0x01)
	char UnknownData_9B_0 : 7; // 0x9b(0x01)
	bool bIsFalling : 1; // 0x9b(0x01)
	float FallingInitialZ; // 0x9c(0x04)
	float FallingMaxZDelta; // 0xa0(0x04)
	float FallingForceRatio; // 0xa4(0x04)
	char UnknownData_A8_0 : 7; // 0xa8(0x01)
	bool bIsSliding : 1; // 0xa8(0x01)
	char UnknownData_A9[0x3]; // 0xa9(0x03)
	float FallingForceRatioSliding; // 0xac(0x04)
	enum class EMadGender CharacterGender; // 0xb0(0x01)
	char UnknownData_B1[0xf]; // 0xb1(0x0f)

	bool WantsToMove(); // Function Madness.MadAnimationProxyDataPlayer.WantsToMove // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x1553c10
};

// Class Madness.MadAnimationProxyDataPlayerCover
// Size: 0xd8 (Inherited: 0xc0)
struct UMadAnimationProxyDataPlayerCover : UMadAnimationProxyDataPlayer {
	char UnknownData_C0_0 : 7; // 0xc0(0x01)
	bool bInCover : 1; // 0xc0(0x01)
	enum class ECoverSlotType CoverHeight; // 0xc1(0x01)
	enum class ECoverMovementDirection WeaponAttachment; // 0xc2(0x01)
	enum class ECoverSlotPeekType CoverPeekType; // 0xc3(0x01)
	char UnknownData_C4_0 : 7; // 0xc4(0x01)
	bool bIsCoverPeeking : 1; // 0xc4(0x01)
	char UnknownData_C5_0 : 7; // 0xc5(0x01)
	bool bInBoundary : 1; // 0xc5(0x01)
	char UnknownData_C6_0 : 7; // 0xc6(0x01)
	bool bWantsToSprintOrRollOut : 1; // 0xc6(0x01)
	char UnknownData_C7_0 : 7; // 0xc7(0x01)
	bool bSprintingToCover : 1; // 0xc7(0x01)
	enum class ECoverToCoverMoveType CoverToCoverMoveType; // 0xc8(0x01)
	char UnknownData_C9[0x3]; // 0xc9(0x03)
	float DistanceToCover; // 0xcc(0x04)
	char UnknownData_D0_0 : 7; // 0xd0(0x01)
	bool bShouldLimitAimPitch : 1; // 0xd0(0x01)
	enum class ECoverMovementDirection LastWeaponUsageCoverDirection; // 0xd1(0x01)
	char UnknownData_D2[0x6]; // 0xd2(0x06)
};

// Class Madness.MadAnimInstance_AIBase
// Size: 0x2e0 (Inherited: 0x2c0)
struct UMadAnimInstance_AIBase : UAnimInstance {
	char UnknownData_2C0[0x20]; // 0x2c0(0x20)

	void RegisterGameplayTagHandler(struct FGameplayTag Tag); // Function Madness.MadAnimInstance_AIBase.RegisterGameplayTagHandler // (Native|Protected|BlueprintCallable) // @ game+0x155a6f0
	void K2_RegisterGameplayTags(); // Function Madness.MadAnimInstance_AIBase.K2_RegisterGameplayTags // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	void K2_OnTagChanged(struct FGameplayTag InGameplayTag, int32_t InCount, bool WasTagRemoved); // Function Madness.MadAnimInstance_AIBase.K2_OnTagChanged // (Event|Protected|BlueprintEvent) // @ game+0x1a35c70
	bool HasAnimatingAbility(); // Function Madness.MadAnimInstance_AIBase.HasAnimatingAbility // (Final|Native|Protected|BlueprintCallable) // @ game+0x155a570
};

// Class Madness.MadAnimInstance_AntFarm
// Size: 0xb20 (Inherited: 0xb10)
struct UMadAnimInstance_AntFarm : UPcfAnimInstance {
	enum class EIKAttachmentType IKAttachmentType; // 0xb10(0x01)
	char UnknownData_B11[0x3]; // 0xb11(0x03)
	float IKWeight; // 0xb14(0x04)
	float PartialAnimationWeight; // 0xb18(0x04)
	char bEnableFootIKLock : 1; // 0xb1c(0x01)
	char bEnableIKAttachmentForNPCs : 1; // 0xb1c(0x01)
	char bCanUseAimLocation : 1; // 0xb1c(0x01)
	char UnknownData_B1C_3 : 5; // 0xb1c(0x01)
	enum class EPcfLocomotionMovement CachedLocomotionState; // 0xb1d(0x01)
	char UnknownData_B1E[0x2]; // 0xb1e(0x02)
};

// Class Madness.MadAnimInstance_AntFarmSimple
// Size: 0x3e0 (Inherited: 0x3b0)
struct UMadAnimInstance_AntFarmSimple : UAnimInstanceWithLateral {
	struct UAnimSequenceBase* AntFarmActiveAnim; // 0x3a8(0x08)
	struct UAnimSequenceBase* AntFarmReactionAnim; // 0x3b0(0x08)
	float AntFarmActiveAnimStartPos; // 0x3b8(0x04)
	struct FVector AimLocation; // 0x3bc(0x0c)
	char UnknownData_3D0_0 : 7; // 0x3d0(0x01)
	bool bEnableAimOffset : 1; // 0x3c8(0x01)
	bool bReactionAnimIsPlaying : 1; // 0x3c9(0x01)
	bool bEnableIKAttachmentForNPCs : 1; // 0x3ca(0x01)
	enum class EIKAttachmentType IKAttachmentType; // 0x3cb(0x01)
	float IKWeight; // 0x3cc(0x04)
	bool bResetFlag : 1; // 0x3d0(0x01)
	char UnknownData_3D6[0xa]; // 0x3d6(0x0a)

	void SetReactionAnimIsPlaying(bool bIsPlaying); // Function Madness.MadAnimInstance_AntFarmSimple.SetReactionAnimIsPlaying // (Final|Native|Public|BlueprintCallable) // @ game+0x155a9b0
	void SetAntFarmReactionAnimation(struct UAnimSequenceBase* AntFarmAnim); // Function Madness.MadAnimInstance_AntFarmSimple.SetAntFarmReactionAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x155a880
	void SetAntFarmActiveAnimStartPos(float Pos); // Function Madness.MadAnimInstance_AntFarmSimple.SetAntFarmActiveAnimStartPos // (Final|Native|Public|BlueprintCallable) // @ game+0x155a800
	void SetActiveAntFarmAnimation(struct UAnimSequenceBase* AntFarmAnim); // Function Madness.MadAnimInstance_AntFarmSimple.SetActiveAntFarmAnimation // (Final|Native|Public|BlueprintCallable) // @ game+0x155a780
	struct UAnimSequenceBase* GetAntFarmReactionAnimation(); // Function Madness.MadAnimInstance_AntFarmSimple.GetAntFarmReactionAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a2a0
	struct UAnimSequenceBase* GetActiveAntFarmAnimation(); // Function Madness.MadAnimInstance_AntFarmSimple.GetActiveAntFarmAnimation // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a270
};

// Class Madness.MadAnimInstance_ConvoyTruck
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMadAnimInstance_ConvoyTruck : UAnimInstance {
	float TimeSeconds; // 0x2c0(0x04)
	char UnknownData_2C4[0xc]; // 0x2c4(0x0c)

	float Oscillate(float InputTime, float CycleTime, float Amplitude, float InitialPhase); // Function Madness.MadAnimInstance_ConvoyTruck.Oscillate // (Final|Native|Public|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a5a0
};

// Class Madness.MadAnimInstance_CrawlerW
// Size: 0x2e0 (Inherited: 0x2e0)
struct UMadAnimInstance_CrawlerW : UMadAnimInstance_AIBase {
	float RootBoneCorrectionOffset; // 0x2d8(0x04)

	bool GetDotFromForward(struct FVector FocalPoint, float DotToFocal); // Function Madness.MadAnimInstance_CrawlerW.GetDotFromForward // (Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a2d0
};

// Class Madness.MadAnimInstance_CustomBipedal
// Size: 0x390 (Inherited: 0x2e0)
struct UMadAnimInstance_CustomBipedal : UMadAnimInstance_AIBase {
	struct UAnimSequenceBase* IdleAnimCombatRun; // 0x2d8(0x08)
	struct UAnimMontage* TurnInPlace[0x9]; // 0x2e0(0x48)
	struct UAnimMontage* StartMovement[0x9]; // 0x328(0x48)
	struct UBlendSpace* MovementLoopCombatRun[0x4]; // 0x370(0x20)

	struct UAnimMontage* GetTurnInPlace(enum class EDirectionalMontage Direction); // Function Madness.MadAnimInstance_CustomBipedal.GetTurnInPlace // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a4e0
	struct UBlendSpace* GetMovementLoop(int32_t MovementLoopIndex); // Function Madness.MadAnimInstance_CustomBipedal.GetMovementLoop // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a450
	struct UAnimMontage* GetGetStartMovement(enum class EDirectionalMontage Direction); // Function Madness.MadAnimInstance_CustomBipedal.GetGetStartMovement // (Final|Native|Protected|BlueprintCallable|BlueprintPure|Const) // @ game+0x155a3c0
};

// Class Madness.MadAnimReplication_DesertSciathan
// Size: 0x290 (Inherited: 0x260)
struct UMadAnimReplication_DesertSciathan : UPCFAnimReplication {
	char UnknownData_260_0 : 7; // 0x260(0x01)
	bool bIsGliding : 1; // 0x260(0x01)
	char UnknownData_261_0 : 7; // 0x261(0x01)
	bool bIsGlideDiving : 1; // 0x261(0x01)
	char UnknownData_262_0 : 7; // 0x262(0x01)
	bool bIsOnGround : 1; // 0x262(0x01)
	char UnknownData_263[0x1]; // 0x263(0x01)
	float GlideDiveHeightFraction; // 0x264(0x04)
	struct FRotator OverrideRotation; // 0x268(0x0c)
	struct FVector FocalPoint; // 0x274(0x0c)
	struct FVector CurrentPathDestination; // 0x280(0x0c)
	char UnknownData_28C[0x4]; // 0x28c(0x04)
};

// Class Madness.MadAnimInstance_DesertSciathan
// Size: 0xb60 (Inherited: 0xb10)
struct UMadAnimInstance_DesertSciathan : UPcfAnimInstance {
	char UnknownData_B10_0 : 7; // 0xb10(0x01)
	bool bIsGliding : 1; // 0xb10(0x01)
	char UnknownData_B11_0 : 7; // 0xb11(0x01)
	bool bIsOnGround : 1; // 0xb11(0x01)
	char UnknownData_B12[0x2]; // 0xb12(0x02)
	struct FRotator OverrideRotationSpeed; // 0xb14(0x0c)
	struct FRotator OverrideRotation; // 0xb20(0x0c)
	struct FVector FocalPoint; // 0xb2c(0x0c)
	struct FVector CurrentPathDestination; // 0xb38(0x0c)
	float MaxGlideRollAngle; // 0xb44(0x04)
	float MaxYawDifferenceToMaxRoll; // 0xb48(0x04)
	float RollChangeSpeed; // 0xb4c(0x04)
	float GlideRoll; // 0xb50(0x04)
	float GlideDiveHeightFraction; // 0xb54(0x04)
	float AdditiveReactionWeight; // 0xb58(0x04)
	char UnknownData_B5C_0 : 7; // 0xb5c(0x01)
	bool bIsGlideDiving : 1; // 0xb5c(0x01)
	enum class None DamageTakenReactionMin; // 0xb5d(0x01)
	enum class None DamageTakenReactionMax; // 0xb5e(0x01)
	enum class None DamageTakenReaction; // 0xb5f(0x01)

	void SetRandomDamageTakenReaction(); // Function Madness.MadAnimInstance_DesertSciathan.SetRandomDamageTakenReaction // (Final|Native|Public|BlueprintCallable) // @ game+0x155a990
};

// Class Madness.MadAnimInstance_EnemyWithFacial
// Size: 0xb40 (Inherited: 0xb10)
struct UMadAnimInstance_EnemyWithFacial : UPcfAnimInstance {
	char UnknownData_B10[0x8]; // 0xb10(0x08)
	struct UDNAContext* DNAContext; // 0xb18(0x08)
	char UnknownData_B20[0x20]; // 0xb20(0x20)
};

// Class Madness.MadAnimInstance_Lurker
// Size: 0x2d0 (Inherited: 0x2c0)
struct UMadAnimInstance_Lurker : UAnimInstance {
	float RootBoneCorrectionOffset; // 0x2c0(0x04)
	char UnknownData_2C4[0xc]; // 0x2c4(0x0c)
};

// Class Madness.MadAnimInstance_LurkerBase
// Size: 0xb20 (Inherited: 0xb10)
struct UMadAnimInstance_LurkerBase : UPcfAnimInstance {
	float FootIKEnableBlendSpeed; // 0xb10(0x04)
	float AimOffsetEnableBlendSpeed; // 0xb14(0x04)
	float FootLockIKWeight; // 0xb18(0x04)
	float AimOffsetWeight; // 0xb1c(0x04)
};

// Class Madness.MadAnimReplication_SoldierBase
// Size: 0x268 (Inherited: 0x260)
struct UMadAnimReplication_SoldierBase : UPCFAnimReplication {
	struct UFWAIWeaponComponent* CachedWeaponComponent; // 0x260(0x08)
};

// Class Madness.MadAnimInstance_SoldierBase
// Size: 0xb90 (Inherited: 0xb40)
struct UMadAnimInstance_SoldierBase : UMadAnimInstance_EnemyWithFacial {
	struct FVector ActiveWeaponScale; // 0xb38(0x0c)
	struct FVector ActiveWeaponGripPosition; // 0xb44(0x0c)
	float CummulativeRecoilAdditiveWeight; // 0xb50(0x04)
	float CummulativeRecoilAdditiveWeightMax; // 0xb54(0x04)
	float CummulativeRecoilAdditiveBlendInSpeed; // 0xb58(0x04)
	float CummulativeRecoilAdditiveBlendOutSpeed; // 0xb5c(0x04)
	float AimOffsetBlendSpeed; // 0xb60(0x04)
	float AimOffsetWeight; // 0xb64(0x04)
	float FootLockBlendSpeed; // 0xb68(0x04)
	float MinFootLockWeight; // 0xb6c(0x04)
	float FootLockWeight; // 0xb70(0x04)
	struct FName CummulativeRecoilSlotName; // 0xb74(0x08)
	struct FName WeaponGripSocketName; // 0xb7c(0x08)
	enum class EFWAIWeaponSlot ActiveWeaponSlot; // 0xb84(0x01)
	char UnknownData_B8D_0 : 7; // 0xb8d(0x01)
	bool bShouldPlayCummulativeAdditveRecoil : 1; // 0xb85(0x01)
	bool bCummulativeAdditveRecoilIsPlaying : 1; // 0xb86(0x01)
	bool bAnyCoverActive : 1; // 0xb87(0x01)
	bool bShouldApplyWeaponGrip : 1; // 0xb88(0x01)
	bool bShouldUseFaceAnimation : 1; // 0xb89(0x01)
	char UnknownData_B8E[0x2]; // 0xb8e(0x02)
};

// Class Madness.MadAnimInstance_Tick
// Size: 0x2e0 (Inherited: 0x2e0)
struct UMadAnimInstance_Tick : UMadAnimInstance_AIBase {
	float PitchUpBlend; // 0x2d8(0x04)
	float PitchDownBlend; // 0x2dc(0x04)
};

// Class Madness.MadAnimInstance_VolcanoBoss
// Size: 0x300 (Inherited: 0x2c0)
struct UMadAnimInstance_VolcanoBoss : UAnimInstance {
	struct FVector LookAtTarget; // 0x2c0(0x0c)
	float LookAtClampAngle; // 0x2cc(0x04)
	char UnknownData_2D0_0 : 7; // 0x2d0(0x01)
	bool bUseIKForMeleeAttack : 1; // 0x2d0(0x01)
	char UnknownData_2D1_0 : 7; // 0x2d1(0x01)
	bool bWalkCycleTransitionOpen : 1; // 0x2d1(0x01)
	char UnknownData_2D2[0x2]; // 0x2d2(0x02)
	struct FVector MeleeAttackIKLocationLeft; // 0x2d4(0x0c)
	struct FVector MeleeAttackIKLocationRight; // 0x2e0(0x0c)
	struct FVector IKinemaSpineTargetLocation; // 0x2ec(0x0c)
	float CurrentTurnDegrees; // 0x2f8(0x04)
	float LegOffset; // 0x2fc(0x04)
};

// Class Madness.MadAnimReplication_WarzoneSciathan
// Size: 0x290 (Inherited: 0x290)
struct UMadAnimReplication_WarzoneSciathan : UMadAnimReplication_DesertSciathan {
};

