// BlueprintGeneratedClass MCSE_InFire_Death_3.MCSE_InFire_Death_2_C
// Size: 0x298 (Inherited: 0x238)
struct UMCSE_InFire_Death_2_C : UMadCharacterShaderEffect {
	struct FPointerToUberGraphFrame UberGraphFrame; // 0x238(0x08)
	float Burned_Body_Size_Multiplier:Value; // 0x240(0x04)
	float Burned_Body_TextureSize_Multiplier:Value; // 0x244(0x04)
	struct FLinearColor Burned_Body_Inside_Glow_Location:Value; // 0x248(0x10)
	struct FLinearColor Burned_Body_Inside_Glow_Shape:Value; // 0x258(0x10)
	struct FLinearColor Body_Flames_Location:Value; // 0x268(0x10)
	struct FLinearColor Body_Flames_Shape:Value; // 0x278(0x10)
	float Body_Flames_Size_Multiplier:Value; // 0x288(0x04)
	float Body_Flames_TextureSize_Multiplier:Value; // 0x28c(0x04)
	float Burned_body_opacity2:Begin Duration; // 0x290(0x04)
	float Burned_body_opacity3: Value; // 0x294(0x04)

	void OnCompleted_86AFC41E4A53AAC2768AC3BDCE57433C(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_86AFC41E4A53AAC2768AC3BDCE57433C // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_0ECD2C444C492407B7AF5494B000BB5D(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_0ECD2C444C492407B7AF5494B000BB5D // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_57F53C9345773DECA1E464AC5F240FCB(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_57F53C9345773DECA1E464AC5F240FCB // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_0D89E3834E27267AA5AFBBAB25B37932(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_0D89E3834E27267AA5AFBBAB25B37932 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_4C00B76D43C5AB44AB5F79ABCE3F494B(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_4C00B76D43C5AB44AB5F79ABCE3F494B // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_4EE281CF4BFD0D6909C000BBD1A37A78(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_4EE281CF4BFD0D6909C000BBD1A37A78 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_0D951CCC4E8DA3C62670F38FDD02D7DD(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_0D951CCC4E8DA3C62670F38FDD02D7DD // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_F83682384D0E1D4DE0D9ADAD36CD2645(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_F83682384D0E1D4DE0D9ADAD36CD2645 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_291A240A48C2966CF88F6C9B1AFEAD75(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_291A240A48C2966CF88F6C9B1AFEAD75 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_386444A84526D6B5EC01B491190C4FCC(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_386444A84526D6B5EC01B491190C4FCC // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_2CB3AFAE4F8AB0D2C2DC288EAAC04BCB(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_2CB3AFAE4F8AB0D2C2DC288EAAC04BCB // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_2DB14491448042C8D39E45BF8A69D224(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_2DB14491448042C8D39E45BF8A69D224 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_BB66FCCD4707DDCC00CFE4AC4C8BABBA(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_BB66FCCD4707DDCC00CFE4AC4C8BABBA // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_3DEAB8F448A8F78B8B7971BE6F4DC2E8(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_3DEAB8F448A8F78B8B7971BE6F4DC2E8 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_21B006B948E369C7C88A1E89E738752C(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_21B006B948E369C7C88A1E89E738752C // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_4FC1FEE74D430E2F279EA1A042AB89EC(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_4FC1FEE74D430E2F279EA1A042AB89EC // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_3D9AA84946D14775214E419CB4BEC437(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_3D9AA84946D14775214E419CB4BEC437 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_9A2EB73E4115694893A5F18CABA5F41A(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_9A2EB73E4115694893A5F18CABA5F41A // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_7F60B86E4F4CC138B168FDA01C074A40(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_7F60B86E4F4CC138B168FDA01C074A40 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_FCB5ED984C7F89C9EECA889DB8CF20BE(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_FCB5ED984C7F89C9EECA889DB8CF20BE // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_E65166C14B9656EDF3462CB4ACE4C380(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_E65166C14B9656EDF3462CB4ACE4C380 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_0A504D084212D805FBD05B822F76C10B(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_0A504D084212D805FBD05B822F76C10B // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_A161B9F84C4197534C5271A3A04711B2(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_A161B9F84C4197534C5271A3A04711B2 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_F4D5A2444533A8D42970FA809B942209(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_F4D5A2444533A8D42970FA809B942209 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_3533EC4B42CF8863A02895BEFAE419A0(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_3533EC4B42CF8863A02895BEFAE419A0 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_31E2C1AC40A762BF11DA0C8485E8D419(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_31E2C1AC40A762BF11DA0C8485E8D419 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_84AD3CCE4FF351EE1BDAD3BC4F07C787(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_84AD3CCE4FF351EE1BDAD3BC4F07C787 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_F5D044AB4E15D4686AD6DCBBA6C7104E(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_F5D044AB4E15D4686AD6DCBBA6C7104E // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_60CBFBCF4DC6D870C56DAC9590AFB11F(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_60CBFBCF4DC6D870C56DAC9590AFB11F // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_D3730FCA4503CB56C1D89DB20F3F3E69(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_D3730FCA4503CB56C1D89DB20F3F3E69 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_4C683DAA4E58C203B4D5A29F00D6EFA7(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_4C683DAA4E58C203B4D5A29F00D6EFA7 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_B8D662D6413B67B3F2289B9EAC1C8B83(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_B8D662D6413B67B3F2289B9EAC1C8B83 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_F3F2D782473684F8D76FAB874B022846(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_F3F2D782473684F8D76FAB874B022846 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnCompleted_650F7693474C2CF170511B8506FD96F1(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnCompleted_650F7693474C2CF170511B8506FD96F1 // (BlueprintCallable|BlueprintEvent) // @ game+0x1a35c70
	void OnBeginPlay(); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.OnBeginPlay // (Event|Public|BlueprintEvent) // @ game+0x1a35c70
	void ExecuteUbergraph_MCSE_InFire_Death_3(int32_t EntryPoint); // Function MCSE_InFire_Death_3.MCSE_InFire_Death_2_C.ExecuteUbergraph_MCSE_InFire_Death_3 // (Final|UbergraphFunction) // @ game+0x1a35c70
};

